<HTML>
<HEAD>

<P> [Note: Ce qui suit est la documentation originale pour PGP 2.6.2 du MIT, incluse ici dans une version non modifi&eacute;e. Pour une explication sur la mani&egrave;re dont PGP 2.6.3i diff&egrave;re de la version 2.6.2, voyez le fichier "readme.1st"]</P>
<P ALIGN="CENTER"><BR>
&nbsp; <BR>
&nbsp; <BR>
&nbsp; </P>
<P ALIGN="CENTER">Phil's Pretty Good Software <BR>
pr&eacute;sente </P>
<P ALIGN="CENTER">======= <BR>
PGP(tm) <BR>
======= </P>
<P ALIGN="CENTER">Pretty Good(tm) Privacy <BR>
Cryptographie &agrave; cl&eacute; publique pour tous </P>
<P ALIGN="CENTER">-------------------------- <BR>
Guide de l'utilisateur de PGP(tm) <BR>
Volume I : Questions essentielles <BR>
-------------------------- <BR>
par Philip Zimmermann <BR>
R&eacute;vis&eacute; le 11 Octobre 94 <BR>
(Traduction : fr.misc.cryptologie, 1998) <BR>
&nbsp; </P>
<P ALIGN="CENTER">PGP Version 2.6.2 - 11 Oct 94 <BR>
Logiciel par <BR>
Philip Zimmermann, et beaucoup d'autres.</P>
<P><BR>
&nbsp; </P>
<P><BR>
<BR>
<BR>
<BR>
<BR>
</P>
<P>R&eacute;sum&eacute;: PGP(tm) utilise la cryptographie &agrave; cl&eacute; publique pour prot&eacute;ger les e-mails et les fichiers de donn&eacute;es. Communiquez en toute s&eacute;curit&eacute; avec des gens que vous n'avez jamais rencontr&eacute;s, sans avoir besoin de canaux s&eacute;curis&eacute;s pour &eacute;changer les cl&eacute;s pr&eacute;alablement. PGP est rapide et poss&egrave;de de bonnes fonctionnalit&eacute;s, avec une gestion des cl&eacute;s sophistiqu&eacute;e, des signatures num&eacute;riques, une compression des donn&eacute;es, et une bonne ergonomie. <BR>
&nbsp; </P>
<P>Logiciel et documentation (c) Copyright 1990-1994 Philip Zimmermann. Tous droits r&eacute;serv&eacute;s. Pour des informations sur les licences, brevets, marques d&eacute;pos&eacute;es, limitations de responsabilit&eacute;, et contr&ocirc;le de l'exportation en dehors des USA, voyez le chapitre "Questions l&eacute;gales" dans le "Guide de l'utilisateur de PGP, Volume II: Questions Sp&eacute;ciales". Distribu&eacute; par le Massachusetts Institute of Technology. <BR>
&nbsp; </P>
<P>"Quoi que vous ferez, ce sera insignifiant, mais il est tr&egrave;s important que vous le fassiez." -Mahatma Gandhi ["Whatever you do will be insignificant, but it is very important that you do it." -Mahatma Gandhi] <BR>
&nbsp; </P>
<P>_ <BR>
Contenu <BR>
====== </P>
<P>Rapide survol <BR>
Pourquoi avez-vous besoin de PGP? <BR>
Comment &ccedil;a marche <BR>
Installation de PGP <BR>
Comment utiliser PGP <BR>
&nbsp; Voir un r&eacute;sum&eacute; de l'utilisation <BR>
&nbsp; Chiffrer un message <BR>
&nbsp; Chiffrer un message pour plusieurs destinataires <BR>
&nbsp; Signer un message <BR>
&nbsp; Signer et ensuite chiffrer <BR>
&nbsp; Utiliser seulement le chiffrement conventionnel <BR>
&nbsp; D&eacute;chiffrer et v&eacute;rifier les signatures <BR>
&nbsp; Gestion des cl&eacute;s <BR>
&nbsp;&nbsp;&nbsp; G&eacute;n&eacute;ration de la cl&eacute; RSA <BR>
&nbsp;&nbsp;&nbsp; Ajouter une cl&eacute; &agrave; votre trousseau de cl&eacute;s <BR>
&nbsp;&nbsp;&nbsp; Effacer une cl&eacute; ou un ID utilisateur de votre trousseau de cl&eacute;s <BR>
&nbsp;&nbsp;&nbsp; Extraire (copier) une cl&eacute; de votre trousseau de cl&eacute;s <BR>
&nbsp;&nbsp;&nbsp; Voir le contenu de votre trousseau de cl&eacute;s <BR>
&nbsp;&nbsp;&nbsp; Comment prot&eacute;ger les cl&eacute;s publiques de la falsification <BR>
&nbsp;&nbsp;&nbsp; Comment PGP sait quelles cl&eacute;s sont valides? <BR>
&nbsp;&nbsp;&nbsp; Comment prot&eacute;ger ses cl&eacute;s secr&egrave;tes de la divulgation <BR>
&nbsp;&nbsp;&nbsp; R&eacute;voquer une cl&eacute; publique <BR>
&nbsp;&nbsp;&nbsp; Que faire si vous perdez votre cl&eacute; secr&egrave;te? <BR>
Questions Avanc&eacute;es <BR>
&nbsp; Envoyer du texte chiffr&eacute; &agrave; travers les canaux e-mail: le format Radix-64 <BR>
&nbsp; Variable d'environnement pour le nom de chemin <BR>
&nbsp; R&eacute;gler les param&egrave;tres dans le fichier de configuration de PGP <BR>
Vuln&eacute;rabilit&eacute;s <BR>
Prenez garde &agrave; "l'Huile de Serpent" <BR>
Notice pour les utilisateurs de Macintosh <BR>
Aide-m&eacute;moire de PGP <BR>
Questions l&eacute;gales <BR>
Remerciements <BR>
A propos de l'auteur <BR>
&nbsp; </P>
<P>_ <BR>
Rapide survol <BR>
========== </P>
<P>Pretty Good(tm) Privacy (PGP) [ce qui signifie "Assez bonne confidentialit&eacute;"], de Phil's Pretty Good Software, est un logiciel cryptographique de haute s&eacute;curit&eacute; pour MSDOS, Unix, VAX/VMS, et d'autres ordinateurs. PGP permet aux gens d'&eacute;changer des fichiers avec confidentialit&eacute;, authentification, et commodit&eacute;. Confidentialit&eacute; signifie que seuls ceux destin&eacute;s &agrave; recevoir un message peuvent le lire. Authentification signifie que les messages qui semblent &eacute;maner d'une personne pr&eacute;cise ne peuvent &eacute;maner que de cette personne. Commodit&eacute; signifie que la confidentialit&eacute; et l'authentification sont assur&eacute;s sans les tracas de la gestion des cl&eacute;s accompagnant un logiciel de cryptographie conventionnelle. Aucun canal s&eacute;curis&eacute; n'est n&eacute;cessaire pour &eacute;changer les cl&eacute;s entre les utilisateurs, ce qui rend PGP beaucoup plus facile &agrave; utiliser. Cela vient du fait que PGP est fond&eacute; sur une puissante nouvelle technologie appel&eacute;e cryptographie "&agrave; cl&eacute; publique". </P>
<P>PGP combine la commodit&eacute; du cryptosyst&egrave;me &agrave; cl&eacute; publique Rivest-Shamir-Adleman (RSA) avec la vitesse de la cryptographie conventionnelle, les contractions de message pour les signatures num&eacute;riques, la compression des donn&eacute;es avant chiffrement, une bonne ergonomie, et une gestion des cl&eacute;s sophistiqu&eacute;e. Et PGP ex&eacute;cute les fonctions de cl&eacute; publique plus vite que la plupart des autres logiciels. PGP c'est la cryptographie &agrave; cl&eacute; publique pour tous. </P>
<P>PGP ne fournit aucune fonctionnalit&eacute; permettant la communication par modem. Vous devez utiliser un logiciel s&eacute;par&eacute; pour cela. </P>
<P>Ce document, "Volume I: Questions essentielles", explique seulement les notions essentielles pour utiliser PGP, et devrait &ecirc;tre lu par tous les utilisateurs de PGP. "Volume II: Questions Sp&eacute;ciales" couvre les fonctionnalit&eacute;s avanc&eacute;es de PGP et d'autres questions sp&eacute;ciales, et peut &ecirc;tre lu par les utilisateurs plus s&eacute;rieux de PGP. Aucun des volumes n'explique les d&eacute;tails techniques des algorithmes cryptographiques et de la structure des donn&eacute;es. <BR>
&nbsp; </P>
<P>_ <BR>
Pourquoi avez-vous besoin de PGP? <BR>
========================= </P>
<P>C'est personnel. C'est priv&eacute;. Et cela ne regarde personne d'autre que vous. Vous pouvez &ecirc;tre en train de pr&eacute;parer une campagne &eacute;lectorale, discuter de vos imp&ocirc;ts, ou avoir une affaire illicite. Ou vous pouvez &ecirc;tre en train de faire quelque chose que vous pensez ne pas &ecirc;tre ill&eacute;gal et qui l'est. Quoi qu'il en soit, vous ne voulez pas que votre courrier &eacute;lectronique (e-mail) ou vos documents confidentiels soient lus par quelqu'un d'autre. Il n'y a rien de mal dans la d&eacute;fense de votre intimit&eacute;. L'intimit&eacute; est le bien le plus pr&eacute;cieux de la Constitution. </P>
<P>Peut-&ecirc;tre pensez-vous que votre courrier &eacute;lectronique que vous recevez est assez l&eacute;gitime pour que le chiffrement ne se justifie pas. Si vous &ecirc;tes vraiment un citoyen au dessus de tout soup&ccedil;on, pourquoi n'envoyez-vous pas toujours votre correspondance papier sur des cartes postales? Pourquoi ne vous soumettez-vous pas aux tests de consommation de drogue sur simple demande? Pourquoi exigez-vous un mandat de perquisition pour laisser la police fouiller votre maison? Essayez-vous de cacher quelque chose? Vous devez &ecirc;tre un [&eacute;l&eacute;ment] subversif ou un trafiquant de drogue si vous cachez votre courrier dans des enveloppes. Ou peut-&ecirc;tre un parano&iuml;aque aigu. Est-ce que les citoyens honn&ecirc;tes ont un quelconque besoin de chiffrer leurs e-mails? </P>
<P>Que se passerait-il si tout le monde estimait que les citoyens honn&ecirc;tes devraient utiliser des cartes postales pour leur courrier? Si une bonne &acirc;me s'avisait alors d'imposer le respect de son intimit&eacute; en utilisant une enveloppe, cela attirerait la suspicion. Peut-&ecirc;tre que les autorit&eacute;s ouvriraient son courrier pour voir ce que cette personne cache. Heureusement, nous ne vivons pas dans ce genre de soci&eacute;t&eacute; car chacun prot&egrave;ge la plupart de son courrier avec des enveloppes. Aussi personne n'attire la suspicion en prot&eacute;geant son intimit&eacute; avec une enveloppe. La s&eacute;curit&eacute; vient du nombre. De la m&ecirc;me mani&egrave;re, ce serait excellent si tout le monde utilisait la cryptographie de mani&egrave;re syst&eacute;matique pour tous ses e-mails, qu'ils soient innocents ou non, de telle sorte que personne n'attirerait la suspicion en prot&eacute;geant l'intimit&eacute; de ses e-mails par la cryptographie. Pensez &agrave; le faire comme une forme de solidarit&eacute;. </P>
<P>Aujourd'hui, si le Gouvernement d&eacute;sire violer l'intimit&eacute; de citoyens ordinaires, il doit consentir une certaine d&eacute;pense d'argent et de travail pour intercepter, ouvrir et lire les lettres, et &eacute;couter, et si possible transcrire, le contenu des conversations t&eacute;l&eacute;phoniques. Cette m&eacute;thode, co&ucirc;teuse en travail, n'est pas praticable sur une grande &eacute;chelle. Cela est fait seulement dans les cas importants, quand cela en vaut la peine. </P>
<P>De plus en plus, nos messages sont transmis par le biais de canaux &eacute;lectroniques. L'e-mail est en train de remplacer progressivement le courrier traditionnel sur papier. Les messages e-mail sont justement beaucoup trop faciles &agrave; intercepter et &agrave; soumettre &agrave; une recherche syst&eacute;matique par mots cl&eacute;s. Ceci peut &ecirc;tre fait facilement, syst&eacute;matiquement, automatiquement, et de mani&egrave;re ind&eacute;celable sur une grande &eacute;chelle. Les t&eacute;lex internationaux sont d&eacute;j&agrave; intercept&eacute;s de cette mani&egrave;re sur une grande &eacute;chelle par la NSA am&eacute;ricaine. </P>
<P>Nous nous dirigeons vers un futur o&ugrave; les pays seront sillonn&eacute;s de r&eacute;seaux de fibres optiques &agrave; haute capacit&eacute; reliant ensemble la totalit&eacute; de nos ordinateurs personnels sans cesse plus nombreux. L'e-mail sera la norme pour chacun, et non plus la nouveaut&eacute; qu'il est aujourd'hui. Les Etats prot&eacute;geront nos e-mails avec les protocoles de chiffrement con&ccedil;us par les Etats. Il est probable que la plupart des gens accepteront cela. Mais peut-&ecirc;tre que certains pr&eacute;f&eacute;reront leurs propres mesures de protection. </P>
<P>En 1991 aux Etats-Unis, le projet de loi 266 du S&eacute;nat, un texte anti-criminalit&eacute;, comportait une disposition troublante cach&eacute;e &agrave; l'int&eacute;rieur du texte. Si cette r&eacute;solution &eacute;tait devenue une v&eacute;ritable loi, cela aurait contraint les fabricants d'&eacute;quipements de communications s&eacute;curis&eacute;es &agrave; ins&eacute;rer des "portes d&eacute;rob&eacute;es" sp&eacute;ciales dans leurs produits, de telle sorte que le gouvernement puisse lire les messages chiffr&eacute;s par n'importe qui. Le texte disait: "La recommandation du S&eacute;nat est que les fournisseurs de services de communications &eacute;lectroniques et les fabricants d'&eacute;quipements de communication &eacute;lectronique devront s'assurer que les syst&egrave;mes de communication permettent au gouvernement d'obtenir le contenu en clair des communications vocales, des donn&eacute;es, et des autres communications dans les cas pr&eacute;vus par la loi". Cette mesure fut rejet&eacute;e apr&egrave;s une protestation massive des militants des droits civiques et des groupes industriels. </P>
<P>En 1992, la "Digital Telephony wiretap proposal" du FBI fut introduite au Congr&egrave;s am&eacute;ricain. Ce projet de loi pr&eacute;voyait que tout fabricant de mat&eacute;riel de communication devait installer dans ses &eacute;quipements des portes d'entr&eacute;e sp&eacute;ciales permettant au FBI de mettre sur table d'&eacute;coute, &agrave; distance, n'importe quelle forme de communication &eacute;lectronique. Bien qu'elle n'ait jamais attir&eacute; de sympathisants au Congr&egrave;s en 1992 &agrave; cause de l'opposition des citoyens, elle a &eacute;t&eacute; r&eacute;introduite en 1994. </P>
<P>La plus alarmante de toutes est l'initiative incluse dans la politique de la Maison Blanche, d&eacute;velopp&eacute;e &agrave; la NSA apr&egrave;s le d&eacute;part de l'Administration Bush, et r&eacute;v&eacute;l&eacute;e le 16 avril 1993. La pi&egrave;ce centrale de ce dispositif est le microprocesseur construit par le gouvernement et appel&eacute; puce "Clipper", contenant un algorithme de la NSA class&eacute; top secret. Le gouvernement est en train d'encourager l'industrie priv&eacute;e &agrave; l'ins&eacute;rer dans leurs &eacute;quipements de communications s&eacute;curis&eacute;es, comme les t&eacute;l&eacute;phones s&eacute;curis&eacute;s, les fax s&eacute;curis&eacute;s, etc. AT&amp;T ins&egrave;re d&egrave;s &agrave; pr&eacute;sent la "Clipper" dans ses &eacute;quipements vocaux s&eacute;curis&eacute;s. Ce que cela cache: au moment de la fabrication, chaque puce "Clipper" sera charg&eacute;e avec sa propre cl&eacute;, et le gouvernement en gardera une copie, plac&eacute;e entre les mains d'un tiers. Il n'y a pas &agrave; s'inqui&eacute;ter, cependant: le gouvernement a promis qu'il utiliserait ces cl&eacute;s pour lire le trafic des citoyens uniquement dans les cas d&ucirc;ment autoris&eacute;s par la loi. Bien s&ucirc;r, pour rendre la "Clipper" compl&egrave;tement efficace, la prochaine &eacute;tape devrait &ecirc;tre de mettre hors-la-loi tout autre syst&egrave;me. </P>
<P>Si l'intimit&eacute; est mise hors la loi, seuls les hors-la-loi auront une intimit&eacute;. Les agences de renseignement ont acc&egrave;s &agrave; une bonne technologie cryptographique. De m&ecirc;me les trafiquants d'armes et de drogue. Egalement les entreprises sous contrat avec la D&eacute;fense Nationale, les soci&eacute;t&eacute;s p&eacute;troli&egrave;res et les autres grandes multinationales. Mais les gens ordinaires et les organisations politiques de base n'avaient pas acc&egrave;s &agrave; une technologie cryptographique de "qualit&eacute; militaire" abordable. Jusqu'&agrave; pr&eacute;sent. </P>
<P>PGP donne aux gens le pouvoir de prendre en main leur intimit&eacute;. Il y a un besoin social croissant pour cela. C'est pourquoi j'ai &eacute;crit PGP. <BR>
&nbsp; </P>
<P>_ <BR>
Comment &ccedil;a marche <BR>
============== </P>
<P>La connaissance pr&eacute;alable des notions de cryptographie en g&eacute;n&eacute;ral et de cryptographie &agrave; cl&eacute; publique en particulier serait un atout. N&eacute;anmoins, voici quelques remarques d'introduction &agrave; la cryptographie &agrave; cl&eacute; publique. </P>
<P>Tout d'abord, quelques rappels terminologiques &eacute;l&eacute;mentaires. Supposons que je veuille vous envoyer un message, mais de telle sorte que vous soyez le seul &agrave; pouvoir le lire. Je peux "crypter" ou "chiffrer" le message, ce qui veut dire que je le brouille d'une mani&egrave;re extr&ecirc;mement compliqu&eacute;e, le rendant illisible pour quiconque d'autre que vous, destinataire convenu du message. J'utilise une "cl&eacute;" cryptographique pour chiffrer le message, et vous aurez &agrave; utiliser la m&ecirc;me cl&eacute; pour le d&eacute;chiffrer ou le "d&eacute;crypter". C'est ainsi que les choses se passent dans les cryptosyst&egrave;mes conventionnels &agrave; "cl&eacute; unique". </P>
<P>Dans les cryptosyst&egrave;mes conventionnels, tels que le Data Encryption Standard (DES), le standard f&eacute;d&eacute;ral am&eacute;ricain, une cl&eacute; unique est utilis&eacute;e aussi bien pour le chiffrement que pour le d&eacute;chiffrement. Cela veut dire que la cl&eacute; doit &ecirc;tre pr&eacute;alablement transmise par des canaux s&ucirc;rs de sorte que les parties puissent la conna&icirc;tre avant que les messages chiffr&eacute;s puissent &ecirc;tre envoy&eacute;s par des canaux peu s&ucirc;rs. Cela peut ne pas &ecirc;tre pratique. Et si vous disposez d&eacute;j&agrave; d'un canal s&ucirc;r pour l'&eacute;change des cl&eacute;s, pourquoi auriez-vous besoin de recourir &agrave; la cryptographie pour le reste? </P>
<P>Dans les cryptosyst&egrave;mes &agrave; cl&eacute; publique, chacun poss&egrave;de deux cl&eacute;s compl&eacute;mentaires, une cl&eacute; publique, connue de tous, et une cl&eacute; secr&egrave;te (souvent aussi appel&eacute;e cl&eacute; priv&eacute;e). Chaque cl&eacute; d&eacute;code ce qui a &eacute;t&eacute; cod&eacute; par l'autre. La connaissance de la cl&eacute; publique ne permet pas d'en d&eacute;duire la cl&eacute; secr&egrave;te. La cl&eacute; publique peut &ecirc;tre publi&eacute;e et largement diffus&eacute;e &agrave; travers un r&eacute;seau de communication. Ce protocole assure la confidentialit&eacute; sans avoir besoin de recourir aux canaux s&eacute;curis&eacute;s exig&eacute;s par les cryptosyst&egrave;mes conventionnels. </P>
<P>N'importe qui peut utiliser la cl&eacute; publique d'un destinataire pour chiffrer un message &agrave; son intention, et ce destinataire utilise sa propre cl&eacute; secr&egrave;te pour le d&eacute;chiffrer. Personne d'autre que le destinataire ne peut le d&eacute;chiffrer, parce que personne d'autre que lui n'a acc&egrave;s &agrave; cette cl&eacute; secr&egrave;te. M&ecirc;me la personne qui a chiffr&eacute; le message ne peut pas le d&eacute;chiffrer. </P>
<P>L'authentification des messages est aussi possible. La cl&eacute; secr&egrave;te de l'exp&eacute;diteur peut &ecirc;tre utilis&eacute;e pour chiffrer un message, en le "signant" de cette fa&ccedil;on. Cela cr&eacute;e une signature num&eacute;rique d'un message, que le destinataire (ou n'importe qui d'autre) peut v&eacute;rifier en utilisant la cl&eacute; publique de l'exp&eacute;diteur pour la d&eacute;chiffrer. Cela prouve que l'exp&eacute;diteur &eacute;tait le v&eacute;ritable auteur du message, et que le message n'a pas &eacute;t&eacute; alt&eacute;r&eacute; par la suite par quelqu'un d'autre, puisque seul l'exp&eacute;diteur poss&egrave;de la cl&eacute; secr&egrave;te qui a fait cette signature. La contrefa&ccedil;on d'un message sign&eacute; est infaisable, et l'exp&eacute;diteur ne peut plus par la suite d&eacute;savouer sa signature. </P>
<P>Ces deux possibilit&eacute;s peuvent &ecirc;tre combin&eacute;es de mani&egrave;re &agrave; permettre &agrave; la fois confidentialit&eacute; et authentification en signant d'abord le message avec votre propre cl&eacute; secr&egrave;te, et ensuite en chiffrant le message sign&eacute; avec la cl&eacute; publique du destinataire. Le destinataire refait ces &eacute;tapes &agrave; l'envers en d&eacute;chiffrant d'abord le message avec sa propre cl&eacute; secr&egrave;te, puis en v&eacute;rifiant la signature qui y est contenue avec votre cl&eacute; publique. Ces op&eacute;rations sont r&eacute;alis&eacute;es automatiquement par le logiciel du destinataire. </P>
<P>En raison de la lenteur de l'algorithme de chiffrement &agrave; cl&eacute; publique par rapport au chiffrement conventionnel &agrave; cl&eacute; unique, le chiffrement est plus efficacement effectu&eacute; en utilisant un algorithme de chiffrement conventionnel &agrave; cl&eacute; unique rapide et de grande qualit&eacute; pour chiffrer le message. Le message originel non chiffr&eacute; est appel&eacute; "texte clair" [ou plus loin "fichier clair"]. Dans un processus invisible pour l'utilisateur, une cl&eacute; temporaire al&eacute;atoire, cr&eacute;&eacute;e uniquement pour cette seule "session", est utilis&eacute;e pour chiffrer conventionnellement le fichier clair. Ensuite la cl&eacute; publique du destinataire est utilis&eacute;e pour chiffrer cette cl&eacute; temporaire al&eacute;atoire conventionnelle. Cette cl&eacute; de "session" conventionnelle chiffr&eacute;e avec la cl&eacute; publique est envoy&eacute;e avec le texte chiffr&eacute; [ou plus loin "fichier chiffr&eacute;"] au destinataire. Le destinataire utilise sa propre cl&eacute; secr&egrave;te pour r&eacute;cup&eacute;rer cette cl&eacute; de session temporaire, puis utilise cette cl&eacute; pour ex&eacute;cuter l'algorithme conventionnel rapide &agrave; cl&eacute; unique qui d&eacute;chiffrera le message contenant le texte chiffr&eacute;. </P>
<P>Les cl&eacute;s publiques sont conserv&eacute;es dans des "copies de cl&eacute;s" individuelles qui contiennent l'ID utilisateur du propri&eacute;taire de la cl&eacute; (qui est le nom de cette personne), la date de la cr&eacute;ation de la paire de cl&eacute;s, et la cl&eacute; publique proprement dite. Les copies de cl&eacute;s publiques contiennent la cl&eacute; publique elle-m&ecirc;me, tandis que les copies de cl&eacute;s secr&egrave;tes contiennent la cl&eacute; secr&egrave;te elle-m&ecirc;me. Chaque cl&eacute; secr&egrave;te est aussi chiffr&eacute;e avec son propre mot de passe, pour le cas o&ugrave; on la perdrait. Un fichier de cl&eacute;s, ou "trousseau de cl&eacute;s", contient une ou plusieurs de ces copies de cl&eacute;s. Le trousseau de cl&eacute;s publiques contient les copies de cl&eacute;s publiques, et le trousseau de cl&eacute;s secr&egrave;tes contient les copies de cl&eacute;s secr&egrave;tes. </P>
<P>Les cl&eacute;s sont &eacute;galement r&eacute;f&eacute;renc&eacute;es en interne par une "cl&eacute; ID", qui est une "abr&eacute;viation" de la cl&eacute; publique (les 64 bits les moins significatifs de la cl&eacute; publique). Lorsque cette cl&eacute; ID est affich&eacute;e, seuls les derniers 32 bits apparaissent, pour faire plus court. Alors que plusieurs cl&eacute;s peuvent partager la m&ecirc;me ID utilisateur, il n'existe pas, en pratique, deux cl&eacute;s qui partagent la m&ecirc;me cl&eacute; ID. </P>
<P>PGP utilise des "contractions de message" pour produire des signatures. Une contraction de message est une condensation sur 128 bits, cryptographiquement solide, du message, produite par l'application d'une fonction de hachage &agrave; sens unique. C'est quelque chose d'analogue &agrave; une "somme de contr&ocirc;le" ou CRC code de contr&ocirc;le d'erreur, en ce qu'elle "repr&eacute;sente" le message sous forme ramass&eacute;e et est utilis&eacute;e pour d&eacute;tecter des modifications du message. A la diff&eacute;rence d'un CRC, cependant, il est math&eacute;matiquement impraticable pour un attaquant d'&eacute;laborer un message de substitution qui produirait une contraction de message identique. La contraction de message est chiffr&eacute;e par la cl&eacute; secr&egrave;te pour former une signature. </P>
<P>Les documents sont sign&eacute;s en les faisant pr&eacute;c&eacute;der de certificats de signature, qui contiennent la cl&eacute; ID de la cl&eacute; utilis&eacute;e pour signer, une contraction sign&eacute;e du document, et la date &agrave; laquelle la signature a &eacute;t&eacute; faite. La cl&eacute; ID est utilis&eacute;e par le destinataire pour retrouver la cl&eacute; publique de l'exp&eacute;diteur pour v&eacute;rifier la signature. Le logiciel du destinataire retrouve automatiquement la cl&eacute; publique de l'exp&eacute;diteur et l'ID utilisateur de l'exp&eacute;diteur dans son trousseau de cl&eacute;s publiques. </P>
<P>Les fichiers chiffr&eacute;s sont pr&eacute;c&eacute;d&eacute;s de la cl&eacute; ID de la cl&eacute; publique utilis&eacute;e pour les chiffrer. Le destinataire utilise cette cl&eacute; ID pour retrouver la cl&eacute; secr&egrave;te requise pour d&eacute;chiffrer le message. Le logiciel du destinataire retrouve automatiquement la cl&eacute; secr&egrave;te de d&eacute;chiffrement dans son trousseau de cl&eacute;s secr&egrave;tes. </P>
<P>Ces deux types de trousseaux sont le principal moyen de stockage et de gestion des cl&eacute;s publiques et secr&egrave;tes. Plut&ocirc;t que de les conserver dans des fichiers de cl&eacute; s&eacute;par&eacute;s, elles sont regroup&eacute;es en trousseaux pour faciliter la recherche automatique des cl&eacute;s, que ce soit par le biais de la cl&eacute; ID ou par celui de l'ID utilisateur. Chaque utilisateur conserve sa propre paire de trousseaux. Une copie de la cl&eacute; publique personnelle peut &ecirc;tre provisoirement conserv&eacute;e dans un fichier s&eacute;par&eacute;, le temps de l'envoyer &agrave; votre ami qui pourra alors l'ajouter &agrave; son trousseau. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Installation de PGP <BR>
============= </P>
<P>L'archive de la version MSDOS de PGP est livr&eacute;e dans un fichier compress&eacute; avec un nom de fichier de cette forme: PGPxx.ZIP (chaque version a un nombre diff&eacute;rent pour le "xx" dans le nom). Par exemple, l'archive de la version 2.6 est appel&eacute;e PGP26.ZIP. L'archive peut &ecirc;tre d&eacute;compress&eacute;e avec l'utilitaire shareware de d&eacute;compression PKUNZIP pour MSDOS [ou WINZIP pour Windows], ou l'utilitaire Unix "unzip". Quand l'archive de PGP est d&eacute;compress&eacute;e, plusieurs fichiers en &eacute;mergent. Un de ces fichiers, appel&eacute; README.DOC, devrait toujours &ecirc;tre lu avant d'installer PGP. Ce fichier contient les derni&egrave;res informations sur ce qu'il y a de nouveau dans cette version de PGP, aussi bien que ce qu'il y a dans les autres fichiers inclus dans la livraison. </P>
<P>Si vous avez d&eacute;j&agrave; une version plus ancienne de PGP, vous devriez la renommer ou l'effacer, pour &eacute;viter les conflits de nom avec le nouveau PGP. </P>
<P>Pour les d&eacute;tails complets sur la mani&egrave;re d'installer PGP, voyez le fichier s&eacute;par&eacute; Guide d'installation de PGP, dans le fichier SETUP.DOC inclus avec cette livraison. Il d&eacute;crit enti&egrave;rement la mani&egrave;re de pr&eacute;parer le r&eacute;pertoire PGP et votre fichier AUTOEXEC.BAT et comment utiliser PKUNZIP pour l'installer. Nous r&eacute;sumerons bri&egrave;vement ici simplement les instructions d'installation, au cas o&ugrave; vous seriez trop impatient pour lire tout de suite le manuel d'installation plus d&eacute;taill&eacute;. </P>
<P>Pour installer PGP sur votre syst&egrave;me MSDOS, vous devez copier le fichier archive compress&eacute; PGPxx.ZIP dans un r&eacute;pertoire ad&eacute;quat sur votre disque dur (comme C:\PGP), et le d&eacute;compresser avec PKUNZIP. Pour de meilleurs r&eacute;sultats, vous devriez aussi modifier votre fichier AUTOEXEC.BAT, comme d&eacute;crit dans ce manuel, mais vous pouvez faire cela plus tard, apr&egrave;s avoir jou&eacute; un peu avec PGP et lu un peu plus ce manuel. Si vous n'avez pas lanc&eacute; PGP avant, la premi&egrave;re &eacute;tape apr&egrave;s l'installation (et la lecture de ce manuel) est de cr&eacute;er une paire de cl&eacute;s pour vous-m&ecirc;me en lan&ccedil;ant la commande "pgp -kg" de g&eacute;n&eacute;ration de cl&eacute; PGP. Lisez d'abord le chapitre "G&eacute;n&eacute;ration de la cl&eacute; RSA" de ce manuel. </P>
<P>L'installation sous Unix et VAX/VMS est g&eacute;n&eacute;ralement similaire &agrave; celle sous MSDOS, mais vous devez d'abord compiler le code source. Un "makefile" Unix est fourni &agrave; cette fin avec le code source. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Comment utiliser PGP <BR>
=============== <BR>
&nbsp; </P>
<P>Voir un r&eacute;sum&eacute; de l'utilisation <BR>
------------------------------ </P>
<P>Pour voir un rapide r&eacute;sum&eacute; des commandes de PGP, tapez simplement: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -h <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Chiffrer un message <BR>
-------------------- </P>
<P>Pour chiffrer un fichier clair avec la cl&eacute; publique du destinataire, tapez: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -e fichier son_ID_utilisateur </P>
<P>Cette commande produit un fichier chiffr&eacute; appel&eacute; fichier.pgp. Un exemple explicite est: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -e lettre.txt Alice</P>
<P>ou:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp; pgp -e lettre.txt "Alice S" </P>
<P>Le premier exemple recherche dans votre trousseau de cl&eacute;s publiques "pubring.pgp" toute cl&eacute; contenant la cha&icirc;ne [de caract&egrave;res] "Alice" quelque part dans le champ ID utilisateur. Le deuxi&egrave;me exemple trouverait tout ID utilisateur contenant la cha&icirc;ne "Alice S". Vous ne pouvez pas utiliser d'espaces sur la ligne de commande, sauf si vous mettez toute la cha&icirc;ne [en contenant] entre guillemets. La recherche n'est pas sensible &agrave; la casse. Si la cl&eacute; publique correspondante est trouv&eacute;e, elle est utilis&eacute;e pour chiffrer le fichier clair "lettre.txt", produisant un fichier chiffr&eacute; appel&eacute; "lettre.pgp". </P>
<P>PGP essaye de compresser le fichier clair avant de le chiffrer, augmentant ainsi consid&eacute;rablement la r&eacute;sistance &agrave; la cryptanalyse. Le fichier chiffr&eacute; sera donc bien plus petit que le fichier clair. </P>
<P>Si vous voulez envoyer ce message chiffr&eacute; &agrave; travers des canaux e-mail, convertissez-le au format imprimable ASCII "radix-64" en ajoutant l'option -a, comme expliqu&eacute; plus loin. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Chiffrer un message pour plusieurs destinataires <BR>
------------------------------------------------ </P>
<P>Si vous voulez envoyer le m&ecirc;me message &agrave; plus d'une personne, vous pouvez sp&eacute;cifier un chiffrement pour plusieurs destinataires, chacun d'eux pourra d&eacute;chiffrer le m&ecirc;me fichier chiffr&eacute;. Pour sp&eacute;cifier plusieurs destinataires, ajoutez simplement plus d'ID utilisateurs sur la ligne de commande, comme ceci: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -e lettre.txt Alice Bob Carol </P>
<P>Cela cr&eacute;era un fichier chiffr&eacute; appel&eacute; lettre.pgp qui pourra &ecirc;tre d&eacute;chiffr&eacute; par Alice, Bob ou Carol. N'importe quel nombre de destinataires peut &ecirc;tre sp&eacute;cifi&eacute;. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Signer un message <BR>
------------------- </P>
<P>Pour signer un fichier clair avec votre cl&eacute; secr&egrave;te, tapez: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -s fichier [-u votre_ID_utilisateur] </P>
<P>Notez que les [crochets] indiquent un champ optionnel, donc ne tapez pas de vrais crochets. </P>
<P>Cette commande produit un fichier sign&eacute; appel&eacute; fichier.pgp. Un exemple explicite est: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -s lettre.txt -u Bob </P>
<P>Cela recherche dans votre trousseau de cl&eacute;s secr&egrave;tes "secring.pgp" toute cl&eacute; secr&egrave;te contenant la cha&icirc;ne "Bob" quelque part dans le champ ID utilisateur. Votre nom est bien Bob, n'est-ce pas? La recherche n'est pas sensible &agrave; la casse. Si la cl&eacute; secr&egrave;te correspondante est trouv&eacute;e, elle est utilis&eacute;e pour signer le fichier clair "lettre.txt", produisant un fichier sign&eacute; appel&eacute; "lettre.pgp". </P>
<P>Si vous omettez le champ ID utilisateur, la premi&egrave;re cl&eacute; secr&egrave;te de votre trousseau de cl&eacute;s secr&egrave;tes sera utilis&eacute;e comme cl&eacute; secr&egrave;te par d&eacute;faut pour votre signature. </P>
<P>PGP essaye de compresser le message apr&egrave;s l'avoir sign&eacute;. Le fichier sign&eacute; sera donc bien plus petit que le fichier d'origine, ce qui est appr&eacute;ciable pour l'archivage. Cependant, cela rend le fichier illisible, m&ecirc;me si le message originel &eacute;tait du texte ASCII ordinaire. Ce serait bien si vous pouviez cr&eacute;er un fichier sign&eacute; qui demeurerait lisible. Ce serait particuli&egrave;rement utile si vous vouliez envoyer un message sign&eacute; comme e-mail. </P>
<P>Pour signer des messages e-mail, dont vous voulez qu'ils restent lisibles, il est probablement plus appropri&eacute; d'utiliser la fonctionnalit&eacute; CLEARSIG, expliqu&eacute;e plus loin. Cela permet d'appliquer une signature imprimable &agrave; la fin du texte, et d&eacute;sactive aussi la compression du texte. Cela signifie que le texte demeure lisible pour le destinataire, m&ecirc;me si celui-ci n'utilise pas PGP pour v&eacute;rifier la signature. Ceci est expliqu&eacute; en d&eacute;tail dans le chapitre intitul&eacute; "CLEARSIG - Enable Signed Messages to be Encapsulated as Clear Text" dans le Volume II "Questions Sp&eacute;ciales". Si vous ne pouvez pas attendre de lire ce chapitre du manuel, vous pouvez voir &agrave; quoi ressemble un message e-mail sign&eacute;, avec cet exemple: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -sta message.txt </P>
<P>Cela cr&eacute;era un message sign&eacute; dans le fichier "message.asc", englobant le texte originel, toujours lisible, auquel a &eacute;t&eacute; ajout&eacute;e une signature en ASCII, pr&ecirc;t &agrave; &ecirc;tre envoy&eacute; par e-mail. Cet exemple pr&eacute;sume que vous utilisez les r&eacute;glages normaux pour activer le param&egrave;tre CLEARSIG dans le fichier de configuration. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Signer et ensuite chiffrer <BR>
------------------------ </P>
<P>Pour signer un fichier avec votre cl&eacute; secr&egrave;te, et ensuite le chiffrer avec la cl&eacute; publique du destinataire: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -es fichier son_ID_utilisateur [-u votre_ID_utilisateur] </P>
<P>Notez que les [crochets] indiquent un champ optionnel, donc ne tapez pas de vrais crochets. </P>
<P>Cet exemple produit un fichier chiffr&eacute; gigogne appel&eacute; fichier.pgp. Votre cl&eacute; secr&egrave;te pour signer est automatiquement retrouv&eacute;e dans votre trousseau de cl&eacute;s secr&egrave;tes via votre_ID_utilisateur. La cl&eacute; publique [du destinataire] est automatiquement retrouv&eacute;e dans votre trousseau de cl&eacute;s publiques via son_ID_utilisateur. Si vous omettez le champ ID utilisateur, il vous sera demand&eacute;. </P>
<P>Si vous omettez votre propre champ ID utilisateur, la premi&egrave;re cl&eacute; secr&egrave;te de votre trousseau de cl&eacute;s secr&egrave;tes sera utilis&eacute;e comme cl&eacute; secr&egrave;te par d&eacute;faut pour votre signature. </P>
<P>Notez que PGP essaye de compresser le fichier avant de le chiffrer. </P>
<P>Si vous voulez envoyer ce message chiffr&eacute; &agrave; travers des canaux e-mail, convertissez-le au format imprimable ASCII "radix-64" en ajoutant l'option -a, comme expliqu&eacute; plus loin. </P>
<P>Plusieurs destinataires peuvent &ecirc;tre sp&eacute;cifi&eacute;s, en ajoutant plus d'ID utilisateurs sur la ligne de commande. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Utiliser seulement le chiffrement conventionnel <BR>
----------------------------------------------- </P>
<P>Parfois vous avez simplement besoin de chiffrer un message &agrave; l'ancienne mani&egrave;re, avec une cl&eacute; unique conventionnelle. Cette approche est int&eacute;ressante pour prot&eacute;ger des fichiers archiv&eacute;s qui seront conserv&eacute;s sans &ecirc;tre envoy&eacute;s &agrave; personne. Puisque c'est la m&ecirc;me personne qui aura chiffr&eacute; qui d&eacute;chiffrera, il n'est pas n&eacute;cessaire de recourir &agrave; la cryptographie &agrave; cl&eacute; publique. </P>
<P>Pour chiffrer un fichier de mani&egrave;re conventionnelle seulement, tapez: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -c fichier </P>
<P>Cet exemple chiffre le fichier appel&eacute; fichier, produisant un fichier chiffr&eacute; appel&eacute; fichier.pgp, sans utiliser la cryptographie &agrave; cl&eacute; publique, les trousseaux, les ID utilisateurs, ni toutes ces sortes de choses. Il vous est demand&eacute; une phrase de passe comme cl&eacute; conventionnelle pour chiffrer le fichier. Cette phrase de passe n'a pas besoin d'&ecirc;tre (et, vraiment, ne DEVRAIT PAS &ecirc;tre) la m&ecirc;me que celle que vous utilisez pour prot&eacute;ger votre propre cl&eacute; secr&egrave;te [afin de signer ou d&eacute;chiffrer]. Notez que PGP essaye de compresser le fichier avant de le chiffrer. </P>
<P>PGP ne chiffrera pas deux fois le m&ecirc;me fichier de la m&ecirc;me fa&ccedil;on, m&ecirc;me si vous utilisez la m&ecirc;me phrase de passe &agrave; chaque fois. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>D&eacute;chiffrer et v&eacute;rifier les signatures <BR>
---------------------------------- </P>
<P>Pour d&eacute;chiffrer un fichier chiffr&eacute;, ou pour v&eacute;rifier l'int&eacute;grit&eacute; d'un fichier sign&eacute;: </P>
<P>&nbsp;&nbsp;&nbsp;&nbsp; pgp fichier_chiffr&eacute; [-o fichier_en_clair] </P>
<P>Notez que les [crochets] indiquent un champ optionnel, donc ne tapez pas de vrais crochets. </P>
<P>Le nom du fichier chiffr&eacute; est pr&eacute;sum&eacute; poss&eacute;der une extension ".pgp" par d&eacute;faut. L'option de nom de fichier d&eacute;chiffr&eacute; sp&eacute;cifie l'endroit o&ugrave; mettre celui-ci. Si aucun nom n'est sp&eacute;cifi&eacute;, le nom du fichier chiffr&eacute; est utilis&eacute;, sans aucune extension. Si une signature se trouve dans le fichier chiffr&eacute;, il est automatiquement d&eacute;chiffr&eacute; et son int&eacute;grit&eacute; v&eacute;rifi&eacute;e. L'ID utilisateur du signataire est affich&eacute;e. </P>
<P>Notez que le "d&eacute;ballage" du fichier chiffr&eacute; est compl&egrave;tement automatique, peu importe que le fichier soit seulement sign&eacute;, seulement chiffr&eacute;, ou les deux. PGP utilise [l'indication de] la cl&eacute; ID contenue dans le fichier chiffr&eacute; pour retrouver automatiquement la cl&eacute; secr&egrave;te de d&eacute;chiffrement correspondante dans votre trousseau de cl&eacute;s secr&egrave;tes. Si une signature est trouv&eacute;e &agrave; l'int&eacute;rieur [du fichier chiffr&eacute;], PGP utilise [l'indication de] la cl&eacute; ID dans la signature pour retrouver automatiquement la cl&eacute; publique correspondante dans votre trousseau de cl&eacute;s publiques afin de v&eacute;rifier la signature. Si toutes les cl&eacute;s requises se trouvent d&eacute;j&agrave; dans vos trousseaux, aucune intervention de l'utilisateur n'est demand&eacute;e, sauf pour entrer la phrase de passe pour utiliser votre cl&eacute; secr&egrave;te si n&eacute;cessaire. Si le fichier chiffr&eacute; &eacute;tait chiffr&eacute; de mani&egrave;re conventionnelle sans cryptographie &agrave; cl&eacute; publique, PGP s'en aper&ccedil;oit et vous demande d'entrer la phrase de passe pour le d&eacute;chiffrer de mani&egrave;re conventionnelle. <BR>
&nbsp; </P>
<P>_ <BR>
Gestion des cl&eacute;s <BR>
=========== </P>
<P>Depuis l'&eacute;poque de Jules C&eacute;sar, la gestion des cl&eacute;s a toujours &eacute;t&eacute; la partie la plus difficile de la cryptographie. Une des principales caract&eacute;ristiques distinguant PGP est sa gestion sophistiqu&eacute;e des cl&eacute;s. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>G&eacute;n&eacute;ration de la cl&eacute; RSA <BR>
-------------------------- </P>
<P>Pour g&eacute;n&eacute;rer votre propre et unique paire de cl&eacute;s publique/secr&egrave;te d'une taille sp&eacute;cifique, tapez: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -kg </P>
<P>PGP vous montre un menu des tailles de cl&eacute;s recommand&eacute;es (commercial de bas niveau, commercial de haut niveau, ou niveau "militaire") et vous demande quelle longueur vous voulez, jusqu'&agrave; bien plus d'un millier de bits [maximum: 2048 bits]. Plus la cl&eacute; est grande, plus vous gagnez en s&eacute;curit&eacute;, mais vous le payez d'une baisse de la vitesse [de traitement]. </P>
<P>Il vous est aussi demand&eacute; une ID utilisateur. Une bonne id&eacute;e est d'utiliser votre nom complet comme ID utilisateur, parce qu'il y a ainsi moins de risque pour les autres d'utiliser la mauvaise cl&eacute; publique pour chiffrer des messages &agrave; votre attention. Les espaces et les signes de ponctuation sont autoris&eacute;s dans l'ID utilisateur. Il serait souhaitable de mettre votre adresse e-mail entre &lt;crochets apr&egrave;s votre nom, comme cela: </P>
<P>&nbsp;&nbsp;&nbsp; Jean Dupont &lt;dupont@toto.fr </P>
<P>Si vous n'avez pas d'adresse e-mail, utilisez votre num&eacute;ro de t&eacute;l&eacute;phone ou une autre information personnelle qui pourrait aider &agrave; s'assurer que votre ID utilisateur est unique. </P>
<P>PGP demande aussi une "phrase de passe" pour prot&eacute;ger votre cl&eacute; secr&egrave;te au cas o&ugrave; elle tomberait en de mauvaises mains. Personne ne peut utiliser votre cl&eacute; secr&egrave;te sans cette phrase de passe. La phrase de passe est comme un mot de passe, except&eacute; que ce peut &ecirc;tre une phrase enti&egrave;re ou une locution avec plusieurs mots, des espaces, des signes de ponctuation, ou tout autre chose que vous voulez y mettre. Ne perdez pas cette phrase de passe - il n'y aucun moyen de la retrouver si vous la perdez. Cette phrase de passe sera n&eacute;cessaire chaque fois que vous utiliserez votre cl&eacute; secr&egrave;te. La phrase de passe tient compte de la casse, et ne devrait pas &ecirc;tre trop courte ou facile &agrave; deviner. Elle n'est jamais affich&eacute;e &agrave; l'&eacute;cran. Ne la laissez pas par &eacute;crit quelque part o&ugrave; quelqu'un d'autre pourrait la voir, et ne la stockez pas sur votre ordinateur. Si vous ne voulez pas de phrase de passe (vous &ecirc;tes fou!), appuyez simplement sur RETURN (ou ENTREE) lorsqu'il vous est demand&eacute; de taper la phrase de passe. </P>
<P>La paire de cl&eacute;s publique/secr&egrave;te est d&eacute;riv&eacute;e de grands nombres v&eacute;ritablement al&eacute;atoires principalement en mesurant les intervalles entre vos frappes des touches clavier avec un minuteur rapide. Le logiciel vous demandera d'entrer du texte au hasard pour l'aider &agrave; accumuler des bits al&eacute;atoires pour les cl&eacute;s. A sa demande, vous devrez frapper des touches de mani&egrave;re raisonnablement al&eacute;atoire, et ce serait une bonne chose que les caract&egrave;res eux-m&ecirc;mes que vous tapez le soient aussi. Une part de l'al&eacute;a provient de l'impr&eacute;visibilit&eacute; du contenu de ce que vous tapez. Aussi ne tapez surtout pas les m&ecirc;mes s&eacute;quences de caract&egrave;res. </P>
<P>Notez que la g&eacute;n&eacute;ration de la cl&eacute; RSA est un processus tr&egrave;s lent. Cela peut prendre quelques secondes pour une petite cl&eacute; sur un processeur rapide, ou plusieurs minutes pour une grande cl&eacute; sur un vieux IBM PC/XT. PGP indiquera visuellement la progression pendant la g&eacute;n&eacute;ration des cl&eacute;s. </P>
<P>La paire de cl&eacute;s g&eacute;n&eacute;r&eacute;e sera plac&eacute;e dans vos trousseaux de cl&eacute;s publiques et secr&egrave;tes. Vous pouvez plus tard utiliser l'option de commande -kx pour extraire (copier) votre nouvelle cl&eacute; publique depuis votre trousseau de cl&eacute;s publiques et la mettre dans un fichier de cl&eacute; s&eacute;par&eacute; pour la distribuer &agrave; vos amis. Le fichier contenant la cl&eacute; publique [que vous aurez extraite] peut &ecirc;tre envoy&eacute; &agrave; vos amis pour &ecirc;tre int&eacute;gr&eacute; &agrave; leur trousseau de cl&eacute;s publiques. Naturellement, vous gardez votre cl&eacute; secr&egrave;te avec vous, et vous devrez l'inclure dans votre trousseau de cl&eacute;s secr&egrave;tes. Chaque cl&eacute; secr&egrave;te d'un trousseau de cl&eacute;s est individuellement prot&eacute;g&eacute;e par sa propre phrase de passe. </P>
<P>Ne donnez jamais votre cl&eacute; secr&egrave;te &agrave; quelqu'un. Pour la m&ecirc;me raison, ne g&eacute;n&eacute;rez pas de paires de cl&eacute;s pour vos amis. Chacun devrait g&eacute;n&eacute;rer lui-m&ecirc;me sa propre paire de cl&eacute;s. Gardez toujours le contr&ocirc;le physique de votre cl&eacute; secr&egrave;te, et ne prenez pas le risque de la divulguer en l'entreposant sur un ordinateur distant et/ou partag&eacute; avec d'autres. Gardez-la sur votre propre ordinateur personnel. </P>
<P>Si PGP se plaint de ne pas trouver le guide de l'utilisateur de PGP sur votre ordinateur, et refuse de g&eacute;n&eacute;rer une paire de cl&eacute;s sans lui, ne paniquez pas. Lisez l'explication du param&egrave;tre NOMANUAL dans le chapitre "R&eacute;glage des param&egrave;tres de configuration" ("Setting Configuration Parameters") dans le volume "Questions Sp&eacute;ciales" du Guide de l'utilisateur de PGP [Volume II]. <BR>
&nbsp; </P>
<P>Ajouter une cl&eacute; &agrave; votre trousseau de cl&eacute;s <BR>
----------------------------------------- </P>
<P>Parfois, vous voudrez ajouter &agrave; votre trousseau une cl&eacute; que quelqu'un vous aura donn&eacute;e, sous la forme d'un fichier de cl&eacute;. </P>
<P>Pour ajouter le contenu d'un fichier de cl&eacute; publique ou secr&egrave;te &agrave; votre trousseau de cl&eacute;s publiques ou secr&egrave;tes (notez que les [crochets] repr&eacute;sentent un champ de commande optionnel): </P>
<P>&nbsp;&nbsp;&nbsp; pgp -ka fichier_de_cl&eacute; [trousseau_de_cl&eacute;s] </P>
<P>L'extension du fichier de cl&eacute; par d&eacute;faut est ".pgp". Le nom du fichier trousseau de cl&eacute;s est par d&eacute;faut "pubring.pgp" ou "secring.pgp", selon que le fichier [de cl&eacute;] contient une cl&eacute; publique ou secr&egrave;te. Vous pouvez sp&eacute;cifier un nom de trousseau de cl&eacute;s diff&eacute;rent, l'extension demeurant ".pgp" par d&eacute;faut. </P>
<P>Si la cl&eacute; est d&eacute;j&agrave; dans votre trousseau de cl&eacute;s, PGP ne l'ajoutera pas une nouvelle fois. Toutes les cl&eacute;s contenues dans le fichier de cl&eacute;s sont ajout&eacute;es au trousseau, sauf celles qui s'y trouvent d&eacute;j&agrave;. </P>
<P>Plus loin dans le manuel, nous expliquerons la notion de certification des cl&eacute;s au moyen des signatures. Si la cl&eacute; ajout&eacute;e comporte des signatures attach&eacute;es qui la certifient, les signatures seront ajout&eacute;es avec la cl&eacute;. Si la cl&eacute; se trouve d&eacute;j&agrave; dans votre trousseau, PGP ajoute seulement celles des nouvelles signatures certifiant cette cl&eacute; que vous n'aviez pas encore dans votre trousseau. </P>
<P>PGP a &eacute;t&eacute; con&ccedil;u &agrave; l'origine pour g&eacute;rer de petits trousseaux de cl&eacute;s. Si vous voulez g&eacute;rer des trousseaux vraiment gros, lisez le chapitre "G&eacute;rer de gros trousseaux de cl&eacute;s publiques" ("Handling Large Public Keyrings") dans le volume "Questions Sp&eacute;ciales" du Guide de l'utilisateur de PGP [Volume II]. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Effacer une cl&eacute; ou un ID utilisateur de votre trousseau de cl&eacute;s <BR>
-------------------------------------------------------------- </P>
<P>Pour effacer une cl&eacute; ou un ID utilisateur de votre trousseau de cl&eacute;s: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -kr ID_utilisateur [trousseau_de_cl&eacute;s] </P>
<P>Cela recherche l'ID utilisateur sp&eacute;cifi&eacute; dans votre trousseau, et l'efface si est trouv&eacute;e une cl&eacute; y correspondant. Rappelez-vous qu'une partie d'un ID utilisateur suffit. Le nom optionnel du trousseau est cens&eacute; &ecirc;tre "pubring.pgp". Il peut ne pas &ecirc;tre pr&eacute;cis&eacute;, ou bien vous pouvez sp&eacute;cifier "secring.pgp" si vous voulez effacer une cl&eacute; secr&egrave;te. Vous pouvez sp&eacute;cifier un nom de trousseau diff&eacute;rent. L'extension par d&eacute;faut du trousseau de cl&eacute;s est ".pgp". </P>
<P>S'il existe plus d'un ID utilisateur pour cette cl&eacute;, il vous sera demand&eacute; si vous voulez effacer seulement l'ID utilisateur sp&eacute;cifi&eacute;, tout en laissant la cl&eacute; et ses autres ID intacts. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Extraire (copier) une cl&eacute; de votre trousseau de cl&eacute;s <BR>
--------------------------------------------------- </P>
<P>Pour extraire (copier) une cl&eacute; de votre trousseau de cl&eacute;s publiques ou secr&egrave;tes: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -kx ID_utilisateur fichier_de_cl&eacute; [trousseau_de_cl&eacute;s] </P>
<P>Cela copie, sans la d&eacute;truire, la cl&eacute; sp&eacute;cifi&eacute;e par son ID utilisateur depuis votre trousseau de cl&eacute;s publiques ou secr&egrave;tes vers le fichier de cl&eacute; sp&eacute;cifi&eacute;. Cela est particuli&egrave;rement utile si vous voulez donner une copie de votre cl&eacute; publique &agrave; quelqu'un. </P>
<P>Si des signatures la certifiant sont attach&eacute;es &agrave; la cl&eacute; dans votre trousseau de cl&eacute;s, elles seront copi&eacute;es avec la cl&eacute;. </P>
<P>Si vous voulez que la cl&eacute; extraite sorte en fichier ASCII imprimable pouvant &ecirc;tre envoy&eacute; par e-mail, utilisez l'option -kxa. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Voir le contenu de votre trousseau de cl&eacute;s <BR>
------------------------------------------ </P>
<P>Pour voir le contenu de votre trousseau de cl&eacute;s publiques: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -kv[v] [ID_utilisateur] [trousseau_de_cl&eacute;s] </P>
<P>Cela liste toutes les cl&eacute;s du trousseau de cl&eacute;s qui correspondent &agrave; l'ID utilisateur indiqu&eacute;. Si vous omettez l'ID utilisateur, toutes les cl&eacute;s du trousseau sont list&eacute;es. Le nom du fichier du trousseau est pr&eacute;sum&eacute; &ecirc;tre "pubring.pgp". Il peut &ecirc;tre omis ou vous pouvez sp&eacute;cifier "secring.pgp" si vous voulez lister les cl&eacute;s secr&egrave;tes. Vous pouvez sp&eacute;cifier un nom de trousseau diff&eacute;rent. L'extension par d&eacute;faut du trousseau est ".pgp". </P>
<P>Plus loin dans le manuel, nous expliquerons la notion de certification des cl&eacute;s au moyen des signatures. Pour voir toutes les signatures attach&eacute;es &agrave; chaque cl&eacute;, utilisez l'option -kvv: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -kvv [ID_utilisateur] [trousseau_de_cl&eacute;s] </P>
<P>Si vous voulez sp&eacute;cifier un nom de fichier de trousseau particulier, mais que vous voulez voir toutes les cl&eacute;s qui s'y trouvent, essayez l'approche alternative: </P>
<P>&nbsp;&nbsp;&nbsp; pgp fichier_de_cl&eacute; </P>
<P>En ne sp&eacute;cifiant aucune option de commande, PGP liste toutes les cl&eacute;s contenues dans fichier_de_cl&eacute;.pgp, et essaye aussi de les ajouter &agrave; votre trousseau si elles ne s'y trouvent pas d&eacute;j&agrave;. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Comment prot&eacute;ger les cl&eacute;s publiques de la falsification <BR>
------------------------------------------------------- </P>
<P>Dans un cryptosyst&egrave;me &agrave; cl&eacute; publique, vous n'avez pas &agrave; prot&eacute;ger les cl&eacute;s publiques de la divulgation. En fait, il est mieux qu'elles soient largement diss&eacute;min&eacute;es. Mais il est important de prot&eacute;ger les cl&eacute;s de la falsification, pour &ecirc;tre s&ucirc;r que la cl&eacute; publique appartient r&eacute;ellement &agrave; la personne &agrave; qui elle semble appartenir. C'est peut-&ecirc;tre la plus importante vuln&eacute;rabilit&eacute; des cryptosyst&egrave;mes &agrave; cl&eacute; publique. Voyons d'abord un d&eacute;sastre potentiel, avant de voir comment l'&eacute;viter s&ucirc;rement avec PGP. </P>
<P>Supposons que vous vouliez envoyer un message priv&eacute; &agrave; Alice. Vous t&eacute;l&eacute;chargez la cl&eacute; publique d'Alice depuis un BBS [quelconque, ou un site Internet inconnu]. Vous chiffrez votre lettre &agrave; Alice avec cette cl&eacute; publique et vous la lui envoyez par e-mail. </P>
<P>Malheureusement, &agrave; votre insu ou &agrave; l'insu d'Alice, un autre utilisateur appel&eacute; Charlie a infiltr&eacute; le BBS et a lui-m&ecirc;me g&eacute;n&eacute;r&eacute; une cl&eacute; publique avec l'ID utilisateur "Alice" attach&eacute; &agrave; cette cl&eacute;. Il a secr&egrave;tement substitu&eacute; cette fausse cl&eacute; &agrave; la v&eacute;ritable cl&eacute; d'Alice. Vous utilisez sans le savoir cette fausse cl&eacute; appartenant [en r&eacute;alit&eacute;] &agrave; Charlie au lieu de la cl&eacute; publique d'Alice. Tout semble normal parce que cette fausse cl&eacute; affiche "Alice" comme ID utilisateur. Maintenant, Charlie peut d&eacute;chiffrer le message destin&eacute; &agrave; Alice parce qu'il a la cl&eacute; secr&egrave;te correspondante. Il peut m&ecirc;me chiffrer &agrave; nouveau le message pr&eacute;alablement d&eacute;chiffr&eacute; avec la vraie cl&eacute; publique d'Alice et le lui envoyer pour que personne ne se doute de la fraude. Pire encore, il peut m&ecirc;me faire des signatures, en apparence authentiques, d'Alice avec sa [fausse] cl&eacute; secr&egrave;te parce que tout le monde utilisera la fausse cl&eacute; publique pour v&eacute;rifier la signature d'Alice. </P>
<P>La seule fa&ccedil;on d'emp&ecirc;cher ce d&eacute;sastre est d'emp&ecirc;cher que qui ce soit puisse falsifier les cl&eacute;s publiques. Si vous avez obtenu la cl&eacute; publique d'Alice directement d'Alice, il n'y a pas de probl&egrave;me. Mais cela peut &ecirc;tre difficile si Alice est &agrave; des milliers de kilom&egrave;tres de l&agrave;, ou si elle est actuellement injoignable. </P>
<P>Peut-&ecirc;tre pourriez-vous vous procurer la cl&eacute; publique d'Alice par l'interm&eacute;diaire de David, un ami commun en qui vous avez tous les deux confiance, et qui sait qu'il d&eacute;tient une copie authentique de la cl&eacute; publique d'Alice. David pourrait signer la cl&eacute; publique d'Alice, se portant ainsi garant de l'int&eacute;grit&eacute; de la cl&eacute; publique d'Alice. David cr&eacute;erait cette signature avec sa propre cl&eacute; secr&egrave;te. </P>
<P>Cela cr&eacute;erait une signature de la cl&eacute; publique, et prouverait que la cl&eacute; d'Alice n'a pas &eacute;t&eacute; falsifi&eacute;e. Cela exige de disposer d'une copie reconnue authentique de la cl&eacute; publique de David pour v&eacute;rifier sa signature. Peut-&ecirc;tre que David pourrait aussi fournir &agrave; Alice une copie sign&eacute;e de votre cl&eacute; publique. De cette mani&egrave;re, David sert de "certificateur" entre vous et Alice. </P>
<P>Cette signature de la cl&eacute; publique d'Alice pourrait &ecirc;tre mise en ligne par David ou Alice sur un BBS, et vous pourriez la t&eacute;l&eacute;charger ult&eacute;rieurement. Vous pourriez alors v&eacute;rifier la signature via la cl&eacute; publique de David et &ecirc;tre ainsi assur&eacute; qu'il s'agit r&eacute;ellement de la cl&eacute; publique d'Alice. Aucun imposteur ne peut vous duper en vous faisant accepter sa propre fausse cl&eacute; comme &eacute;tant la cl&eacute; d'Alice parce que personne ne peut contrefaire la signature cr&eacute;&eacute;e par David. </P>
<P>Une personne largement reconnue comme digne de confiance pourrait m&ecirc;me se sp&eacute;cialiser dans ce service [consistant &agrave;] "certifier" les utilisateurs les uns aux autres en signant leurs cl&eacute;s publiques. Cette personne de confiance pourrait &ecirc;tre consid&eacute;r&eacute;e comme un "serveur de cl&eacute;s", ou une "Autorit&eacute; Certifiante". On aurait l'assurance que toute cl&eacute; publique portant la signature du serveur de cl&eacute;s appartient r&eacute;ellement &agrave; la personne &agrave; qui elle semble appartenir. Tout utilisateur int&eacute;ress&eacute; n'aurait d&egrave;s lors besoin que d'une copie reconnue authentique de la cl&eacute; publique du serveur de cl&eacute;s, de sorte que les signatures du serveur de cl&eacute;s puissent &ecirc;tre v&eacute;rifi&eacute;es [sur les cl&eacute;s publiques des utilisateurs]. </P>
<P>Un serveur de cl&eacute;s centralis&eacute; fiable, ou Autorit&eacute; Certifiante, est particuli&egrave;rement adapt&eacute; aux grandes institutions contr&ocirc;l&eacute;es depuis un centre unique comme les grandes entreprises ou les administrations. Quelques milieux institutionnels recourent au mod&egrave;le de telles Autorit&eacute;s Certifiantes. </P>
<P>Pour les milieux de base plus d&eacute;centralis&eacute;s, moins "professionnels" et au style plus "gu&eacute;rilla", un mod&egrave;le permettant &agrave; tous les utilisateurs d'agir comme certificateurs fiables pour leurs amis se r&eacute;v&eacute;lera probablement mieux adapt&eacute; qu'un serveur de cl&eacute;s centralis&eacute;. PGP tend &agrave; privil&eacute;gier cette approche non institutionnelle &agrave; organigramme d&eacute;centralis&eacute;. Cela refl&egrave;te mieux la fa&ccedil;on naturelle dont les &ecirc;tres humains interagissent &agrave; un niveau personnel, et permet aux gens de mieux choisir &agrave; qui ils font confiance pour la gestion de leurs cl&eacute;s. </P>
<P>Toute cette affaire de la protection des cl&eacute;s publiques contre la falsification est le probl&egrave;me le plus d&eacute;licat &agrave; r&eacute;soudre pour les applications pratiques de la cryptographie &agrave; cl&eacute; publique. C'est le talon d'Achille de la cryptographie &agrave; cl&eacute; publique, et une grande partie de la complexit&eacute; du logiciel est li&eacute;e &agrave; la r&eacute;solution de ce seul probl&egrave;me. </P>
<P>Vous ne devriez utiliser une cl&eacute; publique qu'apr&egrave;s vous &ecirc;tre assur&eacute; qu'il s'agit d'une cl&eacute; publique authentique qui n'a pas &eacute;t&eacute; falsifi&eacute;e, et qui appartient r&eacute;ellement &agrave; la personne &agrave; qui la cl&eacute; pr&eacute;tend appartenir. Vous pouvez en &ecirc;tre s&ucirc;r si vous tenez cette cl&eacute; publique directement de son propri&eacute;taire, ou si elle est sign&eacute;e par quelqu'un en qui vous avez confiance, dont vous d&eacute;tenez d&eacute;j&agrave; une cl&eacute; publique authentique. Aussi, l'ID utilisateur devrait &ecirc;tre le nom complet du propri&eacute;taire de la cl&eacute;, et non pas seulement son nom de famille. </P>
<P>Peu importe combien vous pouvez &ecirc;tre tent&eacute; - et vous serez tent&eacute; - ne c&eacute;dez jamais, JAMAIS, &agrave; la facilit&eacute; en faisant confiance &agrave; une cl&eacute; publique que vous avez t&eacute;l&eacute;charg&eacute;e depuis un BBS, &agrave; moins qu'elle ne soit sign&eacute;e par quelqu'un en qui vous avez confiance. Cette cl&eacute; non certifi&eacute;e pourrait avoir &eacute;t&eacute; falsifi&eacute;e, peut-&ecirc;tre m&ecirc;me par l'administrateur syst&egrave;me du BBS. </P>
<P>Si on vous demande de signer la cl&eacute; publique de quelqu'un d'autre, assurez-vous qu'elle appartient r&eacute;ellement &agrave; la personne nomm&eacute;e dans l'ID utilisateur de cette cl&eacute; publique. Et cela parce que votre signature sur sa cl&eacute; est votre promesse que cette cl&eacute; publique lui appartient r&eacute;ellement. D'autres personnes qui vous font confiance accepteront sa cl&eacute; parce qu'elle porte votre signature. Il peut &ecirc;tre malavis&eacute; de se fier au ou&iuml;-dire - ne signez pas sa cl&eacute; publique sauf si vous avez une connaissance ind&eacute;pendante et de premi&egrave;re main qu'elle lui appartient vraiment. De pr&eacute;f&eacute;rence, vous ne devriez la signer que si vous l'obtenez directement [de la personne]. </P>
<P>Pour signer une cl&eacute; publique, vous devez &ecirc;tre encore bien plus certain de l'appartenance de cette cl&eacute; que si vous vouliez simplement utiliser cette cl&eacute; pour chiffrer un message. Pour &ecirc;tre convaincu qu'une cl&eacute; a un aloi suffisant pour &ecirc;tre utilis&eacute;e, les signatures par des certificateurs fiables devraient suffire. Mais pour signer une cl&eacute; vous-m&ecirc;me, vous devriez recourir &agrave; votre connaissance directe, personnelle et ind&eacute;pendante du propri&eacute;taire de cette cl&eacute;. Peut-&ecirc;tre que vous pourriez t&eacute;l&eacute;phoner au propri&eacute;taire de la cl&eacute; et lui lire le fichier de cl&eacute; pour qu'il confirme que la cl&eacute; que vous d&eacute;tenez est r&eacute;ellement sa cl&eacute; - assurez-vous que vous parlez r&eacute;ellement &agrave; la bonne personne. Voyez le chapitre intitul&eacute; "V&eacute;rifier une cl&eacute; publique par t&eacute;l&eacute;phone" dans le volume "Questions Sp&eacute;ciales" pour plus de d&eacute;tails. </P>
<P>Gardez pr&eacute;sent &agrave; l'esprit que votre signature sur une cl&eacute; publique ne garantit pas l'int&eacute;grit&eacute; de cette personne, mais seulement l'int&eacute;grit&eacute; (l'appartenance) de la cl&eacute; publique de cette personne. Vous ne risquez pas de compromettre votre cr&eacute;dibilit&eacute; en signant la cl&eacute; publique d'un d&eacute;bile mental, si vous &ecirc;tes absolument s&ucirc;r que la cl&eacute; lui appartient r&eacute;ellement. D'autres personnes accepteront cette cl&eacute; parce que vous l'avez sign&eacute;e (en admettant qu'elles vous fassent confiance), mais elles n'auront pas confiance en la personne du propri&eacute;taire de cette cl&eacute;. Avoir confiance en une cl&eacute; n'est pas la m&ecirc;me chose que d'avoir confiance en la personne du propri&eacute;taire de la cl&eacute;. </P>
<P>La confiance n'est pas n&eacute;cessairement transitive; j'ai un ami dont je sais qu'il n'est pas un menteur. C'est une personne cr&eacute;dule, qui croit que le Pr&eacute;sident n'est pas un menteur. Cela ne signifie pas que je crois que le Pr&eacute;sident n'est pas un menteur. Ce n'est que du bon sens. Si je fais confiance &agrave; la signature d'Alice sur une cl&eacute;, et qu'Alice fait confiance &agrave; la signature de Charlie sur une cl&eacute;, cela n'implique pas que je doive avoir confiance en la signature de Charlie sur une cl&eacute;. </P>
<P>Ce serait une bonne id&eacute;e de garder sous la main une copie de votre propre cl&eacute; publique sign&eacute;e par de nombreux "certificateurs", dans l'espoir que beaucoup de gens feront confiance &agrave; au moins un des certificateurs qui se sont port&eacute;s garants de la validit&eacute; de votre propre cl&eacute;. Vous pourriez poster votre cl&eacute; avec sa collection de signatures sur divers BBS. Si vous signez la cl&eacute; publique d'autres personnes, renvoyez-la leur avec votre signature de telle sorte qu'elles puissent l'ajouter &agrave; leur propre collection de garants de leur propre cl&eacute; publique. </P>
<P>PGP garde la trace de celles des cl&eacute;s de votre trousseau de cl&eacute;s publiques qui sont convenablement sign&eacute;es par des certificateurs en qui vous avez confiance. Tout ce que vous avez &agrave; faire est de dire &agrave; PGP qui vous jugez fiables en tant que certificateurs, et de certifier leurs cl&eacute;s vous-m&ecirc;me avec votre propre cl&eacute; la plus certifi&eacute;e. PGP peut se servir de &ccedil;a, et valider automatiquement toutes les autres cl&eacute;s qui ont &eacute;t&eacute; sign&eacute;es par ceux que vous avez d&eacute;sign&eacute;s comme certificateurs. Et bien s&ucirc;r, vous pouvez directement signer d'autres cl&eacute;s vous-m&ecirc;me. On verra cela plus tard. </P>
<P>Assurez-vous que personne ne peut falsifier votre propre trousseau de cl&eacute;s. La v&eacute;rification d'une nouvelle signature certifiant une cl&eacute; publique doit d&eacute;pendre en dernier ressort de l'int&eacute;grit&eacute; des cl&eacute;s publiques certifi&eacute;es qui se trouvent d&eacute;j&agrave; dans votre propre trousseau de cl&eacute;s publiques. Gardez un contr&ocirc;le physique de votre trousseau de cl&eacute;s publiques, de pr&eacute;f&eacute;rence sur votre propre ordinateur personnel plut&ocirc;t que sur un syst&egrave;me distant et/ou partag&eacute;, exactement comme vous le feriez pour votre cl&eacute; secr&egrave;te. Ceci pour le prot&eacute;ger de la falsification, non de la divulgation. Gardez une copie de sauvegarde fiable de vos trousseaux de cl&eacute;s publiques et secr&egrave;tes sur un support prot&eacute;g&eacute; en &eacute;criture. </P>
<P>Dans la mesure o&ugrave; votre propre cl&eacute; publique certifi&eacute;e est utilis&eacute;e comme r&eacute;f&eacute;rence pour certifier directement ou indirectement toutes les autres cl&eacute;s de votre trousseau, c'est celle qu'il faut prot&eacute;ger avec le plus grand soin de la falsification. Pour d&eacute;tecter une falsification de votre propre cl&eacute; publique la plus certifi&eacute;e, PGP peut &ecirc;tre r&eacute;gl&eacute; pour comparer automatiquement votre cl&eacute; publique avec une copie de sauvegarde sur un support prot&eacute;g&eacute; en &eacute;criture. Pour plus de d&eacute;tails, voyez la description de la commande de v&eacute;rification "-kc" dans le Volume II "Questions Sp&eacute;ciales". </P>
<P>D'une mani&egrave;re g&eacute;n&eacute;rale, PGP pr&eacute;sume que vous conserverez le contr&ocirc;le physique de votre syst&egrave;me et de vos trousseaux de cl&eacute;s, ainsi que de votre copie de PGP elle-m&ecirc;me. Si un intrus peut acc&eacute;der &agrave; votre disque, alors en th&eacute;orie il peut falsifier PGP lui-m&ecirc;me, remettant en cause l'efficacit&eacute; des dispositifs de s&eacute;curit&eacute; dont dispose PGP pour d&eacute;tecter une falsification des cl&eacute;s. </P>
<P>Une m&eacute;thode plus complexe pour prot&eacute;ger votre propre trousseau de toute falsification est de signer ce trousseau entier avec votre propre cl&eacute; secr&egrave;te. Vous pouvez le faire en cr&eacute;ant une signature d&eacute;tach&eacute;e de votre trousseau de cl&eacute;s publiques, en signant le trousseau avec les options "- sb" (voyez le chapitre intitul&eacute; "Separing Signatures from Messages" ["D&eacute;tacher les signatures des messages"] dans le Guide de l'utilisateur de PGP, Volume II "Questions Sp&eacute;ciales"). Malheureusement, vous devrez toujours conserver sous la main une copie fiable s&eacute;par&eacute;e de votre propre cl&eacute; publique pour v&eacute;rifier la signature que vous avez faite. Vous ne pouvez pas compter sur votre propre cl&eacute; publique contenue dans votre trousseau de cl&eacute;s publiques pour v&eacute;rifier la signature que vous avez faite pour le trousseau entier, parce que y &eacute;tant elle-m&ecirc;me contenue, elle est une partie du tout que vous cherchez &agrave; v&eacute;rifier. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Comment PGP sait quelles cl&eacute;s sont valides? <BR>
--------------------------------------------- </P>
<P>Avant de lire ce chapitre, assurez-vous d'avoir lu le chapitre pr&eacute;c&eacute;dent "Comment prot&eacute;ger les cl&eacute;s publiques de la falsification". </P>
<P>PGP sait quelles cl&eacute;s dans votre trousseau de cl&eacute;s publiques sont convenablement certifi&eacute;es par les signatures des certificateurs en qui vous avez confiance. Tout ce que vous avez &agrave; faire est de dire &agrave; PGP qui sont les gens fiables en tant que certificateurs, et de certifier leurs cl&eacute;s avec votre propre cl&eacute; la plus certifi&eacute;e. PGP peut utiliser cette information, validant automatiquement toutes les autres cl&eacute;s qui ont &eacute;t&eacute; sign&eacute;es par les certificateurs. Et bien s&ucirc;r, vous pouvez directement signer d'autres cl&eacute;s vous-m&ecirc;me. </P>
<P>PGP utilise deux crit&egrave;res bien distincts pour appr&eacute;cier la qualit&eacute; d'une cl&eacute; publique - ne les confondez pas: </P>
<P>&nbsp; 1) Est-ce que la cl&eacute; appartient r&eacute;ellement &agrave; la personne &agrave; qui <BR>
&nbsp;&nbsp;&nbsp;&nbsp; elle semble appartenir? En d'autres termes, a-t-elle &eacute;t&eacute; <BR>
&nbsp;&nbsp;&nbsp;&nbsp; certifi&eacute;e avec une signature digne de confiance? <BR>
&nbsp; 2) Est-ce qu'elle appartient &agrave; quelqu'un en qui vous pouvez <BR>
&nbsp;&nbsp;&nbsp;&nbsp; avoir confiance pour certifier d'autres cl&eacute;s? </P>
<P>PGP peut &eacute;valuer la r&eacute;ponse &agrave; la premi&egrave;re question. Pour r&eacute;pondre &agrave; la deuxi&egrave;me question, PGP doit &ecirc;tre explicitement inform&eacute; par vous, l'utilisateur. Quand vous r&eacute;pondez &agrave; la question 2, PGP peut ensuite &eacute;valuer la r&eacute;ponse &agrave; la question 1 pour les autres cl&eacute;s sign&eacute;es par le certificateur que vous avez d&eacute;sign&eacute; comme fiable. </P>
<P>Les cl&eacute;s qui ont &eacute;t&eacute; certifi&eacute;es par un certificateur fiable sont consid&eacute;r&eacute;es comme valides par PGP. Les cl&eacute;s appartenant aux certificateurs fiables doivent &ecirc;tre certifi&eacute;es soit par vous soit par un autre certificateur fiable. </P>
<P>PGP offre aussi la possibilit&eacute; d'&eacute;tablir des nuances quant au cr&eacute;dit que m&eacute;ritent les certificateurs. Votre confiance en la personne des propri&eacute;taires de cl&eacute;s pour agir en tant que certificateurs ne refl&egrave;te pas seulement votre estimation de leur int&eacute;grit&eacute; personnelle - cela devrait refl&eacute;ter &eacute;galement la sagacit&eacute; que vous leur supposez dans la compr&eacute;hension de la gestion des cl&eacute;s et dans celle de signer les cl&eacute;s &agrave; bon escient. Vous pouvez d&eacute;signer &agrave; PGP une personne comme inconnue, non fiable, marginalement fiable, ou compl&egrave;tement fiable pour certifier les autres cl&eacute;s publiques. Cette information sur la fiabilit&eacute; est conserv&eacute;e avec leurs cl&eacute;s dans votre trousseau, mais quand vous demandez &agrave; PGP de copier [extraire] une cl&eacute; de votre trousseau, PGP ne copiera pas l'information sur la fiabilit&eacute; avec la cl&eacute;, parce que vos opinions personnelles sur la fiabilit&eacute; sont consid&eacute;r&eacute;es comme confidentielles. </P>
<P>Quand PGP &eacute;value la validit&eacute; d'une cl&eacute; publique, il examine le niveau de fiabilit&eacute; de toutes les signatures attach&eacute;es. Il calcule un r&eacute;sultat pond&eacute;r&eacute; de la validit&eacute; - deux signatures marginalement fiables sont consid&eacute;r&eacute;es comme &eacute;quivalentes &agrave; une [signature] compl&egrave;tement fiable. L'&eacute;valuation critique de PGP est modulable - par exemple, vous pouvez r&eacute;gler PGP pour exiger deux signatures compl&egrave;tement fiables ou trois signatures marginalement fiables pour d&eacute;cider qu'une cl&eacute; est valide. </P>
<P>Votre propre cl&eacute; est "axiomatiquement" valide pour PGP, nayant pas besoin de la signature dun certificateur pour prouver sa validit&eacute;. PGP sait quelles cl&eacute;s publiques sont les v&ocirc;tres, en regardant la cl&eacute; secr&egrave;te correspondante dans le trousseau de cl&eacute;s secr&egrave;tes. PGP pr&eacute;sume &eacute;galement que vous vous consid&eacute;rez vous-m&ecirc;me comme compl&egrave;tement fiable pour certifier d'autres cl&eacute;s. </P>
<P>Avec le temps, vous accumulerez des cl&eacute;s d'autres personnes que vous pouvez vouloir d&eacute;signer comme certificateurs fiables. Chacun choisira ses propres certificateurs fiables. Et chacun accumulera progressivement et distribuera avec sa cl&eacute; une collection de signatures d'autres personnes, dans l'espoir que parmi ceux qui en d&eacute;tiendront une copie, il s'en trouvera pour faire confiance &agrave; au moins une ou deux des signatures. Cela permettra l'&eacute;mergence d'un r&eacute;seau de confiance d&eacute;centralis&eacute;, &agrave; tol&eacute;rance d'erreurs, pour toutes les cl&eacute;s publiques. </P>
<P>Cette approche originale par la base tranche nettement avec les sch&eacute;mas de la norme gouvernementale de gestion des cl&eacute;s publiques, comme le "Internet Privacy Enhanced Mail" (PEM), qui est bas&eacute; sur un contr&ocirc;le et une obligation de confiance centralis&eacute;s. Le mod&egrave;le normatif repose sur une hi&eacute;rarchie d'Autorit&eacute;s Certifiantes qui d&eacute;cident [&agrave; votre place] &agrave; qui vous devez faire confiance. La m&eacute;thode probabiliste d&eacute;centralis&eacute;e de PGP pour d&eacute;terminer l'aloi des cl&eacute;s publiques est la poutre ma&icirc;tresse de l'architecture de son mod&egrave;le de gestion des cl&eacute;s. PGP vous laisse choisir vous-m&ecirc;me ceux qui m&eacute;ritent votre confiance, vous pla&ccedil;ant au sommet de votre propre pyramide personnelle de certification. PGP est destin&eacute; aux gens qui pr&eacute;f&egrave;rent plier eux-m&ecirc;mes leur propre parachute. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Comment prot&eacute;ger ses cl&eacute;s secr&egrave;tes de la divulgation <BR>
------------------------------------------------------ </P>
<P>Prot&eacute;gez votre propre cl&eacute; secr&egrave;te et votre phrase de passe soigneusement. Vraiment, vraiment soigneusement. Si jamais votre cl&eacute; secr&egrave;te est compromise, vous feriez mieux de le faire savoir &agrave; toutes les parties concern&eacute;es (bonne chance) avant qu'on l'utilise pour signer en votre nom. Par exemple, on pourrait l'utiliser pour cr&eacute;er de fausses vraies signatures, qui pourraient cr&eacute;er des probl&egrave;mes &agrave; beaucoup de monde, surtout si votre signature est largement consid&eacute;r&eacute;e comme fiable. Et bien s&ucirc;r, une compromission de votre propre cl&eacute; secr&egrave;te compromettrait tous les messages qui vous sont envoy&eacute;s. </P>
<P>Pour prot&eacute;ger votre cl&eacute; secr&egrave;te, vous pouvez commencer par toujours conserver le contr&ocirc;le physique de votre cl&eacute; secr&egrave;te. Il est bon de la conserver sur votre ordinateur personnel &agrave; la maison, ou sur un ordinateur portable que vous pouvez emmener avec vous. Si vous devez utiliser au bureau un ordinateur dont vous n'avez pas en permanence le contr&ocirc;le physique, alors gardez vos trousseaux de cl&eacute;s publiques et secr&egrave;tes sur une disquette prot&eacute;g&eacute;e en &eacute;criture, et ne l'oubliez pas en quittant le bureau. Ce ne serait pas une bonne id&eacute;e de conserver votre cl&eacute; secr&egrave;te sur un ordinateur distant et/ou partag&eacute;, comme un syst&egrave;me de type Unix connect&eacute; en permanence. Quelqu'un pourrait intercepter la ligne de votre modem et capturer votre phrase de passe, et ensuite se procurer votre cl&eacute; secr&egrave;te depuis le syst&egrave;me distant. Vous ne devriez utiliser votre cl&eacute; secr&egrave;te que sur une machine plac&eacute;e sous votre contr&ocirc;le physique. </P>
<P>Ne conservez pas votre phrase de passe sur l'ordinateur sur lequel se trouve votre cl&eacute; secr&egrave;te. Conserver ensemble la cl&eacute; secr&egrave;te et la phrase de passe sur le m&ecirc;me ordinateur est aussi dangereux que de garder votre code secret de carte bancaire dans le m&ecirc;me portefeuille que la carte. Vous ne voulez pas que quelqu'un mette la main sur votre disque contenant &agrave; la fois la phrase de passe et le fichier de cl&eacute; secr&egrave;te. Il serait plus s&ucirc;r de simplement m&eacute;moriser votre phrase de passe et de ne pas la conserver ailleurs que dans votre cerveau. Si vous sentez que vous devez &eacute;crire votre phrase de passe, prot&eacute;gez-la bien, peut-&ecirc;tre mieux encore que la cl&eacute; secr&egrave;te. </P>
<P>Et conservez des copies de sauvegarde de votre trousseau de cl&eacute;s secr&egrave;tes - rappelez-vous, vous d&eacute;tenez l'unique exemplaire de votre cl&eacute; secr&egrave;te, et la perdre rendra inutilisables toutes les copies de votre cl&eacute; publique que vous avez diffus&eacute;es &agrave; travers le monde. </P>
<P>L'approche d&eacute;centralis&eacute;e non institutionnelle utilis&eacute;e par PGP pour g&eacute;rer les cl&eacute;s publiques a ses avantages, mais malheureusement elle signifie aussi qu'on ne peut pas compter sur une liste centralis&eacute;e unique des cl&eacute;s compromises. Cela rend beaucoup plus difficile de limiter les d&eacute;g&acirc;ts caus&eacute;s par une compromission de cl&eacute; secr&egrave;te. Vous ne pouvez que le faire savoir et esp&eacute;rer que tout le monde en entendra parler. </P>
<P>Si le pire des cas survient - votre cl&eacute; secr&egrave;te et votre phrase de passe sont toutes les deux compromises (esp&eacute;rons que vous vous en apercevrez) - vous devrez &eacute;mettre un certificat de "r&eacute;vocation de cl&eacute; compromise". Ce type de certificat est utilis&eacute; pour pr&eacute;venir les gens d'arr&ecirc;ter d'utiliser votre cl&eacute; publique. Vous pouvez utiliser PGP pour cr&eacute;er un tel certificat en utilisant la commande "-kd". Ensuite, vous devez d'une mani&egrave;re ou d'une autre envoyer ce certificat de r&eacute;vocation &agrave; tout le monde sur la plan&egrave;te, ou au moins &agrave; tous vos amis et &agrave; leurs amis, etc. Leur propre logiciel PGP installera ce certificat de r&eacute;vocation dans leur trousseau de cl&eacute;s publiques et les emp&ecirc;chera automatiquement d'utiliser votre cl&eacute; publique &agrave; l'avenir. Vous pouvez alors g&eacute;n&eacute;rer une nouvelle paire de cl&eacute;s secr&egrave;te/publique et publier la nouvelle cl&eacute; publique. Vous pourriez diffuser un "lot" contenant votre nouvelle cl&eacute; publique et le certificat de r&eacute;vocation de votre ancienne cl&eacute;. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>R&eacute;voquer une cl&eacute; publique <BR>
--------------------------- </P>
<P>Supposons que votre cl&eacute; secr&egrave;te et votre phrase de passe soient d'une mani&egrave;re ou d'une autre toutes les deux compromises. Vous devez le faire savoir au reste du monde, de sorte qu'on arr&ecirc;te d'utiliser votre cl&eacute; publique. Pour ce faire, vous aurez &agrave; &eacute;mettre un certificat de "r&eacute;vocation de cl&eacute; compromise", ou certificat de "r&eacute;vocation de cl&eacute;" pour r&eacute;voquer votre cl&eacute; publique. </P>
<P>Pour g&eacute;n&eacute;rer un certificat pour r&eacute;voquer votre propre cl&eacute;, utilisez la commande -kd: </P>
<P>&nbsp;&nbsp;&nbsp;&nbsp; pgp -kd votre_ID_utilisateur </P>
<P>Ce certificat porte votre signature, faite avec la cl&eacute; que vous &ecirc;tes en train de r&eacute;voquer. Vous devriez largement diffuser ce certificat de r&eacute;vocation de cl&eacute; aussit&ocirc;t que possible. Les personnes qui le recevront peuvent l'ajouter &agrave; leur trousseau de cl&eacute;s publiques, et leur logiciel PGP les emp&ecirc;chera alors automatiquement d'utiliser votre ancienne cl&eacute; publique &agrave; l'avenir. Vous pouvez alors g&eacute;n&eacute;rer une nouvelle paire de cl&eacute;s secr&egrave;te/publique et publier la nouvelle cl&eacute; publique. </P>
<P>Vous pouvez choisir de r&eacute;voquer votre cl&eacute; pour d'autres raisons que la compromission de la cl&eacute; secr&egrave;te. Si c'est le cas, vous aurez &agrave; utiliser la m&ecirc;me proc&eacute;dure pour la r&eacute;voquer. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Que faire si vous perdez votre cl&eacute; secr&egrave;te? <BR>
------------------------------------------- </P>
<P>Normalement, si vous voulez r&eacute;voquer votre propre cl&eacute; secr&egrave;te, vous pouvez utiliser la commande "-kd" pour &eacute;mettre un certificat de r&eacute;vocation, sign&eacute; avec votre propre cl&eacute; secr&egrave;te (voir "R&eacute;voquer une cl&eacute; publique"). </P>
<P>Mais que pouvez-vous faire si vous perdez votre cl&eacute; secr&egrave;te, ou si votre cl&eacute; secr&egrave;te est d&eacute;truite? Vous ne pouvez pas la r&eacute;voquer vous-m&ecirc;me, parce que vous devez utiliser votre propre cl&eacute; secr&egrave;te pour la r&eacute;voquer, et vous ne l'avez plus. Une future version de PGP offrira une m&eacute;thode de substitution pour r&eacute;voquer des cl&eacute;s dans ces circonstances, autorisant des certificateurs fiables &agrave; certifier qu'une cl&eacute; publique a &eacute;t&eacute; r&eacute;voqu&eacute;e. Mais pour l'instant, vous aurez &agrave; le faire savoir par tout moyen, en demandant aux autres utilisateurs de "d&eacute;sactiver" votre cl&eacute; publique dans leurs propres trousseaux personnels de cl&eacute;s publiques. </P>
<P>Les autres utilisateurs pourront d&eacute;sactiver votre cl&eacute; publique dans leurs propres trousseaux de cl&eacute;s publiques en utilisant la commande "-kd". Si un ID utilisateur est sp&eacute;cifi&eacute; qui ne correspond pas &agrave; une cl&eacute; secr&egrave;te dans le trousseau de cl&eacute;s secr&egrave;tes, la commande "-kd" cherchera cet ID utilisateur dans le trousseau de cl&eacute;s publiques, et marquera cette cl&eacute; publique comme d&eacute;sactiv&eacute;e. Une cl&eacute; d&eacute;sactiv&eacute;e ne sera pas utilis&eacute;e pour chiffrer des messages, et ne peut pas &ecirc;tre extraite du trousseau avec la commande -kx. Elle peut toujours servir &agrave; v&eacute;rifier des signatures, mais un avertissement est affich&eacute;. Et si l'utilisateur essaye d'ajouter de nouveau la m&ecirc;me cl&eacute;, cela n'aboutira pas parce que la cl&eacute; d&eacute;sactiv&eacute;e se trouve d&eacute;j&agrave; dans le trousseau. Ces fonctionnalit&eacute;s combin&eacute;es aideront &agrave; entraver la diffusion d'une cl&eacute; d&eacute;sactiv&eacute;e. </P>
<P>Si la cl&eacute; publique sp&eacute;cifi&eacute;e est d&eacute;j&agrave; d&eacute;sactiv&eacute;e, la commande -kd vous demandera si vous voulez r&eacute;activer la cl&eacute;. <BR>
&nbsp; </P>
<P>_ <BR>
Questions Avanc&eacute;es <BR>
============== </P>
<P>La plupart de ces "Questions Avanc&eacute;es" sont couvertes dans le "Guide de l'utilisateur de PGP, Volume II: Questions Sp&eacute;ciales". Mais voici quelques questions qui peuvent &ecirc;tre mentionn&eacute;es ici. <BR>
&nbsp; </P>
<P>Envoyer du texte chiffr&eacute; &agrave; travers les canaux e-mail: le format Radix-64 <BR>
------------------------------------------------------------------------ </P>
<P>La plupart des syst&egrave;mes d'e-mail n'autorisent que les messages en texte ASCII, et non le binaire brut en 8-bit dont est constitu&eacute; le texte chiffr&eacute;. Pour contourner ce probl&egrave;me, PGP supporte le format ASCII radix-64 pour les messages chiffr&eacute;s, identique au format du Privacy Enhanced Mail (PEM), ou au format Internet MIME. Ce format sp&eacute;cial repr&eacute;sente des donn&eacute;es binaires en utilisant uniquement des caract&egrave;res ASCII imprimables, ce qui est utile pour transmettre des donn&eacute;es binaires chiffr&eacute;es &agrave; travers les canaux 7-bit ou pour envoyer des donn&eacute;es chiffr&eacute;es comme du texte e-mail normal. Ce format agit comme une forme d'"armure de transport", le prot&eacute;geant contre la corruption lorsqu'il voyage &agrave; travers les passerelles intersyst&egrave;mes d'Internet. PGP annexe aussi un CRC pour d&eacute;tecter les erreurs de transmission. </P>
<P>Le format Radix-64 convertit le texte clair en &eacute;tendant les groupes de 3 octets binaires de 8-bit en 4 caract&egrave;res ASCII imprimables, aussi le fichier s'accro&icirc;t-il d'environ 33%. Mais l'expansion n'est pas si mauvaise quand vous consid&eacute;rez que le fichier &eacute;tait probablement compress&eacute; davantage que cela par PGP avant d'avoir &eacute;t&eacute; chiffr&eacute;. </P>
<P>Pour produire un fichier chiffr&eacute; au format ASCII radix-64 format, ajoutez simplement l'option "a" en chiffrant ou en signant un message, comme cela: </P>
<P>&nbsp;&nbsp;&nbsp; pgp -esa message.txt son_ID_utilisateur </P>
<P>Cet exemple produit un fichier chiffr&eacute; appel&eacute; "message.asc" qui contient les donn&eacute;es dans un format ASCII radix-64 ressemblant au format MIME. Ce fichier peut &ecirc;tre ais&eacute;ment r&eacute;cup&eacute;r&eacute; dans un &eacute;diteur de texte &agrave; travers les canaux 7-bit pour une transmission comme un e-mail normal sur Internet ou tout autre r&eacute;seau d'e-mails. </P>
<P>D&eacute;chiffrer le message en armure de transport radix-64 n'est pas diff&eacute;rent d'un d&eacute;chiffrement normal. Par exemple: </P>
<P>&nbsp;&nbsp;&nbsp; pgp message </P>
<P>PGP recherche automatiquement le fichier ASCII "message.asc" avant de chercher le fichier binaire "message.pgp". Il reconna&icirc;t que le fichier est au format radix-64 et le reconvertit dans son format binaire avant de proc&eacute;der comme il le fait normalement, produisant ainsi un fichier chiffr&eacute; ".pgp" de forme binaire. Le r&eacute;sultat final est dans une forme de texte clair normal, exactement comme il l'&eacute;tait dans le fichier original "message.txt". </P>
<P>La plupart des infrastructures e-mail d'Internet interdisent l'envoi de messages de plus de 50000 ou 65000 octets. Les messages plus longs doivent &ecirc;tre coup&eacute;s en plus petits morceaux qui peuvent &ecirc;tre envoy&eacute;s s&eacute;par&eacute;ment. Si votre message chiffr&eacute; est tr&egrave;s grand, et que vous demandez un format radix-64, PGP le coupera automatiquement en morceaux qui sont chacun assez petits pour &ecirc;tre envoy&eacute;s par e-mail. Les morceaux sont mis dans des fichiers d'extension ".as1", ".as2", ".as3", etc. Le destinataire doit concat&eacute;nater ces morceaux s&eacute;par&eacute;s dans le bon ordre &agrave; l'int&eacute;rieur d'un gros fichier avant de le d&eacute;chiffrer. En d&eacute;chiffrant, PGP ignore tout texte superflu dans les en-t&ecirc;tes d'e-mail qui ne sont pas compris dans les blocs du message en radix-64. </P>
<P>Si vous voulez envoyer une cl&eacute; publique au format radix-64 &agrave; quelqu'un, ajoutez juste l'option -a&nbsp; en extrayant la cl&eacute; de votre trousseau de cl&eacute;s. </P>
<P>Si vous avez oubli&eacute; d'utiliser l'option -a quand vous avez chiffr&eacute; un fichier ou extrait une cl&eacute;, vous pouvez encore directement convertir le fichier binaire au format radix-64 en utilisant simplement l'option -a toute seule, sans aucun chiffrement sp&eacute;cifi&eacute;. PGP le convertit en un fichier ".asc". </P>
<P>Si vous signez un fichier en clair sans le chiffrer, PGP le compressera normalement apr&egrave;s l'avoir sign&eacute;, le rendant illisible. C'est une fa&ccedil;on commode de stocker des fichiers sign&eacute;s dans des applications d'archivage. Mais si vous voulez envoyer le message sign&eacute; comme e-mail, et que le fichier original est sous forme de texte (et non en binaire), il y a moyen de l'envoyer &agrave; travers un canal e-mail de telle sorte que le texte clair ne soit pas compress&eacute;, et que l'armure ASCII ne soit appliqu&eacute;e que sur la signature binaire, mais pas sur le message en clair. Cela permet au destinataire de lire le message sign&eacute;, sans l'aide de PGP. Bien s&ucirc;r, PGP reste n&eacute;cessaire pour v&eacute;rifier la signature. Pour plus d'informations sur cette fonctionnalit&eacute;, voir l'explication du param&egrave;tre CLEARSIG dans le chapitre "Setting Configuration Parameters" ["R&eacute;glage des param&egrave;tres de configuration"] du Volume II "Questions Sp&eacute;ciales". </P>
<P>Parfois, vous pouvez vouloir envoyer un fichier de donn&eacute;es binaires &agrave; travers un canal e-mail sans le chiffrer ou le signer avec PGP. Des gens utilisent l'utilitaire Unix uuencode dans ce but. PGP peut aussi &ecirc;tre utilis&eacute; &agrave; cet effet, en utilisant simplement l'option -a toute seule, et il fait mieux le travail que l'utilitaire uuencode. Pour plus de d&eacute;tails, voir le chapitre "Using PGP as a Better Uuencode" ["Utiliser PGP comme un Uuencode am&eacute;lior&eacute;"] du Volume II "Questions Sp&eacute;ciales". <BR>
&nbsp; </P>
<P>Variable d'environnement du nom de chemin <BR>
--------------------------------------------- </P>
<P>PGP utilise plusieurs fichiers sp&eacute;ciaux pour ses besoins, ainsi vos trousseaux de cl&eacute;s normaux "pubring.pgp" et "secring.pgp", le fichier alimentant le g&eacute;n&eacute;rateur de nombres pseudo al&eacute;atoires "randseed.bin", le fichier de configuration de PGP "config.txt" (ou "pgp.ini", ou ".pgprc"), et le fichier "language.txt" traduisant les instructions [du logiciel] en langue &eacute;trang&egrave;re. Ces fichiers sp&eacute;ciaux peuvent &ecirc;tre plac&eacute;s dans n'importe quel r&eacute;pertoire, en r&eacute;glant la variable d'environnement "PGPPATH" sur le nom de chemin d&eacute;sir&eacute;. Par exemple, sous MSDOS, la commande de shell: </P>
<P>&nbsp;&nbsp;&nbsp; SET PGPPATH=C:\PGP </P>
<P>fait que PGP consid&egrave;re que le nom de votre trousseau de cl&eacute;s publiques est "C:\PGP\pubring.pgp". En pr&eacute;sumant, bien s&ucirc;r, que ce r&eacute;pertoire existe. Utilisez votre &eacute;diteur de texte favori pour modifier le fichier MSDOS AUTOEXEC.BAT pour r&eacute;gler automatiquement cette variable chaque fois que vous d&eacute;marrez votre syst&egrave;me. Si PGPPATH n'est pas d&eacute;fini, ces fichiers sp&eacute;ciaux sont consid&eacute;r&eacute;s comme se trouvant dans le r&eacute;pertoire courant. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>R&eacute;gler les param&egrave;tres dans le fichier de configuration de PGP <BR>
------------------------------------------------------------- </P>
<P>PGP dispose d'un certain nombre de param&egrave;tres r&eacute;glables par l'utilisateur qui peuvent &ecirc;tre d&eacute;finis dans un fichier texte sp&eacute;cial de configuration de PGP appel&eacute; "config.txt", dans le r&eacute;pertoire vers lequel fait pointer la variable d'environnement PGPPATH. Disposer d'un fichier de configuration permet &agrave; l'utilisateur de d&eacute;finir diverses instructions et param&egrave;tres pour PGP sans le fardeau d'avoir &agrave; toujours d&eacute;finir ces param&egrave;tres dans la ligne de commande de PGP. </P>
<P>Dans le but de se conformer aux conventions de nom propres aux syst&egrave;mes, pour les syst&egrave;mes Unix ce fichier de configuration peut aussi &ecirc;tre nomm&eacute; ".pgprc", et sur les syst&egrave;mes MSDOS il peut aussi &ecirc;tre nomm&eacute; "pgp.ini". </P>
<P>Avec ces param&egrave;tres de configuration, par exemple, vous pouvez contr&ocirc; ler &agrave; quel endroit PGP stocke ses fichiers temporaires, ou vous pouvez s&eacute;lectionner quelle langue &eacute;trang&egrave;re PGP utilisera pour afficher ses messages de diagnostic et ses demandes &agrave; l'utilisateur, ou vous pouvez ajuster le niveau de l'&eacute;valuation critique de PGP dans la d&eacute;termination de la validit&eacute; d'une cl&eacute; selon le nombre de signatures certifi&eacute;es qu'elle poss&egrave;de. </P>
<P>Pour plus de d&eacute;tails sur le r&eacute;glage de ces param&egrave;tres de configuration, voir le chapitre appropri&eacute; du Guide de l'utilisateur de PGP, Volume II "Questions Sp&eacute;ciales". <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Vuln&eacute;rabilit&eacute;s <BR>
-------------- </P>
<P>Aucun syst&egrave;me de s&eacute;curit&eacute; des donn&eacute;es n'est imp&eacute;n&eacute;trable. PGP peut &ecirc;tre circonvenu par une vari&eacute;t&eacute; de biais. Les vuln&eacute;rabilit&eacute;s potentielles dont vous devez &ecirc;tre conscients incluent la compromission de votre phrase de passe ou de votre cl&eacute; secr&egrave;te, la falsification de cl&eacute; publique, les fichiers que vous avez effac&eacute;s mais qui sont encore quelque part sur le disque, les virus et les chevaux de Troie, les br&egrave;ches dans votre s&eacute;curit&eacute; physique, les &eacute;missions &eacute;lectromagn&eacute;tiques, la divulgation sur des syst&egrave;mes multi-utilisateurs, l'analyse de trafic, et peut-&ecirc;tre m&ecirc;me la cryptanalyse directe. </P>
<P>Pour une discussion d&eacute;taill&eacute;e sur ces probl&egrave;mes, voir le chapitre "Vuln&eacute;rabilit&eacute;s" du Guide de l'utilisateur de PGP, Volume II "Questions Sp&eacute;ciales". <BR>
&nbsp; </P>
<P>_ <BR>
Prenez garde &agrave; "l'Huile de Serpent" <BR>
======================== </P>
<P>Quand on examine un logiciel de cryptographie, la question qui se pose toujours est: pourquoi devriez-vous faire confiance &agrave; ce produit? M&ecirc;me si vous examinez le code source par vous-m&ecirc;me, tout le monde n'a pas l'exp&eacute;rience cryptographique pour en appr&eacute;cier la s&eacute;curit&eacute;. M&ecirc;me si vous &ecirc;tes un cryptographe exp&eacute;riment&eacute;, de subtiles faiblesses dans les algorithmes peuvent toujours vous &eacute;chapper. </P>
<P>Quand j'&eacute;tais au coll&egrave;ge, au d&eacute;but des ann&eacute;es 70, j'avais con&ccedil;u ce que je croyais &ecirc;tre un sch&eacute;ma de chiffrement g&eacute;nial. Un simple flux pseudo al&eacute;atoire &eacute;tait ajout&eacute; au flux de texte clair pour cr&eacute;er un texte chiffr&eacute;. Cela devait apparemment contrecarrer toute analyse de fr&eacute;quence sur le texte chiffr&eacute;, et &ecirc;tre incassable m&ecirc;me pour les services de renseignement du Gouvernement disposant des plus grandes ressources qui soient. Je me sentais si suffisant &agrave; propos de mon exploit. S&ucirc;r comme un coq. </P>
<P>Des ann&eacute;es plus tard, je d&eacute;couvris le m&ecirc;me sch&eacute;ma dans de nombreux textes d'introduction &agrave; la cryptographie et des articles de cours. Comme c'&eacute;tait charmant. Les autres cryptographes avaient pens&eacute; au m&ecirc;me sch&eacute;ma. Malheureusement, le sch&eacute;ma &eacute;tait pr&eacute;sent&eacute; comme un simple devoir d'&eacute;colier sur comment utiliser des techniques cryptographiques &eacute;l&eacute;mentaires pour les craquer banalement. Autant pour mon sch&eacute;ma g&eacute;nial. </P>
<P>De ma modeste exp&eacute;rience, j'ai appris combien il est facile de verser dans une conception erron&eacute;e de la s&eacute;curit&eacute; quand on con&ccedil;oit un algorithme de chiffrement. La plupart des gens ne r&eacute;alisent pas combien il est diablement difficile de concevoir un algorithme de chiffrement qui puisse r&eacute;sister &agrave; une attaque prolong&eacute;e et d&eacute;termin&eacute;e par un adversaire poss&eacute;dant de grandes ressources. Beaucoup d'ing&eacute;nieurs informaticiens sur grands syst&egrave;mes ont d&eacute;velopp&eacute; des sch&eacute;mas de chiffrement aussi na&iuml;fs (souvent m&ecirc;me exactement le m&ecirc;me sch&eacute;ma), et certains d'entre eux ont &eacute;t&eacute; incorpor&eacute;s dans des logiciels de chiffrement commerciaux et vendus contre argent sonnant et tr&eacute;buchant &agrave; des milliers d'utilisateurs ne soup&ccedil;onnant rien. </P>
<P>C'est comme vendre des ceintures de s&eacute;curit&eacute; d'automobile qui ont une bonne apparence et semblent efficaces, mais s'ouvrent d'un coup m&ecirc;me au plus petit test d'accident. Compter sur elles peut &ecirc;tre pire que de ne pas porter de ceinture du tout. Personne ne suspecte qu'elles sont mauvaises jusqu'&agrave; l'accident r&eacute;el. Compter sur un logiciel de cryptographie faible peut faire mettre inconsciemment en danger des informations sensibles. Vous ne l'auriez pas fait si vous n'aviez pas eu du tout de logiciel de cryptographie. Peut-&ecirc;tre ne d&eacute;couvrirez vous jamais que vos donn&eacute;es ont &eacute;t&eacute; compromises. </P>
<P>Parfois, les logiciels commerciaux utilisent le standard f&eacute;d&eacute;ral am&eacute;ricain Data Encryption Standard (DES), un assez honn&ecirc;te algorithme conventionnel recommand&eacute; par le Gouvernement am&eacute;ricain pour l'utilisation commerciale (mais pas pour l'information class&eacute;e secret d&eacute;fense, chose curieuse - hmmm). Il y a plusieurs "modes d'op&eacute;ration" que le DES peut utiliser, certains d'entre eux sont meilleurs que d'autres. Le Gouvernement recommande express&eacute;ment de ne pas utiliser le mode le plus simple et le plus faible pour les messages, le mode Electronic Codebook (ECB). En revanche, on recommande les modes plus r&eacute;sistants et plus complexes Cipher Feedback (CFB) ou Cipher Block Chaining (CBC). </P>
<P>Malheureusement, la plupart des logiciels commerciaux de cryptographie que j'ai examin&eacute;s utilisent le mode ECB. Quand j'en ai parl&eacute; aux auteurs de plusieurs de ces r&eacute;alisations, ils ont dit qu'ils n'avaient jamais entendu parler des modes CBC ou CFB, et qu'ils ne savaient rien au sujet de la faiblesse du mode ECB. Le fait m&ecirc;me qu'ils n'aient jamais &eacute;tudi&eacute; assez de cryptographie pour conna&icirc;tre ces concepts &eacute;l&eacute;mentaires n'est pas rassurant. Et ils g&egrave;rent parfois leurs cl&eacute;s DES d'une mani&egrave;re inad&eacute;quate ou non s&ucirc;re. De m&ecirc;me, ces logiciels incluent souvent un second algorithme plus rapide qui peut &ecirc;tre utilis&eacute; &agrave; la place du DES plus lent. L'auteur du logiciel pense souvent que son algorithme propri&eacute;taire plus rapide est aussi s&ucirc;r que le DES, mais apr&egrave;s l'avoir questionn&eacute; je d&eacute;couvre habituellement que c'est juste une variation de mon g&eacute;nial sch&eacute;ma des jours de coll&egrave;ge. Ou peut-&ecirc;tre ne r&eacute;v&eacute;lera-t-il jamais comment son sch&eacute;ma de chiffrement propri&eacute;taire fonctionne, mais il m'assure que c'est un sch&eacute;ma g&eacute;nial et que je devrais lui faire confiance. Je suis s&ucirc;r qu'il croit que son algorithme est g&eacute;nial, mais comment puis-je le savoir sans le voir? </P>
<P>En toute justice, je dois signaler que dans la plupart des cas ces produits lamentables ne proviennent pas de soci&eacute;t&eacute;s qui se sp&eacute;cialisent dans la technologie cryptographique. </P>
<P>M&ecirc;me les tr&egrave;s bons logiciels, qui utilisent le DES dans le mode d'op&eacute;ration correct pr&eacute;sentent encore des probl&egrave;mes. Le standard DES utilise une cl&eacute; de 56 bits, ce qui est trop petit pour les normes actuelles, et peut maintenant &ecirc;tre ais&eacute;ment cass&eacute;e par des recherches exhaustives de la cl&eacute; sur des machines ultra rapides sp&eacute;ciales. Le DES a atteint la fin de sa vie utile, et voil&agrave; pourtant encore des logiciels qui y font appel. </P>
<P>Il y a une soci&eacute;t&eacute; appel&eacute;e AccessData (87 East 600 South, Orem, Utah 84058, phone 1-800- 658-5199) qui vend un ensemble pour $185 qui craque le sch&eacute;ma de chiffrement int&eacute;gr&eacute; utilis&eacute; par WordPerfect, Lotus 1-2-3, MS Excel, Symphony, Quattro Pro, Paradox, et MS Word 2.0. Il ne recherche pas simplement les mots de passe - il fait vraiment de la cryptanalyse. Des gens l'ach&egrave;tent quand ils ont oubli&eacute; leur mot de passe pour leurs propres fichiers. Les services de police judiciaire l'ach&egrave;tent aussi, ainsi peuvent-ils lire les fichiers qu'ils saisissent. J'ai parl&eacute; &agrave; Eric Thompson, l'auteur, et il a dit que son programme prend seulement une demi seconde pour les craquer, mais qu'il a int&eacute;gr&eacute; une boucle retardatrice pour le ralentir de sorte que cela ne semble pas trop facile au client. Il m'a aussi dit que la fonction de chiffrement par mot de passe des fichiers PKZIP peut souvent &ecirc;tre cass&eacute;e facilement, et que ses clients de la police judiciaire recourent r&eacute;guli&egrave;rement &agrave; ce genre de services fournis par un autre vendeur. </P>
<P>D'un certain point de vue, la cryptographie est comme la pharmacie. Sa qualit&eacute; peut &ecirc;tre absolument cruciale. La mauvaise p&eacute;nicilline a la m&ecirc;me apparence que la bonne. Vous pouvez juger que votre tableur est mauvais, mais comment juger que votre logiciel de cryptographie est faible? Le texte chiffr&eacute; produit par un algorithme de chiffrement faible para&icirc;t aussi bon que le texte chiffr&eacute; produit par un algorithme de chiffrement r&eacute;sistant. Il y a beaucoup d'huile de serpent l&agrave;-dedans. Beaucoup de rem&egrave;des de charlatan. Contrairement aux colporteurs de rem&egrave;des de charlatans, ces programmeurs de logiciels ne savent habituellement m&ecirc;me pas que leur truc est de l'huile de serpent. Ils sont peut-&ecirc;tre de bons ing&eacute;nieurs informaticiens, mais ils n'ont habituellement m&ecirc;me pas lu d'ouvrages universitaires de cryptographie. Mais ils croient quand m&ecirc;me qu'ils peuvent &eacute;crire de bons logiciels de cryptographie. Et pourquoi pas? Apr&egrave;s tout, cela semble intuitivement facile &agrave; faire. Et leurs logiciels semblent bien marcher. </P>
<P>Quiconque croit avoir invent&eacute; un sch&eacute;ma de chiffrement incassable est, soit un v&eacute;ritable g&eacute;nie, soit un na&iuml;f inexp&eacute;riment&eacute;. Malheureusement, j'ai quelquefois affaire &agrave; ces pr&eacute;tendus cryptographes qui veulent apporter des "am&eacute;liorations" &agrave; PGP en lui ajoutant des algorithmes de chiffrement de leur cru. </P>
<P>Je me souviens d'une conversation avec Brian Snow, un cryptographe haut plac&eacute; et ancien de la NSA. Il me dit qu'il ne ferait jamais confiance &agrave; un algorithme de chiffrement con&ccedil;u par quelqu'un qui ne s'&eacute;tait pas "fait les dents" en passant d'abord beaucoup de temps &agrave; casser des codes. Cela tombait sous le sens. J'observai que pratiquement personne dans le monde de la cryptographie commerciale n'&eacute;tait qualifi&eacute; selon ce crit&egrave;re. "Oui", r&eacute;pondit-il avec un sourire entendu, "Et cela rend notre travail &agrave; la NSA tellement plus facile." Une r&eacute;flexion &agrave; vous glacer le sang. Je n'en aurais pas jug&eacute; autrement. </P>
<P>Le Gouvernement am&eacute;ricain a &eacute;galement colport&eacute; l'huile de serpent. Apr&egrave;s la Seconde Guerre mondiale, les USA vendirent les machines &agrave; chiffrer allemandes Enigma aux gouvernements du Tiers-monde. Mais ils ne leur dirent pas que les Alli&eacute;s avait cass&eacute; le code Enigma pendant la guerre, un fait qui resta class&eacute; secret d&eacute;fense pendant de nombreuses ann&eacute;es. Aujourd'hui encore, de nombreux syst&egrave;me Unix dans le monde entier utilisent l'algorithme d'Enigma pour le chiffrement de fichiers, en partie parce que le Gouvernement a dress&eacute; des obstacles l&eacute;gaux contre l'utilisation de meilleurs algorithmes. Ils essay&egrave;rent m&ecirc;me d'emp&ecirc;cher la publication initiale de l'algorithme RSA en 1977. Et ils ont bris&eacute; dans l'oeuf toutes les tentatives [de l'industrie] pour d&eacute;velopper des t&eacute;l&eacute;phones r&eacute;ellement s&eacute;curis&eacute;s pour le grand public. </P>
<P>Le principal travail de la NSA (National Security Agency) du Gouvernement am&eacute;ricain est de recueillir des renseignements, principalement en enregistrant secr&egrave;tement les communications priv&eacute;es des gens (voir le livre de James Bamford, "The Puzzle Palace"). La NSA a accumul&eacute; des comp&eacute;tences et des ressources consid&eacute;rables pour casser des codes. Quand les gens ne peuvent pas disposer de bonne cryptographie pour se prot&eacute;ger, cela rend le travail de la NSA plus facile. La NSA a &eacute;galement la responsabilit&eacute; d'approuver et recommander des algorithmes de chiffrement. Des critiques soutiennent que c'est une source de conflits d'int&eacute;r&ecirc;ts, comme mettre le renard &agrave; garder le poulailler. La NSA a pouss&eacute; en avant un algorithme de chiffrement conventionnel qu'elle avait con&ccedil;u, et elle ne dira &agrave; personne comment il fonctionne parce que c'est class&eacute; secret d&eacute;fense. Elle veut qu'on lui fasse confiance et qu'on l'utilise. Mais n'importe quel cryptographe vous dira qu'un algorithme bien con&ccedil;u n'a pas &agrave; &ecirc;tre class&eacute; secret d&eacute;fense pour rester s&ucirc;r. Seules les cl&eacute;s pouraient avoir besoin de protection. Comment fait-on pour savoir vraiment si l'algorithme class&eacute; secret d&eacute;fense de la NSA est s&ucirc;r? Il n'est pas difficile pour la NSA de concevoir un algorithme de chiffrement qu'elle seule peut craquer, si personne ne peut examiner l'algorithme. Est-elle d&eacute;lib&eacute;r&eacute;ment en train de vendre de l'huile de serpent? </P>
<P>Il y a trois facteurs principaux qui ont min&eacute; la qualit&eacute; des logiciels commerciaux de cryptographie aux USA. Le premier est le manque virtuellement universel de comp&eacute;tence des programmeurs de logiciels commerciaux de cryptographie (quoique cela commence &agrave; changer depuis la sortie de PGP). Chaque ing&eacute;nieur informaticien se prend pour un cryptographe, ce qui a conduit &agrave; la prolif&eacute;ration de logiciels de crypto vraiment mauvais. Le second est que la NSA a d&eacute;lib&eacute;r&eacute;ment et syst&eacute;matiquement &eacute;limin&eacute; toutes les bonnes technologies commerciales de chiffrement, par l'intimidation l&eacute;gale et la pression &eacute;conomique. Une partie de cette pression a &eacute;t&eacute; port&eacute;e &agrave; son maximum par les rigoureux contr&ocirc;les &agrave; l'exportation sur les logiciels de cryptographie ce qui, vu l'aspect financier du marketing logiciel, a eu pour r&eacute;sultat d'&eacute;liminer les logiciels de chiffrement domestiques. L'autre principale m&eacute;thode d'&eacute;limination vient de la concession de tous les brevets portant sur tous les algorithmes de chiffrement &agrave; cl&eacute; publique &agrave; une seule soci&eacute;t&eacute;, constituant un goulot d'&eacute;tranglement pour emp&ecirc;cher l'extension de cette technologie. Le r&eacute;sultat tangible de tout cela est qu'avant la sortie de PGP, il n'y avait presque pas de logiciels de chiffrement de haute s&eacute;curit&eacute; disponibles aux USA. </P>
<P>Je ne suis pas aussi certain de la s&eacute;curit&eacute; de PGP que je l'&eacute;tais autrefois de celle de mon g&eacute;nial sch&eacute;ma de chiffrement du coll&egrave;ge. Si je l'&eacute;tais, cela serait mauvais signe. Mais je suis &agrave; peu pr&egrave;s s&ucirc;r que PGP ne contient pas de faiblesses manifestes (bien qu'il puisse contenir des bogues). Les algorithmes de crypto ont &eacute;t&eacute; d&eacute;velopp&eacute;s par des personnes hautement qualifi&eacute;es dans les milieux de la cryptographie universitaire civile, et chacun d'eux a &eacute;t&eacute; soumis &agrave; un examen approfondi &eacute;tendu. Le code source est disponible pour faciliter l'examen approfondi de PGP et aider &agrave; dissiper les craintes de certains utilisateurs. Il est raisonnablement bien &eacute;tudi&eacute;, et cela a pris des ann&eacute;es pour le faire. Et je ne travaille pas pour la NSA. J'esp&egrave;re qu'on n'aura pas &agrave; recourir &agrave; un "acte de foi" pour croire &agrave; la s&eacute;curit&eacute; de PGP. <BR>
&nbsp; </P>
<P>_ <BR>
Notice pour les utilisateurs de Macintosh <BR>
============================ </P>
<P>PGP a &eacute;t&eacute; d&eacute;velopp&eacute; &agrave; l'origine pour les machines sous MSDOS et Unix. Il y a aussi une version pour Apple Macintosh de PGP. Ce manuel est &eacute;crit pour les versions MSDOS/Unix de PGP, qui utilisent une interface en mode caract&egrave;res pour toutes les fonctions de PGP. Sur le Mac, toutes les fonctions de PGP sont accessibles &agrave; travers des menus d&eacute;roulants et des bo&icirc;tes de dialogues. Il y a aussi une aide en ligne sur le Mac pour savoir comment utiliser MacPGP, et il devrait y avoir une documentation sp&eacute;cifique au Mac incluse dans l'archive de la version MacPGP, en plus de ce manuel. </P>
<P>La plupart des bons logiciels pour Mac sont &eacute;crits directement pour le Mac et avec son style, et non simplement port&eacute;s depuis un autre syst&egrave;me d'exploitation. Malheureusement, l'actuelle version Mac de PGP n'a pas &eacute;t&eacute; con&ccedil;ue pour le Mac dans cet esprit. Elle a &eacute;t&eacute; port&eacute;e depuis la version MSDOS/Unix vers le Mac par Zbigniew Fiedorwicz. Comme la version MSDOS/Unix de PGP n'a pas &eacute;t&eacute; con&ccedil;ue pour une GUI (interface graphique utilisateur), la porter pour le Mac n'&eacute;tait pas une t&acirc;che facile, et beaucoup de bogues demeurent. Une toute nouvelle version de PGP est en d&eacute;veloppement, con&ccedil;ue pour une adaptation facile &agrave; une GUI. Une nouvelle version Mac sera d&eacute;velopp&eacute;e depuis ce nouveau code source de PGP. Cela ressemblera plus &agrave; du Mac, et ce sera plus fiable. En d&eacute;pit des bogues de la version actuelle de MacPGP, il est important de noter que si Zbigniew avait attendu que cette toute nouvelle version de PGP soit d&eacute;velopp&eacute;e pour porter PGP sur le Mac, le monde aurait &eacute;t&eacute; priv&eacute; d'une version Mac de PGP pendant trop longtemps. <BR>
&nbsp; </P>
<P>_ <BR>
Aide-m&eacute;moire de PGP <BR>
================ </P>
<P>Voici un rapide r&eacute;sum&eacute; des commandes de PGP. <BR>
&nbsp; </P>
<P>Pour chiffrer un fichier clair avec la cl&eacute; publique du destinataire:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -e fichier son_ID_utilisateur </P>
<P>Pour signer un fichier clair avec votre cl&eacute; secr&egrave;te:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -s fichier [-u votre_ID_utilisateur] </P>
<P>Pour signer un fichier clair de texte ASCII avec votre cl&eacute; secr&egrave;te, produisant un message sign&eacute; de texte clair pouvant &ecirc;tre envoy&eacute; par e-mail:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -sta fichier [-u votre_ID_utilisateur] </P>
<P>Pour signer un fichier clair avec votre cl&eacute; secr&egrave;te, puis le chiffrer avec la cl&eacute; publique du destinataire:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -es fichier son_ID_utilisateur [-u votre_ID_utilisateur] </P>
<P>Pour chiffrer un fichier clair de mani&egrave;re conventionnelle seulement, tapez:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -c fichier </P>
<P>Pour d&eacute;chiffrer un fichier chiffr&eacute;, ou pour v&eacute;rifier l'int&eacute;grit&eacute; d'un fichier sign&eacute;:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp fichier_chiffr&eacute; [-o fichier_en_clair] </P>
<P>Pour chiffrer un message &agrave; l'intention de plusieurs destinataires:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -e fichier ID_utilisateur1 ID_utilisateur2 ID_utilisateur3 </P>
<P>--- Commandes de gestion des cl&eacute;s: </P>
<P>Pour g&eacute;n&eacute;rer votre propre paire de cl&eacute;s publique/secr&egrave;te:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kg </P>
<P>Pour ajouter le contenu d'un fichier de cl&eacute;s &agrave; votre trousseau de cl&eacute;s publiques ou secr&egrave;tes:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -ka fichier_de_cl&eacute;s [trousseau_de_cl&eacute;s] </P>
<P>Pour extraire (copier) une cl&eacute; de votre trousseau de cl&eacute;s publiques ou secr&egrave;tes:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kx ID_utilisateur fichier_de_cl&eacute; [trousseau_de_cl&eacute;s]</P>
<P>ou:&nbsp; pgp -kxa ID_utilisateur fichier_de_cl&eacute; [trousseau_de_cl&eacute;s] </P>
<P>Pour visualiser le contenu de votre trousseau de cl&eacute;s publiques:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kv[v] [ID_utilisateur] [trousseau_de_cl&eacute;s] </P>
<P>Pour visualiser l'"empreinte" d'une cl&eacute; publique, afin de la v&eacute;rifier au t&eacute;l&eacute;phone avec son propri&eacute;taire:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kvc [ID_utilisateur] [trousseau_de_cl&eacute;s] </P>
<P>Pour visualiser le contenu et v&eacute;rifier les signatures de votre trousseau de cl&eacute;s publiques:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kc [ID_utilisateur] [trousseau_de_cl&eacute;s] </P>
<P>Pour &eacute;diter [modifier] l'ID_utilisateur ou la phrase de passe de votre cl&eacute; secr&egrave;te:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -ke ID_utilisateur [trousseau_de_cl&eacute;s] </P>
<P>Pour &eacute;diter [modifier] les param&egrave;tres de fiabilit&eacute; d'une cl&eacute; publique:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -ke ID_utilisateur [trousseau_de_cl&eacute;s] </P>
<P>Pour effacer une cl&eacute; ou seulement un ID_utilisateur de votre trousseau de cl&eacute;s publiques:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kr ID_utilisateur [trousseau_de_cl&eacute;s] </P>
<P>Pour signer et ainsi certifier la cl&eacute; publique de quelqu'un dans votre trousseau de cl&eacute;s publiques:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -ks son_ID_utilisateur [-u votre_ID_utilisateur] [trousseau_de_cl&eacute;s] </P>
<P>Pour enlever certaines signatures d'un ID utilisateur dans un trousseau de cl&eacute;s:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -krs ID_utilisateur [trousseau_de_cl&eacute;s] </P>
<P>Pour r&eacute;voquer d&eacute;finitivement votre propre cl&eacute;, &eacute;mettant un certificat de cl&eacute; compromise:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kd votre_ID_utilisateur </P>
<P>Pour d&eacute;sactiver ou r&eacute;activer une cl&eacute; publique dans votre propre trousseau de cl&eacute;s publiques:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -kd ID_utilisateur </P>
<P>--- Commandes &eacute;sot&eacute;riques: </P>
<P>Pour d&eacute;chiffrer un message [sign&eacute;] et y laisser la signature qui s'y trouve intacte:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -d fichier_chiffr&eacute; </P>
<P>Pour cr&eacute;er une signature d&eacute;tach&eacute;e du document:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -sb fichier [-u votre_ID_utilisateur] </P>
<P>Pour d&eacute;tacher la signature du message sign&eacute;:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -b fichier_chiffr&eacute; </P>
<P>--- Options de commande qui peuvent &ecirc;tre utilis&eacute;es en combinaison avec d'autres options de commande (parfois m&ecirc;me en &eacute;pelant certains mots int&eacute;ressants!): </P>
<P>Pour produire un texte chiffr&eacute; au format ASCII radix-64, ajoutez simplement l'option -a lors du chiffrement ou de la signature d'un message ou de l'extraction [copie] d'une cl&eacute;:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -sea fichier son_ID_utilisateur ou:&nbsp; pgp -kxa ID_utilisateur fichier_de_cl&eacute; [trousseau_de_cl&eacute;s] </P>
<P>Pour d&eacute;truire le fichier clair apr&egrave;s la production du texte chiffr&eacute;, ajoutez simplement l'option -w (wipe) lors du chiffrement ou de la signature d'un message:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -sew message.txt son_ID_utilisateur </P>
<P>Pour sp&eacute;cifier que le fichier clair contient du texte ASCII, et pas du binaire, et devrait &ecirc;tre converti suivant les r&egrave;gles des sauts de ligne du destinataire, ajoutez l'option -t (texte) aux autres options:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -seat message.txt son_ID_utilisateur </P>
<P>Pour visualiser la sortie du fichier d&eacute;chiffr&eacute; sur votre &eacute;cran (dans le genre de la commande Unix "more"), sans l'&eacute;crire dans un fichier, utilisez l'option -m (more) en d&eacute;chiffrant:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -m fichier_chiffr&eacute; </P>
<P>Pour sp&eacute;cifier que le fichier d&eacute;chiffr&eacute; par le destinataire sera SEULEMENT affich&eacute; sur son &eacute;cran et ne pourra pas &ecirc;tre sauvegard&eacute; sur le disque, ajoutez l'option -m:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -steam message.txt son_ID_utilisateur </P>
<P>Pour r&eacute;cup&eacute;rer le nom originel du fichier clair en le d&eacute;chiffrant, ajoutez l'option -p:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -p fichier_chiffr&eacute; </P>
<P>Pour utiliser un filtre dans le genre des commandes Unix, lisant depuis l'entr&eacute;e standard et &eacute;crivant vers la sortie standard, ajoutez l'option -f:</P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pgp -feast son_ID_utilisateur &lt;fichier_entr&eacute;e fichier_sortie <BR>
&nbsp; </P>
<P>_ <BR>
Questions l&eacute;gales <BR>
============ </P>
<P>Pour des informations d&eacute;taill&eacute;es sur la licence, la distribution, les copyrights, les brevets, marques d&eacute;pos&eacute;es, limitations de responsabilit&eacute;, et contr&ocirc;le de l'exportation en dehors des USA, voyez le chapitre "Questions l&eacute;gales" dans le "Guide de l'utilisateur de PGP, Volume II: Questions Sp&eacute;ciales". </P>
<P>PGP utilise un algorithme &agrave; cl&eacute; publique couvert par un brevet am&eacute;ricain (U.S. patent #4,405,829). Les droits exclusifs de licence de ce brevet sont d&eacute;tenus par une compagnie appel&eacute;e Public Key Partners (PKP), et vous pouvez enfreindre ses droits si vous utilisez PGP aux USA sans une licence. Ces questions sont d&eacute;taill&eacute;es dans le Volume II du manuel, et dans la licence RSAREF qui accompagne la version freeware de PGP. PKP a accord&eacute; certains droits sur la licence &agrave; d'autres, dont la compagnie connue sous le nom de ViaCrypt, &agrave; Phoenix, Arizona, aux USA. ViaCrypt vend une version avec licence compl&egrave;te de PGP. [Viacrypt a &eacute;t&eacute; rachet&eacute; par PGP, Inc. en 1996, qui a &eacute;t&eacute; rachet&eacute; par Network Associates, Inc. en 1997: http://www.nai.com ] </P>
<P>PGP est un freeware de "gu&eacute;rilla", et cela ne me g&ecirc;ne pas que vous le distribuiez largement. Juste une chose: ne me demandez pas de vous en envoyer une copie. Vous pouvez le trouver sur de nombreux BBS et sites FTP d'Internet. Mais avant de le distribuer [depuis les USA ou le Canada], il est essentiel que vous compreniez les contr&ocirc;les am&eacute;ricains sur l'exportation des logiciels de cryptographie. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>Remerciements <BR>
=========== </P>
<P>De formidables obstacles et des forces puissantes ont &eacute;t&eacute; align&eacute;s pour arr&ecirc;ter PGP. Les personnes &agrave; qui il est d&eacute;di&eacute; ont aid&eacute; et aident encore &agrave; surmonter ces obstacles. PGP a obtenu la notori&eacute;t&eacute; en tant que "logiciel souterrain", et faire sortir PGP des catacombes pour en faire un logiciel freeware avec une licence en r&egrave;gle a requis de la patience et de la t&eacute;nacit&eacute;. Je voudrais remercier tout particuli&egrave;rement Hal Abelson, Jeff Schiller, Brian LaMacchia, et Derek Atkins du MIT pour leur efforts d&eacute;termin&eacute;s. Je voudrais aussi remercier Jim Bruce et David Litster de l'administration du MIT et Bob Prior et Terry Ehling des Presses du MIT. Et je voudrais remercier toute l'&eacute;quipe de mes d&eacute;fenseurs dont le travail n'est pas encore termin&eacute;. J'avais l'habitude de faire un tas de plaisanteries sur les avocats avant de rencontrer des exemples aussi positifs dans l'&eacute;quipe de mes d&eacute;fenseurs, la plupart d'entre eux ayant travaill&eacute; b&eacute;n&eacute;volement. </P>
<P>Le d&eacute;veloppement de PGP a tourn&eacute; au ph&eacute;nom&egrave;ne social significatif, dont l'appel politiquement original &agrave; le soutenir a inspir&eacute; les efforts collectifs d'un nombre grandissant de programmeurs b&eacute;n&eacute;voles. Vous rappelez-vous l'histoire pour les enfants appel&eacute;e la "Soupe aux cailloux"? </P>
<P>J'aimerais remercier les personnes suivantes pour leurs contributions &agrave; la cr&eacute;ation de Pretty Good Privacy. Bien que je sois l'auteur de PGP version 1.0, la plus grande partie des derni&egrave;res versions de PGP fut r&eacute;alis&eacute;e gr&acirc;ce &agrave; un effort de coop&eacute;ration internationale impliquant un grand nombre de contributeurs, sous ma ma&icirc;trise d'oeuvre. </P>
<P>Branko Lankester, Hal Finney et Peter Gutmann contribu&egrave;rent tous en accordant une part &eacute;norme de leur temps &agrave; l'ajout de fonctionnalit&eacute;s &agrave; PGP 2.0, et l'ont port&eacute; sur les variantes d'Unix. </P>
<P>Hugh Kennedy l'a port&eacute; sur VAX/VMS, Lutz Frank l'a port&eacute; sur Atari ST, et Cor Bosman et Colin Plumb l'ont port&eacute; sur Commodore Amiga. </P>
<P>La traduction de PGP en langues &eacute;trang&egrave;res a &eacute;t&eacute; faite par Jean-loup Gailly en France, Armando Ramos en Espagne, Felipe Rodriquez Svensson et Branko Lankester aux Pays-Bas, Miguel Angel Gallardo en Espagne, Hugh Kennedy et Lutz Frank en Allemagne, David Vincenzetti en Italie, Harry Bush et Maris Gabalins en Lettonie, Zygimantas Cepaitis en Lituanie, Peter Suchkow et Andrew Chernov en Russie, et Alexander Smishlajev en Esp&eacute;ranto. Peter Gutmann a offert de le traduire en anglais de Nouvelle-Z&eacute;lande, mais nous avons finalement d&eacute;cid&eacute; que PGP ferait l'affaire en anglais am&eacute;ricain. </P>
<P>Jean-Loup Gailly, Mark Adler, et Richard B. Wales ont publi&eacute; le code [source] de compression ZIP, et accord&eacute; la permission de l'inclure dans PGP. Les routines MD5 ont &eacute;t&eacute; d&eacute;velopp&eacute;es et plac&eacute;es dans le domaine public par Ron Rivest. L'algorithme IDEA(tm) a &eacute;t&eacute; d&eacute;velopp&eacute; par Xuejia Lai et James L. Massey &agrave; l'ETH de Zurich, et a &eacute;t&eacute; utilis&eacute; dans PGP avec la permission de Ascom-Tech AG. </P>
<P>Charlie Merritt m'a appris &agrave; l'origine comment faire une horloge arithm&eacute;tique multipr&eacute;cision d&eacute;cente pour la cryptographie &agrave; cl&eacute; publique, et Jimmy Upton a contribu&eacute; &agrave; rendre plus rapide l'algorithme [de multiplication modulo un entier]. Thad Smith a r&eacute;alis&eacute; un algorithme [de ce genre] encore plus rapide. Zhahai Stewart a contribu&eacute; par beaucoup de suggestions pertinentes quant au format des fichiers de PGP et d'autres choses, dont le fait d'avoir plus d'un nom d'utilisateur par cl&eacute;. J'ai trouv&eacute; l'id&eacute;e des certificateurs fiables chez Whit Diffie. Kelly Goen a fait le gros du travail pour la publication initiale de PGP 1.0. </P>
<P>Des contributions vari&eacute;es &agrave; l'effort d'&eacute;criture du code [source] sont aussi venues de Colin Plumb, Derek Atkins, et Castor Fu. Les autres contributions &agrave; cet effort, d'&eacute;criture du code ou d'autres choses, sont venues de Hugh Miller, Eric Hughes, Tim May, Stephan Neuhaus, et de beaucoup trop d'autres personnes pour que leurs noms me reviennent imm&eacute;diatement &agrave; l'esprit. Zbigniew Fiedorwicz a fait le premier portage pour Macintosh. </P>
<P>Depuis la r&eacute;alisation de PGP 2.0, beaucoup d'autres programmeurs ont envoy&eacute; des correctifs et des corrections de bogues et am&eacute;lior&eacute; le portage pour les autres ordinateurs. Ils sont trop nombreux pour &ecirc;tre remerci&eacute;s individuellement ici. </P>
<P>Exactement comme dans l'histoire de la "Soupe aux cailloux", il devient de plus en plus dur de voir, &agrave; travers la soupe &eacute;paisse, tout au fond, les cailloux que j'avais lanc&eacute;s dedans pour tout commencer. <BR>
&nbsp; <BR>
&nbsp; </P>
<P>A propos de l'auteur <BR>
============== </P>
<P>Philip Zimmermann est un ing&eacute;nieur informaticien consultant avec une exp&eacute;rience de 19 ans, sp&eacute;cialement dans le domaine des syst&egrave;mes en temps r&eacute;el, de la cryptographie, de l'authentification, et des communications de donn&eacute;es. Cette exp&eacute;rience int&egrave;gre la conception et la r&eacute;alisation de syst&egrave;mes d'authentification pour les r&eacute;seaux d'informations financi&egrave;res, la s&eacute;curit&eacute; des r&eacute;seaux de donn&eacute;es, les protocoles de gestion de cl&eacute;s, l'int&eacute;gration d'ex&eacute;cutables multit&acirc;ches, les syst&egrave;mes d'exploitation, et les r&eacute;seaux locaux. </P>
<P>e-mail :&nbsp; <A HREF="mailto:prz@acm.org">prz@acm.org</A> <BR>
&nbsp; </P>
<P>[Pour toute autre version de PGP, contacter: </P>
<P>[<A HREF="http://www.pgp.com/">Network Associates, Inc.</A> (USA) <BR>
[<A HREF="http://www.pgpinternational.com/">Network Associates BV</A> (Pays-Bas) <BR>
[<A HREF="http://www.pgpi.com/">International PGP home page</A> (Norv&egrave;ge) <BR>
&nbsp; <BR>
&nbsp; </P></BODY>
</HTML>
