<html>
<head>
<title>Capa e Introdu&ccedil;&atilde;o</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
</head>

<body bgcolor="#FFFFFF">
<p><b><font size="6" face="Arial, Helvetica, sans-serif">PGP Windows 95, 98, and 
  NT </font></b></p>
<p><font size="6" face="Arial, Helvetica, sans-serif"><b>Guia do Usu&aacute;rio</b></font></p>
<p>&nbsp;</p>
<p><b><font face="Arial, Helvetica, sans-serif" size="6">vers&atilde;o 6.0</font></b></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>Copyright &copy; 1990-1998 Network Associates, Inc. e suas Companhias Afiliadas. 
  Todos os direitos reservados.</p>
<div align="right"><font color="darkblue"> Tradu&ccedil;&atilde;o para o portugu&ecirc;s do Brasil, diagrama&ccedil;&atilde;o 
  e vers&otilde;es HTML e PDF feitas por<br>
  Christian Haagensen Gontijo - chrishg@geocities.com<br>
  novembro de 1999.</font></div>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>PGP*, Vers&atilde;o 6.0.2</p>
<p>11-98. Original impresso nos Estados Unidos da Am&eacute;rica.</p>
<p>PGP, Pretty Good, e Pretty Good Privacy s&atilde;o marcas registradas da Network 
  Associates, Inc. e/ou suas Companhias Afiliadas nos EUA e outros pa&iacute;ses. 
  Todas as outras marcas registradas e n&atilde;o registradas neste documento 
  s&atilde;o de &uacute;nica propriedade de seus respectivos propriet&aacute;rios.</p>
<p>Por&ccedil;&otilde;es deste software podem usar algoritmos de chave p&uacute;blica 
  descritos s&atilde;o patenteados nos EUA com os n&uacute;meros 4,200,770, 4,218,582, 
  4,405,829, e 4,424,414, licenciados exclusivamente por Public Key Partners; 
  a cifra de criptografia IDEA(tm) descrita no n&uacute;mero de patente nos EUA 
  5,214,703, licenciados da Ascom Tech AG; e da Northern Telecom Ltd., Algoritmo 
  de Codifica&ccedil;&atilde;o CAST, licenciado da Northern Telecom, Ltd. IDEA 
  &eacute; marca da Ascom Tech AG. Network Associates Inc. pode ter aplicativos 
  com patentes e/ou patentes pendentes cobrindo o assunto neste software ou sua 
  documenta&ccedil;&atilde;o; o fornecimento deste software ou documenta&ccedil;&atilde;o 
  n&atilde;o lhe d&aacute; nenhuma licen&ccedil;a &agrave; estas patentes. O c&oacute;digo 
  de compress&atilde;o em PGP &eacute; por Mark Adler e Jean-Loup Gailly, usados 
  com permiss&atilde;o da implementa&ccedil;&atilde;o gratuita Info-ZIP. Software 
  LDAP provido cortesia da University of Michigan em Ann Arbor, Copyright © 1992-1996 
  Regentes da University of Michigan. Todos os direitos reservados. Este produto 
  inclui software desenvolvido pelo Apache Group para uso no projeto do servidor 
  HTTP Apache (http://www.apache.org/). Copyright © 1995-1997 The Apache Group. 
  Todos os direitos reservados. Veja arquivos texto inclu&iacute;dos com o software 
  ou o site web de PGP para maiores informa&ccedil;&otilde;es. Este software &eacute; 
  baseado em parte no trabalho do Independent JPEG Group. Fonte TEMPEST cortesia 
  de Ross Anderson e Marcus Kuhn.</p>
<p>O software provido com esta documentação é autorizado a você para seu uso individual 
  sob a condição do Acordo de Licen&ccedil;a ao Usuário Final e Garantia Limitada 
  provida com o software. As informaç&otilde;es neste documento est&atilde;o sujeitas 
  &agrave; mudanças sem advertência. Network Associates Inc. não garante que a 
  informação adeque-se &agrave; seus requerimentos ou que a informação está livre 
  de erros. A informação pode incluir inexatidões técnicas ou erros tipográficos. 
  Altera&ccedil;&otilde;es podem ser feitas às informaç&otilde;es e podem ser 
  incorporadas em novas edições deste documento, se e quando disponibilizado pela 
  Network Associates Inc.</p>
<p>Exporta&ccedil;&atilde;o deste software e documenta&ccedil;&atilde;o podem 
  estar sujeitas ao acordo com as regras e regulamenta&ccedil;&otilde;es promulgadas 
  de tempos em tempos pelo Bureau of Export Administration, United States Department 
  of Commerce, que restringe a exporta&ccedil;&atilde;o e reexporta&ccedil;&atilde;o 
  de certos produtos e dados t&eacute;cnicos.</p>
<table width="75%" border="0" align="center">
  <tr> 
    <td>Network Associates, Inc.</td>
    <td>(408) 988-3832 principal</td>
  </tr>
  <tr> 
    <td>3965 Freedom Circle</td>
    <td>(408) 970-9727 fax</td>
  </tr>
  <tr> 
    <td>Santa Clara, CA 95054</td>
    <td>http://www.nai.com<br>
      info@nai.com</td>
  </tr>
</table>
<p>* &eacute; &agrave;s vezes utilizado ao inv&eacute;s do &reg; para marcas registradas 
  para proteger marcas registradas fora dos EUA.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p align="center"> GARANTIA LIMITADA</p>
<p><u>Garantia Limitada.</u> Network Associates, Inc. garante que o Produto de 
  Software executará substancialmente conforme os materiais escritos que o acompanham 
  para um período de sessenta (60) dias da data de compra original. Para a extensão 
  permitida por lei aplicável, garantias impl&iacute;citas no Produto de Software, 
  se existirem, s&atilde;o limitadas a um período de sessenta (60) dias. Alguns 
  jurisdições não permitem limitações em duração de uma garantia implícita, assim 
  a limitação anterior pode não se aplicar a você.</p>
<p><u>Remedia&ccedil;&atilde;o ao Consumidor.</u> A total obriga&ccedil;&atilde;o 
  da Network Associates, Inc e seus provedores e seu remédio exclusivo será, sob 
  op&ccedil;&atilde;o da Network Associates, Inc, ou (a) retorno do valor de compra 
  pago pela licença, se houve ou (b) conserto ou substituição do Produto de Software 
  que n&atilde;o satisfa&ccedil;a a garantia limitada da Network Associates, Inc 
  e que ser&aacute; devolvido a seu custo para a Network Associates, Inc com uma 
  cópia de seu recibo. Esta garantia limitada é nula se a falha do Produto de 
  Software foi resultado de acidente, abuso, ou m&aacute; aplica&ccedil;&atilde;o. 
  Qualquer Produto de Software consertado ou substitu&iacute;do será garantido 
  para o resto do per&iacute;odo da garantia original ou trinta (30) dias, o que 
  for mais longo. Fora dos Estados Unidos, nenhum estes remédios nem qualquer 
  servi&ccedil;o de suporte ao produto oferecidos por Network Associates, Inc 
  está disponível sem prova de compra de uma fonte autorizada internacional e 
  pode não estar disponível pela Network Associates, Inc para a extensão &agrave; 
  que eles est&atilde;o sujeitos &agrave;s restrições sob as leis de controle 
  de exporta&ccedil;&atilde;o dos EUA e regulamentos.</p>
<p>NENHUMA OUTRA GARANTIA. PARA A M&Aacute;XIMA EXTENSÃO PERMITIDA POR LEI APLICÁVEL, 
  E COM EXCE&Ccedil;&Atilde;O DAS GARANTIAS LIMITADAS ADIANTE, O SOFTWARE E DOCUMENTAÇÃO 
  &Eacute; PROVIDO &quot;COMO É&quot; E A NETWORK ASSOCIATES, INC. E SEUS PROVEDORES 
  NEGAM TODAS AS OUTRAS GARANTIAS E CONDIÇÕES, EXPRESSAS OU IMPLÍCITAS, INCLUINDO, 
  MAS N&Atilde;O LIMITADAS A, GARANTIAS IMPLÍCITAS DE MERCABILIDADE, APTIDÃO PARA 
  UM PROP&Oacute;SITO PARTICULAR, CONFORM&Acirc;NCIA COM A DESCRIÇÃO, TÍTULO E 
  N&Atilde;O-INFRAÇÃO DE DIREITOS DE TERCEIROS, E A PROVISÃO OU FALHA DE PROVER 
  SERVIÇOS DE SUPORTE. ESTA GARANTIA LIMITADA LHE DÁ DIREITOS LEGAIS ESPECÍFICOS. 
  VOCÊ PODE TER OUTROS, QUE VARIAM DE JURISDIÇÃO A JURISDIÇÃO.</p>
<p>LIMITAÇÃO DE OBRIGAÇÃO. PARA A EXTENSÃO MÁXIMA PERMITIDA POR LEI APLICÁVEL, 
  EM NENHUM EVENTO DEVE NETWORK ASSOCIATES, INC. OU SEUS PROVEDORES ESTAREM SUJEITOS 
  A QUALQUER DANO INDIRETO, INCIDENTAL, CONSEQÜENTE, ESPECIAL OU EXEMPLAR OU PERDA 
  DE LUCROS SEJA QUAIS FOREM (INCLUINDO, SEM LIMITAÇÃO, DANOS POR PERDA DE LUCROS 
  EMPRESARIAIS, INTERRUPÇÃO EMPRESARIAL, PERDA DE INFORMAÇÃO EMPRESARIAL, OU QUALQUER 
  OUTRA PERDA PECUNIÁRIA) SURGINDO DO USO OU INABILIDADE DE USO DO PRODUTO DE 
  SOFTWARE OU A FALHA EM PROVER SERVIÇOS DE SUPORTE, ATÉ MESMO SE NETWORK ASSOCIATES, 
  INC. FOI ACONSELHADA DA POSSIBILIDADE DE TAIS DANOS. EM QUALQUER CASO, AS INTEIRAS 
  OBRIGAÇ&Otilde;ES CUMULATIVAS DA NETWORK ASSOCIATES, INC. PARA VOCÊ OU QUALQUER 
  OUTRA PARTE POR QUALQUER PERDA OU DANO RESULTANDO DE QUALQUER REIVINDICAÇÃO, 
  DEMANDAS OU AÇÕES QUE SURGIREM DE, OU RELATIVO A ESTE ACORDO N&Atilde;O EXCEDER&Atilde;O 
  O PREÇO DE COMPRA PAGO POR ESTA LICENÇA. COMO ALGUMAS JURISDIÇÕES N&Atilde;O 
  PERMITEM A EXCLUSÃO OU LIMITAÇÃO DE OBRIGAÇÃO, AS LIMITAÇÕES MENCIONADAS ACIMA 
  PODEM N&Atilde;O SE APLICAR A VOCÊ.</p>
</body>
</html>
