<html>
<head>
<title>Pref&aacute;cio</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style></head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Pref&aacute;cio</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>PGP é parte da caixa de ferramentas de segurança de sua organização por proteger 
    um de seus recursos mais importantes: <i>informação</i>. Corporações tradicionalmente 
    colocam fechaduras em suas portas e gabinetes de arquivo, e exigem dos empregados 
    que mostrem identificação para provar que eles possuem acesso a vários locais 
    da empresa. PGP é uma valiosa ferramenta para lhe ajudar a proteger a segurança 
    e integridade dos dados e mensagens da sua organização. Para muitas companhias, 
    a perda de confidencialidade significa perda de negócios. </p>
  <p>Livros inteiros foram escritos sobre o assunto de implementa&ccedil;&atilde;o 
    de segurança em rede. O enfoque deste guia está em implementar PGP como uma 
    ferramenta dentro de sua estrutura de segurança de rede. PGP é meramente uma 
    parte de um sistema de segurança, mas é uma parte extremamente importante. 
    PGP provê codifica&ccedil;&atilde;o, que protege os dados dos olhos de qualquer 
    um a quem não se intencionam, mesmo para aqueles que podem ver os dados codificados. 
    Isto protege a informação de estranhos internos e externos.</p>
  <p>Este guia descreve como usar PGP<sup>&reg;</sup> para Windows 95, 98, e NT. 
    PGP tem muitas características novas, que são descritas no <a href="1%20-%20Introduzindo%20PGP.htm">Capítulo 
    1, &quot;Introduzindo PGP&quot;</a>.</p>
  <p>Se você é novo &agrave; criptografia e gostaria de uma introdução &agrave; 
    terminologia e conceitos que você encontrará enquanto estiver usando PGP, 
    veja &quot;Uma Introdução &agrave; Criptografia&quot;.</p>
</blockquote>
<p>&nbsp;</p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="contactar"></a>Como 
  contactar a Network Associates</b></font></p>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Servi&ccedil;o 
  ao Consumidor</font></b></p>
<blockquote>
  <p>Para ordenar produtos ou obter informa&ccedil;&otilde;es sobre produtos, 
    contate o departamento Customer Care da Network Associates em (408) 988-3832 
    (telefone dos EUA) ou escreva para o seguinte endere&ccedil;o:</p>
  <p>Network Associates, Inc.<br>
    McCandless Towers<br>
    3965 Freedom Circle<br>
    Santa Clara, CA 95054-1203<br>
    U.S.A.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Suporte 
  T&eacute;cnico</font></b></p>
<blockquote>
  <p>Network Associates &eacute; famosa por sua dedica&ccedil;&atilde;o &agrave; 
    satisfa&ccedil;&atilde;o do consumidor. N&oacute;s continuamos esta tradi&ccedil;&atilde;o 
    fazendo de nosso site na World Wide Web um recurso de valor para respostas 
    &agrave;s quest&otilde;es de suporte t&eacute;cnico. Encorajamos voc&ecirc; 
    a fazer desta a sua primeira parada por respostas &agrave; perguntas freq&uuml;entemente 
    feitas, para atualiza&ccedil;&otilde;es de software da Network Associates, 
    e para acesso &agrave;s not&iacute;cias e informa&ccedil;&otilde;es de codifica&ccedil;&atilde;o 
    da Network Associates.</p>
</blockquote>
<table width="41%" border="0" align="center">
  <tr> 
    <td><font size="2" face="Arial, Helvetica, sans-serif"><b>World Wide Web</b></font></td>
    <td> 
      <div align="right"><font size="2" face="Arial, Helvetica, sans-serif"><b>http://www.nai.com</b></font></div>
    </td>
  </tr>
</table>
<blockquote>
  <p>Suporte T&eacute;cnico para seu produto PGP tamb&eacute;m est&aacute; dispon&iacute;vel 
    atrav&eacute;s destes canais:</p>
</blockquote>
<table width="45%" border="0" align="center">
  <tr> 
    <td width="47%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Telefone 
      (EUA):</b></font></td>
    <td width="53%"> <font size="2"><b>(408) 988-3832</b></font></td>
  </tr>
  <tr> 
    <td width="47%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Email</b></font></td>
    <td width="53%"> <font size="2" face="Arial, Helvetica, sans-serif"><b>PGPSupport@pgp.com</b></font></td>
  </tr>
</table>
<blockquote>
  <p>Se os servi&ccedil;os automatizados n&atilde;o tiverem as respostas que voc&ecirc; 
    precisa, contacte a Network Associates em um dos seguintes n&uacute;meros 
    entre segunda-feira e sexta-feira entre 6h00m e 18h00m (hor&aacute;rio do 
    Pac&iacute;fico).</p>
</blockquote>
<table width="45%" border="0" align="center">
  <tr> 
    <td width="47%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Telefone 
      (EUA):</b></font></td>
    <td width="53%"> <font size="2" face="Arial, Helvetica, sans-serif"><b>(408) 
      988-3832</b></font></td>
  </tr>
</table>
<blockquote>
  <p>Para prover as respostas que voc&ecirc; precisa r&aacute;pida e eficientemente, 
    a equipe de suporte t&eacute;cnico da Network Associates precisa de algumas 
    informa&ccedil;&otilde;es sobre seu computador e todos seus software. Por 
    favor tenha esta informa&ccedil;&atilde;o pronta antes de sua chamada:</p>
  <ul>
    <li>Nome do produto e n&uacute;mero de vers&atilde;o<br>
      <br>
    </li>
    <li>Marca e modelo do computador<br>
      <br>
    </li>
    <li>Quaisquer hardwares ou perif&eacute;ricos adicionais conectados a seu 
      computador<br>
      <br>
    </li>
    <li>Tipo de sistema operacional e n&uacute;meros de vers&atilde;o<br>
      <br>
    </li>
    <li>Tipo de rede e vers&atilde;o, se aplic&aacute;vel<br>
      <br>
    </li>
    <li>Conte&uacute;do de quaisquer mensagens de status ou erro exibidos na tela 
      ou que apare&ccedil;am em um arquivo de log (registro). Nem todos os produtos 
      produzem arquivos de log.<br>
      <br>
    </li>
    <li>Aplicativo de email e vers&atilde;o (se o problema envolve o uso de PGP 
      com um produto de email, por exemplo, o plug-in para Eudora)<br>
      <br>
    </li>
    <li>Passos espec&iacute;ficos para reproduzir o problema</li>
  </ul>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Treinamento 
  na Network Associates</font></b></p>
<blockquote> 
  <p>Para informa&ccedil;&otilde;es sobre agendamento de treinamentos &quot;on-site&quot; 
    para qualquer produto Network Associates, ligue (800) 338-8754 (telefone nos 
    EUA).</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Coment&aacute;rios 
  e <i>feedback</i></font></b></p>
<blockquote>
  <p>Network Associates aprecia seus coment&aacute;rios e <i>feedback</i>, mas 
    n&atilde;o possui nenhuma obriga&ccedil;&atilde;o a voc&ecirc; pelas informa&ccedil;&otilde;es 
    que voc&ecirc; enviar. Por favor enderece seus coment&aacute;rios sobre a 
    documenta&ccedil;&atilde;o de PGP para: Network Associates, Inc., 3965 Freedom 
    Circle Santa Clara, CA 95054-1203 U.S.A.. Voc&ecirc; tamb&eacute;m pode enviar 
    coment&aacute;rios via e-mail para tns_documentation@nai.com.</p>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="leituras_recomendadas"></a>Leituras 
  recomendadas</b></font></p>
<blockquote> 
  <p> <b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Livros 
    n&atilde;o-t&eacute;cnicos e iniciantes</font></b></p>
  <ul>
    <li> Whitfield Diffie and Susan Eva Landau, &quot;Privacy on the Line,&quot; 
      MIT Press; ISBN: 0262041677<br>
      Este livro é uma discussão da história e política envolvendo criptografia 
      e segurança de comunicações. É uma excelente leitura, até mesmo para os 
      iniciantes e pessoas n&atilde;o-técnicas, mas com informação que mesmo muitos 
      peritos não conhecem.<br>
      <br>
    </li>
    <li>David Kahn, &quot;The Codebreakers&quot; Scribner; ISBN: 0684831309<br>
      Este livro é uma história de códigos e quebradores de códigos desde os tempo 
      dos egípcios at&eacute; o fim da Segunda Guerra Mundial. Kahn come&ccedil;ou 
      a escrever este livro nos anos sessenta, e há uma edição revisada publicada 
      em 1996. Este livro não lhe ensinará tudo sobre como &eacute; feita a criptografia, 
      mas foi a inspiração de toda uma nova geração de criptógrafos.<br>
      <br>
    </li>
    <li>Charlie Kaufman, Radia Perlman, and Mike Spencer, &quot;Network Security: 
      Private Communication in a Public World,&quot; Prentice Hall; ISBN: 0-13-061466-1<br>
      Esta é uma boa descrição de sistemas de segurança de rede e protocolos, 
      incluindo descrições do que funciona, o que não funciona, e por qu&ecirc;. 
      Publicado em 1995, portanto não possui muitos dos mais recentes avanços, 
      mas ainda é um livro bom. Também contém um das descrições mais claras de 
      como funciona o DES de qualquer livro escrito.</li>
  </ul>
  <p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Livros 
    Intermedi&aacute;rios</font></b><br>
  </p>
  <ul>
    <li>Bruce Schneier, &quot;Applied Cryptography: Protocols, Algorithms, and 
      Source Code in C,&quot; John Wiley &amp; Sons; ISBN: 0-471-12845-7<br>
      Este é um bom livro técnico introdut&oacute;rio sobre como funcionam muitos 
      trabalhos de criptografia. Se você quer se tornar um perito, este é o lugar 
      para começar.<br>
      <br>
    </li>
    <li>Alfred J. Menezes, Paul C. van Oorschot, and Scott Vanstone, &quot;Handbook 
      of Applied Cryptography,&quot; CRC Press; ISBN: 0-8493-8523-7<br>
      Este é o livro técnico que você deveria adquirir depois do livro de Schneier. 
      Há muita matemática pesada neste livro, mas entretanto é utilizável para 
      quem não entende a matemática.<br>
      <br>
    </li>
    <li>Richard E. Smith, &quot;Internet Cryptography,&quot; Addison-Wesley Pub 
      Co; ISBN: 020192480<br>
      Este livro descreve v&aacute;rios protocolos de seguran&ccedil;a da Internet. 
      Mais importante, descreve como sistemas que são bem projetados acabam com 
      falhas por causa de operaç&otilde;es descuidadas. Este livro &eacute; leve 
      na matemática, e pesado em informação prática.<br>
      <br>
    </li>
    <li>William R. Cheswick and Steven M. Bellovin, &quot;Firewalls and Internet 
      Security: Repelling the Wily Hacker&quot; Addison-Wesley Pub Co; ISBN: 0201633574<br>
      Este livro é escrito por dois pesquisadores sênior na AT&T Bell Labs, sobre 
      suas experiências mantendo e reprojetando a conexão Internet da AT&T. Muito 
      legível.</li>
  </ul>
  <p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Livros 
    Avan&ccedil;ados</font></b><br>
  </p>
  <ul>
    <li> Neal Koblitz, &quot;A Course in Number Theory and Cryptography&quot; 
      Springer-Verlag; ISBN: 0-387-94293-9<br>
      Um excelente livro de ensino de matemática a n&iacute;vel de gradua&ccedil;&atilde;o, 
      em teoria dos números e criptografia.<br>
      <br>
    </li>
    <li>Eli Biham and Adi Shamir, &quot;Differential Cryptanalysis of the Data 
      Encryption Standard,&quot; Springer-Verlag; ISBN: 0-387-97930-1<br>
      Este livro descreve a técnica da criptoan&aacute;lise diferencial como aplicado 
      ao DES. É um excelente livro para se aprender sobre esta técnica.</li>
  </ul>
</blockquote>
</body>
</html>
