<html>
<head>
<title>Introduzindo PGP</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style></head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Introduzindo 
        PGP</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>1</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Bem vindo a PGP. Com PGP, voc&ecirc; pode f&aacute;cil e seguramente proteger 
    a privacidade de seus dados codificando-os, de forma que apenas os indiv&iacute;duos 
    a quem eles se intencionam possam l&ecirc;-los. Voc&ecirc; tamb&eacute;m pode 
    assinar informa&ccedil;&otilde;es digitalmente, o que certifica sua autenticidade.</p>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="novo"></a>O 
  que h&aacute; de novo em PGP vers&atilde;o 6.0</b></font></p>
<blockquote> 
  <p>Esta vers&atilde;o de PGP inclui estes novos recursos:</p>
  <ul>
    <li><b>Secure Viewer (Visualizador Seguro)</b>: o &quot;Secure Viewer&quot; 
      &eacute; a solu&ccedil;&atilde;o por software de PGP para proteger as informa&ccedil;&otilde;es 
      privadas na sua tela do computador de serem interceptadas atrav&eacute;s 
      de radia&ccedil;&atilde;o eletromagn&eacute;tica - tamb&eacute;m conhecido 
      como &quot;ataques TEMPEST&quot;. &Eacute; amplamente conhecido que espi&otilde;es, 
      com equipamentos especiais, podem capturar e reconstruir conte&uacute;do 
      de telas de v&iacute;deo atrav&eacute;s da radia&ccedil;&atilde;o de freq&uuml;&ecirc;ncias 
      de r&aacute;dio. Quando texto &eacute; codificado com a op&ccedil;&atilde;o 
      Visualizador Seguro habilitada, o texto decifrado &eacute; exibido em uma 
      fonte e janela especiais que previne ataques TEMPEST, ileg&iacute;veis por 
      equipamentos de captura de radia&ccedil;&otilde;es. O recurso &quot;Secure 
      Viewer&quot; permite que voc&ecirc; veja com seguran&ccedil;a seu texto 
      decifrado.<br>
      <br>
    </li>
    <li><b>Funcionalidade PGPdisk</b>. A funcionalidade PGPdisk est&aacute; embutida 
      em PGP vers&atilde;o 6.0. PGPdisk &eacute; uma aplica&ccedil;&atilde;o de 
      codifica&ccedil;&atilde;o f&aacute;cil de usar que permite que voc&ecirc; 
      disponibilize uma &aacute;rea de espa&ccedil;o de disco para armazenar seus 
      dados sens&iacute;veis.<br>
      <br>
    </li>
    <li><b>Revogadores Designados</b>. Voc&ecirc; agora pode especificar que outra 
      chave p&uacute;blica em seu chaveiro pode revogar sua chave. Isto pode ser 
      &uacute;til em situa&ccedil;&otilde;es onde voc&ecirc; tem medo de perder 
      sua chave privada, esquecer sua frase-senha, ou em casos extremos como incapacidade 
      f&iacute;sica de usar a chave. Em tais casos, a pessoa que voc&ecirc; designar 
      poder&aacute; revogar sua chave, envi&aacute;-la ao servidor, e ser&aacute; 
      como se voc&ecirc; tivesse revogado voc&ecirc; mesmo.<br>
      <br>
    </li>
    <li><b>&quot;Plug-ins&quot; Adicionais</b>. Plug-ins de email para Outlook 
      Express e Outlook 98 est&atilde;o inclu&iacute;dos. Um plugin para Groupwise 
      est&aacute; dispon&iacute;vel separadamente.<br>
      <br>
    </li>
    <li><b>Photographic User ID (Identifica&ccedil;&atilde;o Fotogr&aacute;fica 
      de Usu&aacute;rio)</b>. Voc&ecirc; pode adicionar sua fotografia em sua 
      chave p&uacute;blica. IDs fotogr&aacute;ficos podem ser assinados como qualquer 
      ID de usu&aacute;rio, para prover informa&ccedil;&otilde;es extras quando 
      verificando a chave.<br>
      <br>
    </li>
    <li><b>Comunica&ccedil;&otilde;es Seguras com o PGP Certificate Server 2.0</b>. 
      PGP prov&ecirc; uma conex&atilde;o segura quando qualquer pedido &eacute; 
      enviado ao servidor. Esta conex&atilde;o segura previne qualquer an&aacute;lise 
      de tr&aacute;fego que possa determinar as chaves que voc&ecirc; est&aacute; 
      obtendo de ou enviando para o servidor.<br>
      <br>
    </li>
    <li><b>Apagamento Seguro usando PGP Certificate Server</b>. Voc&ecirc; pode 
      apagar ou incapacitar sua pr&oacute;pria chave no servidor, bastando se 
      autenticar via Transport Layer Security (TLS).<br>
      <br>
    </li>
    <li><b>Barra de Ferramentas PGPkeys</b>. Uma barra de ferramentas de &iacute;cones 
      foi adicionada a PGPkeys para facilitar o acesso &agrave;s fun&ccedil;&otilde;es 
      de administra&ccedil;&atilde;o de chaves mais freq&uuml;entemente usadas.<br>
      <br>
    </li>
    <li><b>Destinat&aacute;rio Desconhecido ou Procura no Servidor pelo Assinante</b>. 
      Quando decifrando ou verificando uma mensagem, voc&ecirc; pode automaticamente 
      executar uma procura no servidor por todas as chaves para a qual a mensagem 
      foi codificada ou assinada, para determinar a identidade das mesmas.<br>
      <br>
    </li>
    <li><b>Administra&ccedil;&atilde;o de Subchaves</b> (apenas Diffie-Hellman/DSS). 
      Com a caracter&iacute;stica de administra&ccedil;&atilde;o de subchaves, 
      voc&ecirc; pode administrar suas chaves para codifica&ccedil;&atilde;o (DH) 
      e assinatura (DSS) separadamente.<br>
      <br>
    </li>
    <li><b>Assinatura de Reverifica&ccedil;&atilde;o</b>. As assinaturas colecionadas 
      em chaves s&atilde;o automaticamente verificadas quando adicionadas a seu 
      chaveiro. &Eacute; poss&iacute;vel, entretanto, seja por corrup&ccedil;&atilde;o 
      de dados ou altera&ccedil;&otilde;es maliciosas, que assinaturas inv&aacute;lidas 
      possam existir. Esta nova caracter&iacute;stica permite que voc&ecirc; re-verifique 
      as assinaturas, para assegurar-se de que elas s&atilde;o v&aacute;lidas.<br>
      <br>
    </li>
    <li><b>Assinatura com Expira&ccedil;&atilde;o</b>. Voc&ecirc; pode criar assinaturas 
      em outras chaves que v&atilde;o expirar depois de uma determinada data.<br>
      <br>
    </li>
    <li><b>Interface Aperfei&ccedil;oada</b>. Uma barra de ferramentas intuitiva 
      foi acrescentada a PGPkeys, para facilitar o acesso &agrave;s fun&ccedil;&otilde;es 
      de administra&ccedil;&atilde;o de chaves mais freq&uuml;entemente usadas.<br>
      <br>
    </li>
    <li><b>Melhor Integra&ccedil;&atilde;o do Aplicativo</b>. PGPtray permite 
      codificar, decifrar, assinar e verificar no pr&oacute;prio local e com a 
      maioria dos aplicativos, sem necessidade expl&iacute;cita do usu&aacute;rio 
      copiar e colar.<br>
      <br>
    </li>
    <li><b>Elimina&ccedil;&atilde;o (&quot;Wiping&quot;) de Espa&ccedil;o Livre</b>. 
      PGPtools agora pode eliminar todo o espa&ccedil;o livre em seus discos.<br>
      <br>
    </li>
    <li><b>Elimina&ccedil;&atilde;o Aperfei&ccedil;oada</b>. Tanto a elimina&ccedil;&atilde;o 
      de arquivos quanto volumes agora usam um conjunto significativamente melhorado 
      de padr&otilde;es para m&uacute;ltiplas elimina&ccedil;&otilde;es, especialmente 
      ajustados para os tipos de m&iacute;dias usados pelos computadores de hoje.<br>
      <br>
    </li>
    <li><b>Key Splitting (Divis&atilde;o de Chave)</b>. Qualquer chave privada 
      de alta seguran&ccedil;a pode ser dividida em m&uacute;ltiplas partes entre 
      v&aacute;rios &quot;propriet&aacute;rios&quot; usando um processo criptogr&aacute;fico 
      conhecido como &quot;Blakely-Shamir splitting&quot;.<br>
      <br>
    </li>
    <li><b>PGPdisk ADK</b>. Uma chave adicional de decodifica&ccedil;&atilde;o 
      (&quot;Additional Decryption Key&quot;, ADK) pode ser especificada para 
      acesso a todos os novos PGPdisks, criados com uma configura&ccedil;&atilde;o
      &quot;instala&ccedil;&atilde;o cliente&quot; de PGP. Isto utiliza um novo 
      suporte a chaves p&uacute;blicas em PGPdisk.</li>
  </ul>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Novos recursos 
    de PGPdisk</b></font></p>
  <ul>
    <li><b>Suporte &agrave; Chaves P&uacute;blicas</b>. Uma chave p&uacute;blica 
      ou m&uacute;ltiplas chaves p&uacute;blicas agora podem ser configuradas 
      para abrir um PGPdisk. Este suporte est&aacute; integrado a PGP 6.0 e seus 
      chaveiros. Por exemplo, se Bob quer dar &agrave; sua esposa Mary acesso 
      a seu PGPdisk, ele pode dar acesso a Mary adicionando a chave p&uacute;blica 
      dela ao PGPdisk. A chave para o disco ser&aacute; codificada para a chave 
      de Mary.<br>
      <br>
    </li>
    <li><b>Novo Assistente de Disco (&quot;Disk Wizard&quot;)</b>. O processo 
      de se criar um PGPdisk foi simplificado gra&ccedil;as ao novo Assistente 
      de Disco, que ir&aacute; gui&aacute;-lo atrav&eacute;s do processo passo 
      a passo.<br>
      <br>
    </li>
    <li><b>Suporte a Windows NT</b>. PGPdisk agora executa em Windows NT 4.0 al&eacute;m 
      de Windows 95, 98, e MacOS.</li>
  </ul>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="usando_pgp"></a>Usando 
  PGP</b></font></p>
<blockquote> 
  <p>PGP é um aplicativo de segurança que permite que voc&ecirc; e seus colegas 
    de trabalho troquem ou armazenem informaç&otilde;es de forma segura, de modo 
    que ninguém mais possa l&ecirc;-las.</p>
  <p>Um dos modos mais convenientes de usar PGP &eacute; atrav&eacute;s de um 
    dos aplicativos populares de email suportados pelos plug-ins de PGP. Com estes 
    plug-ins, você pode codificar e assinar e também decifrar e verificar suas 
    mensagens, enquanto você está escrevendo e lendo seu email, com o simples 
    apertar de um botão.</p>
  <p>Se você está usando um aplicativo de email que não é suportado pelos plug-ins, 
    você pode facilmente codificar o texto da mensagem usando PGPtray. Além disso, 
    se você precisar codificar ou decifrar arquivos anexados, você pode faz&ecirc;-lo 
    diretamente atrav&eacute;s da &Aacute;rea de Transfer&ecirc;ncia (&quot;Clipboard&quot;) 
    de Windows, escolhendo a opção de menu apropriada. Você também pode usar PGP 
    para codificar e assinar arquivos no disco rígido de seu computador para armazenamento 
    seguro, eliminar arquivos com seguran&ccedil;a de seu disco rígido, e eliminar 
    o espaço livre em disco, de forma que dados sensíveis não possam ser recuperados 
    com softwares de recuperação de disco.</p>
</blockquote>
<p><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif"><b>Uma r&aacute;pida 
  vis&atilde;o geral</b></font></p>
<blockquote> 
  <p>PGP est&aacute; baseado em uma tecnologia de criptografia amplamente conhecida, 
    conhecida como <i>criptografia por chave p&uacute;blica</i>, onde duas chaves 
    complementares, chamadas de <i>par de chaves</i>, s&atilde;o usadas para manter 
    comunica&ccedil;&otilde;es seguras. Uma das chaves &eacute; designada como 
    uma <i>chave privada</i>, a qual s&oacute; voc&ecirc; tem acesso, e a outra 
    &eacute; uma <i>chave p&uacute;blica</i> que voc&ecirc; pode trocar livremente 
    com outros usu&aacute;rios de PGP. Tanto a chave privada quanto a p&uacute;blica 
    s&atilde;o armazenadas em arquivos de &quot;chaveiro&quot;, que s&atilde;o 
    acess&iacute;vel pela janela de PGPkeys. &Eacute; desta janela que voc&ecirc; 
    executa todas as fun&ccedil;&otilde;es de administra&ccedil;&atilde;o das 
    chaves. </p>
  <p> Para uma vis&atilde;o mas aprofundada da tecnologia de criptografia de PGP, 
    veja &quot;<i>Uma Introdu&ccedil;&atilde;o &agrave; Criptografia</i>&quot;, 
    que est&aacute; inclu&iacute;da com o produto.</p>
</blockquote>
<p><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Passos 
  B&aacute;sicos para usar PGP</b></font></p>
<blockquote> 
  <p>Esta se&ccedil;&atilde;o d&aacute; uma r&aacute;pida olhada nos procedimentos 
    que voc&ecirc; normalmente segue no uso de PGP. Para detalhes sobre quaisquer 
    destes procedimentos, veja os cap&iacute;tulos apropriados neste livro.</p>
  <ol>
    <li>Instale PGP em seu computador. Veja o <i>Guia de Instala&ccedil;&atilde;o 
      de PGP</i> inclu&iacute;do com o produto para instru&ccedil;&otilde;es completas 
      de instala&ccedil;&atilde;o.<br>
      <br>
    </li>
    <li>Crie um par de chaves, privada e p&uacute;blica.<br>
      <br>
      Antes de voc&ecirc; possa come&ccedil;ar a usar PGP, voc&ecirc; precisa 
      gerar um par de chaves. Um par de chaves PGP &eacute; composto de uma chave 
      privada, a qual s&oacute; voc&ecirc; tem acesso, e uma chave p&uacute;blica, 
      que voc&ecirc; pode copiar e disponibilizar livremente a todos com quem 
      voc&ecirc; troca informa&ccedil;&otilde;es.<br>
      <br>
      Voc&ecirc; tem a op&ccedil;&atilde;o de criar um novo par de chaves imediatamente 
      ap&oacute;s terminar a instala&ccedil;&atilde;o de PGP, ou voc&ecirc; pode 
      faz&ecirc;-lo a qualquer hora abrindo o programa PGPkeys.<br>
      <br>
      Para mais informa&ccedil;&otilde;es sobre como criar um par de chaves privado 
      e p&uacute;blico, veja <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#criando_par_chaves">&quot;Criando 
      um par de chaves&quot; na p&aacute;gina 32.</a><br>
      <br>
    </li>
    <li>Troque chaves p&uacute;blicas com outros.<br>
      <br>
      Depois que voc&ecirc; criou um par de chaves, voc&ecirc; pode come&ccedil;ar 
      a corresponder-se com outros usu&aacute;rios de PGP. Voc&ecirc; precisar&aacute; 
      de uma c&oacute;pia da chave p&uacute;blica deles e eles precisar&atilde;o 
      da sua. Sua chave p&uacute;blica &eacute; apenas um bloco de texto, portanto 
      &eacute; bastante f&aacute;cil trocar chaves com algu&eacute;m. Voc&ecirc; 
      pode incluir sua chave p&uacute;blica em uma mensagem de email, copi&aacute;-la 
      para um arquivo, ou post&aacute;-la em um servidor p&uacute;blico ou privado 
      de chaves, onde qualquer um pode adquirir uma c&oacute;pia quando eles precisarem.<br>
      <br>
      Para mais informa&ccedil;&otilde;es sobre como trocar chaves p&uacute;blicas, 
      veja <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#distribuindo_chave_publica">&quot;Distribuindo 
      sua chave p&uacute;blica&quot; na p&aacute;gina 46</a> e <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#obtendo_chaves_publicas_de_outros">&quot;Obtendo 
      as chaves p&uacute;blicas de outros&quot; na p&aacute;gina 50</a>.<br>
      <br>
    </li>
    <li>Valide as chaves p&uacute;blicas.<br>
      <br>
      Uma vez que voc&ecirc; obteve uma c&oacute;pia da chave p&uacute;blica de 
      algu&eacute;m, voc&ecirc; pode adicion&aacute;-la a seu chaveiro p&uacute;blico. 
      Voc&ecirc; deve conferir para ter certeza de que a chave n&atilde;o foi 
      falsificada e que realmente pertence ao dono pretendido. Voc&ecirc; faz 
      isto comparando a &quot;impress&atilde;o digital&quot; &uacute;nica em sua 
      c&oacute;pia da chave p&uacute;blica de algu&eacute;m com a &quot;impress&atilde;o 
      digital&quot; na chave original daquela pessoa. Quando voc&ecirc; tiver 
      certeza de que possui uma chave p&uacute;blica v&aacute;lida, voc&ecirc; 
      a assina para indicar que voc&ecirc; sabe que esta chave &eacute; segura 
      de se usar. Al&eacute;m disso, voc&ecirc; pode conceder ao dono da chave 
      um n&iacute;vel de confian&ccedil;a que indica o quanto voc&ecirc; confia 
      naquela pessoa para atestar a autenticidade da chave p&uacute;blica de outra 
      pessoa.<br>
      <br>
      Para mais informa&ccedil;&otilde;es sobre valida&ccedil;&atilde;o de suas 
      chaves, veja &quot;<a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#verificando_autenticidade">Verificando 
      o autenticidade de uma chave&quot; na p&aacute;gina 52</a>.<br>
      <br>
    </li>
    <li>Codifique e assine seu email e arquivos.<br>
      <br>
      Depois que voc&ecirc; gera seu par de chaves e trocou chaves p&uacute;blicas, 
      voc&ecirc; pode come&ccedil;ar a codificar e assinar mensagens de email 
      e arquivos.<br>
      <br>
      <ul>
        <li> Se voc&ecirc; est&aacute; usando um aplicativo de email suportado pelos plug-ins, voc&ecirc; pode codificar e assinar suas mensagens 
          selecionando as op&ccedil;&otilde;es apropriadas na barra de ferramentas 
          de seu aplicativo.<br>
          <br>
        </li>
        <li>Se seu aplicativo de email n&atilde;o &eacute; suportado pelos plug-ins, 
          voc&ecirc; pode executar as fun&ccedil;&otilde;es apropriadas de PGPtray. 
          Voc&ecirc; tamb&eacute;m pode codificar e assinar arquivos usando PGPtools 
          antes de anex&aacute;-los a seu email. Codific&aacute;-los assegura 
          que s&oacute; voc&ecirc; e seus destinat&aacute;rios, a quem os mesmos 
          intencionam, podem decifrar o conte&uacute;do dos arquivos; assin&aacute;-los 
          assegura que quaisquer altera&ccedil;&otilde;es estar&atilde;o vis&iacute;veis.</li>
      </ul>
      <br>Para mais informa&ccedil;&otilde;es sobre como codificar e assinar informa&ccedil;&otilde;es, 
        veja <a href="4%20-%20Enviando%20e%20Recebendo%20EMail%20Seguro.htm#codificando_e_assinando_email">&quot;Codificando 
        e assinando email&quot; na p&aacute;gina 55</a>.<br><br>
    </li>
    <li>Decifre e verifique seu email e arquivos.<br>
      <br>
      Quando algu&eacute;m envia a voc&ecirc; dados codificados, voc&ecirc; pode 
      decodificar o conte&uacute;do e verificar qualquer assinatura adicionada 
      para ter certeza de que os dados foram originados pelo remetente alegado 
      e que n&atilde;o foram alterados. <br>
      <br>
      <ul>
        <li>Se voc&ecirc; est&aacute; usando um aplicativo de email 
          que suporta os plug-ins, voc&ecirc; pode decifrar e verificar suas mensagens 
          selecionando as op&ccedil;&otilde;es apropriadas na barra de ferramentas 
          de seu aplicativo.<br>
          <br>
        </li>
        <li>Se seu aplicativo de email n&atilde;o &eacute; suportado 
          pelos plug-ins, voc&ecirc; pode copiar a mensagem para a &Aacute;rea 
          de Transfer&ecirc;ncia e executar as fun&ccedil;&otilde;es apropriadas 
          de l&aacute;. Se voc&ecirc; quer decifrar e verificar anexos, voc&ecirc; 
          pode fazer isso pela &Aacute;rea de Transfer&ecirc;ncia de Windows. 
          Voc&ecirc; tamb&eacute;m pode decifrar arquivos codificados armazenados 
          em seu computador, e verificar arquivos assinados para assegurar-se 
          de que eles n&atilde;o foram falsificados. </li>
      </ul>
      <br>
      Para mais informa&ccedil;&otilde;es sobre como decifrar e verificar dados, 
      veja <a href="4%20-%20Enviando%20e%20Recebendo%20EMail%20Seguro.htm#decifrando_e_verificando_email">&quot;Decifrando 
      e verificando email&quot; na p&aacute;gina 63</a>.<br>
      <br>
    </li>
    <li>Elimine arquivos.<br>
      <br>
      Quando voc&ecirc; precisa apagar um arquivo permanentemente, voc&ecirc; 
      pode usar o recurso de Elimina&ccedil;&atilde;o (&quot;Wipe&quot;) para 
      assegurar-se de que o arquivo fique irrecuper&aacute;vel. O arquivo &eacute; 
      imediatamente sobrescrito, de forma que n&atilde;o possa ser recuperado 
      usando softwares de recupera&ccedil;&atilde;o de disco.<br>
      <br>
      Para mais informa&ccedil;&otilde;es sobre elimina&ccedil;&atilde;o de arquivos, 
      veja <a href="5%20-%20Usando%20PGP%20para%20Armazenamento%20Seguro%20de%20Dados.htm#usando_PGPWipe_para_apagar_arquivos">&quot;Usando 
      PGP Wipe para apagar arquivos&quot; na p&aacute;gina 77</a>.</li>
  </ol>
</blockquote>
</body>
</html>
