<html>
<head>
<title>Iniciando</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style></head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Iniciando</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>2</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Este cap&iacute;tulo explica como executar PGP e prov&ecirc; uma vis&atilde;o 
    r&aacute;pida dos procedimentos que voc&ecirc; seguir&aacute; regularmente 
    usando o produto. Tamb&eacute;m cont&eacute;m uma tabela com os &iacute;cones 
    usados com PGPkeys. </p>
</blockquote>
<p><br>
</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="executando"></a>Executando 
  PGP</b></font><br>
</p>
<blockquote> 
  <p>PGP trabalha sobre dados gerados por outros aplicativos. Portanto, as fun&ccedil;&otilde;es 
    apropriadas de PGP foram projetadas de forma a estarem imediatamente dispon&iacute;veis 
    a voc&ecirc;, baseadas na tarefa que voc&ecirc; est&aacute; executando em 
    um determinado momento. H&aacute; quatro modos prim&aacute;rios para usar 
    PGP:</p>
  <ul>
    <li>Atrav&eacute;s da bandeja de sistema, ou &quot;system tray&quot; (PGPtray)<br>
      <br>
    </li>
    <li>Atrav&eacute;s dos aplicativos de email suportados (plug-ins PGP de email)<br>
      <br>
    </li>
    <li>Atrav&eacute;s do menu &quot;Arquivo&quot; do Windows Explorer<br>
      <br>
    </li>
    <li>Atrav&eacute;s da barra de ferramentas de PGPtools</li>
  </ul>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Usando 
  PGP pela bandeja de sistema </font></b><br>
</p>
<blockquote> 
  <p>Voc&ecirc; pode ter acesso a muitas das principais fun&ccedil;&otilde;es 
    de PGP clicando o &iacute;cone da fechadura, que normalmente est&aacute; localizado 
    na bandeja de sistema (&quot;system tray&quot;), e escolhendo ent&atilde;o 
    o item de menu apropriado (se voc&ecirc; n&atilde;o achar este &iacute;cone 
    em sua bandeja de sistema, execute PGPtray atrav&eacute;s do menu Iniciar).<br>
  </p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Executando 
  fun&ccedil;&otilde;es de PGP pela &Aacute;rea de Transfer&ecirc;ncia</font></b><br>
</p>
<blockquote> 
  <p>Voc&ecirc; notar&aacute; que muitas das op&ccedil;&otilde;es na bandeja de 
    sistema se referem a fun&ccedil;&otilde;es PGP que voc&ecirc; executa da &Aacute;rea 
    de Transfer&ecirc;ncia de Windows. Se voc&ecirc; est&aacute; usando um aplicativo 
    de email que n&atilde;o &eacute; suportado pelos plug-ins PGP, ou se voc&ecirc; 
    est&aacute; trabalhando com texto gerado por algum outro aplicativo, voc&ecirc; 
    executa sua codifica&ccedil;&atilde;o/decifra&ccedil;&atilde;o e assinatura/verifica&ccedil;&atilde;o 
    pela &Aacute;rea de Transfer&ecirc;ncia de Windows.</p>
  <p>Por exemplo, para codificar ou assinar texto, voc&ecirc; o copia de seu aplicativo 
    para a &Aacute;rea de Transfer&ecirc;ncia, codifica e assina usando a fun&ccedil;&atilde;o 
    PGP apropriada, ent&atilde;o o cola em seu aplicativo antes de 
    envi&aacute;-lo aos destinat&aacute;rios intencionados. Quando voc&ecirc; 
    recebe uma mensagem de email codificada ou assinada, voc&ecirc; simplesmente 
    faz o processo contr&aacute;rio e copia o texto codificado, conhecido como 
    <i>texto cifrado</i>, de seu aplicativo para a &Aacute;rea de Transfer&ecirc;ncia, 
    decifra e verifica as informa&ccedil;&otilde;es, e ent&atilde;o v&ecirc; o 
    conte&uacute;do. Depois que voc&ecirc; viu a mensagem decifrada, voc&ecirc; 
    pode decidir se guarda a informa&ccedil;&atilde;o ou a mant&eacute;m em sua 
    forma codificada.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Abrindo 
  a janela de PGPkeys </font></b><br>
</p>
<blockquote> 
  <p>Quando voc&ecirc; escolhe &quot;Lauch PGPkeys&quot; do menu pop-up de PGP, 
    abre-se a janela de PGPkeys, mostrando os pares de chave privados e p&uacute;blicos 
    que voc&ecirc; criou para voc&ecirc; mesmo, e tamb&eacute;m quaisquer chaves 
    p&uacute;blica de outros usu&aacute;rios que voc&ecirc; adicionou a seu chaveiro 
    p&uacute;blico (se voc&ecirc; n&atilde;o criou um novo par de chaves ainda, 
    o &quot;PGP Key Generation Wizard&quot; o conduzir&aacute; pelos passos necess&aacute;rios. 
    Por&eacute;m, antes de passar pelo processo de criar um novo par de chaves, 
    voc&ecirc; deveria ver o <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm">Cap&iacute;tulo 
    3</a> para detalhes completos sobre as v&aacute;rias op&ccedil;&otilde;es).</p>
  <p>Da janela de PGPkeys voc&ecirc; pode criar novos pares de chaves e pode administrar 
    todas as outras chaves. Por exemplo, &eacute; dali que voc&ecirc; examina 
    os atributos associados a uma chave em particular, especifica o grau de confian&ccedil;a 
    que voc&ecirc; tem que a chave de fato pertence ao dono alegado, e indica 
    o quanto voc&ecirc; confia no dono da chave para atestar a autenticidade das 
    chaves de outros usu&aacute;rios. Para um explica&ccedil;&atilde;o completa 
    das fun&ccedil;&otilde;es de administra&ccedil;&atilde;o de chaves que voc&ecirc; 
    executa da janela de PGPkeys, veja o <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm">Cap&iacute;tulo 
    6</a>.</p>
</blockquote>
<p><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Configurando 
  prefer&ecirc;ncias de PGP</b></font></p>
<blockquote> 
  <p>Quando voc&ecirc; escolhe &quot;PGP Preferences&quot; do menu pop-up de PGP, 
    voc&ecirc; tem acesso &agrave; caixa de di&aacute;logo &quot;PGP Preferences&quot;, 
    na qual voc&ecirc; especifica configura&ccedil;&otilde;es que afetam como 
    o PGP programa fun&ccedil;&otilde;es baseadas em seu ambiente de computa&ccedil;&atilde;o. 
    Clicando a aba apropriada, voc&ecirc; pode avan&ccedil;ar &agrave;s configura&ccedil;&otilde;es 
    de prefer&ecirc;ncia que voc&ecirc; quer modificar. Para uma explica&ccedil;&atilde;o 
    completa destas configura&ccedil;&otilde;es, veja o <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm">Cap&iacute;tulo 
    6</a>.</p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Obtendo 
  Ajuda</font></b></p>
<blockquote> 
  <p>Quando voc&ecirc; escolhe &quot;Help&quot; do menu ou janela de PGP, voc&ecirc; 
    tem acesso ao sistema de ajuda de PGP, o qual prov&ecirc; uma vis&atilde;o 
    geral e instru&ccedil;&otilde;es para todos os procedimentos que voc&ecirc; 
    possivelmente executar&aacute;. Muitas das caixas de di&aacute;logo tamb&eacute;m 
    t&ecirc;m ajuda sens&iacute;vel ao contexto, que voc&ecirc; acessa clicando 
    o ponto de interroga&ccedil;&atilde;o no canto direito da janela e apontando 
    ent&atilde;o &agrave; &aacute;rea de interesse na tela. Uma pequena explica&ccedil;&atilde;o 
    aparece.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Finalizando 
  PGP</font></b></p>
<blockquote> 
  <p>Por padr&atilde;o, o programa PGPtray &eacute; executado sempre que voc&ecirc; 
    inicializa seu computador, como indicado pelo &iacute;cone da fechadura exibido 
    na bandeja do sistema. Se por alguma raz&atilde;o voc&ecirc; precisa finalizar 
    PGPtray, voc&ecirc; pode faz&ecirc;-lo escolhendo &quot;Exit PGPtray&quot; 
    no menu pop-up de PGP.</p>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="suportados"></a>Usando 
  PGP atrav&eacute;s dos aplicativos de email suportados</b></font> </p>
<blockquote> 
  <p> Se voc&ecirc; tem um destes populares aplicativos de email suportados pelos 
    plug-ins de PGP, voc&ecirc; pode acessar as fun&ccedil;&otilde;es necess&aacute;rias 
    de PGP clicando os bot&otilde;es apropriados na barra de ferramentas de seu 
    aplicativo: </p>
  <ul>
    <li> Qualcomm Eudora <br>
      <br>
    </li>
    <li> Microsoft Exchange <br>
      <br>
    </li>
    <li> Microsoft Outlook <br>
      <br>
    </li>
    <li> Microsoft Outlook Express <br>
      <br>
    </li>
    <li> Novell Groupwise (dispon&iacute;vel separadamente)<br>
    </li>
  </ul>
  <p>Por exemplo, voc&ecirc; clica o &iacute;cone de envelope e fechadura (<img src="envelope_and_lock.gif" width="26" height="25" align="absmiddle">) 
    para indicar que voc&ecirc; quer codificar sua mensagem, e o &iacute;cone 
    da caneta e papel (<img src="pen_and_paper.gif" width="26" height="25" align="absmiddle">) 
    para indicar que voc&ecirc; quer assinar sua mensagem. Algumas aplica&ccedil;&otilde;es 
    tamb&eacute;m t&ecirc;m um &iacute;cone de uma fechadura e broca (<img src="lock_and_quill.gif" width="32" height="29" align="absmiddle">) 
    que o permite fazer ambos ao mesmo tempo. Quando voc&ecirc; recebe um email 
    de outro usu&aacute;rio de PGP, voc&ecirc; decifra a mensagem e verifica a 
    assinatura digital da pessoa clicando a fechadura aberta e envelope, ou selecionando 
    &quot;Decrypt/Verify&quot; do PGPmenu (<img src="decrypt_verify.gif" width="21" height="25" align="absmiddle">).<br>
  </p>
  <p>Voc&ecirc; tamb&eacute;m pode acessar a qualquer hora a janela de PGPkeys 
    enquanto escrevendo ou recebendo seus emails clicando o bot&atilde;o PGPkeys 
    (<img src="pgpkeys.gif" width="28" height="28" align="absmiddle">) em alguns 
    plug-ins.<br>
  </p>
</blockquote>
<p><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Usando 
  PGP/MIME</b></font></p>
<blockquote> 
  <p> Se voc&ecirc; est&aacute; usando um aplicativo de email com um dos plug-ins 
    que suporta o padr&atilde;o PGP/MIME, e voc&ecirc; est&aacute; se comunicando 
    com outro usu&aacute;rio cujo aplicativo de email tamb&eacute;m suporta este 
    padr&atilde;o, voc&ecirc;s podem automaticamente codificar e decifrar suas 
    mensagens de email e qualquer arquivo anexado quando voc&ecirc; enviar ou 
    recuperar seu email. Tudo que voc&ecirc; tem que fazer &eacute; ativar a criptografia 
    PGP/MIME e fun&ccedil;&otilde;es de assinatura na caixa de di&aacute;logo 
    &quot;Preferences&quot; (Prefer&ecirc;ncias) de PGP. Quando voc&ecirc; receber 
    email de algu&eacute;m que usa o recurso PGP/MIME, as mensagens chegam com 
    um &iacute;cone anexado &agrave; janela de mensagem, o que indica que a mesma 
    usa codifica&ccedil;&atilde;o PGP/MIME. </p>
  <p> Para decifrar o texto e arquivos anexos em emails encapsulados por PGP/MIME 
    e para verificar qualquer assinatura digital, basta voc&ecirc; clicar duas 
    vezes no &iacute;cone com a fechadura e broca (<img src="lock_and_quill.gif" width="32" height="29" align="absmiddle">). 
    Anexos ainda estar&atilde;o codificados se PGP/MIME n&atilde;o for usado, 
    mas o processo de decifra&ccedil;&atilde;o normalmente &eacute; envolvido 
    mais para o destinat&aacute;rio.</p>
</blockquote>
<p><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif"><b>Usando 
  PGP atrav&eacute;s de PGPtools</b></font></p>
<blockquote> 
  <p>Se voc&ecirc; est&aacute; usando um aplicativo de email que n&atilde;o tem 
    suporte de um plug-in, ou se voc&ecirc; quer executar fun&ccedil;&otilde;es 
    de PGP de dentro de outras aplica&ccedil;&otilde;es, voc&ecirc; pode codificar 
    e assinar, decifrar e verificar, ou eliminar seguramente mensagens e arquivos 
    diretamente da janela de PGPtools. Voc&ecirc; pode abrir a janela de PGPtools 
    da seguinte forma:</p>
  <ul>
    <li>Clique Iniciar --&gt; Programas --&gt; PGP --&gt; PGPtools.<br>
      <br>
    </li>
    <li>D&ecirc; um clique duplo no &iacute;cone de PGPtools (<img src="decrypt_verify.gif" width="21" height="25" align="absmiddle">) 
      na bandeja do sistema. </li>
  </ul>
  <p> Quando a janela de PGPtools (<a href="#2-1">Figura 2-1</a>) se abre, voc&ecirc; 
    pode come&ccedil;ar seu trabalho de codifica&ccedil;&atilde;o.<br>
    <br>
  <div align="center"><img src="pgptools_window.gif" width="345" height="80"><br>
    <b><font size="2" face="Arial, Helvetica, sans-serif"><a name="2-1"></a>Figura 
    2-1. Janela de PGPtools</font></b></div>
  <p>Se voc&ecirc; est&aacute; trabalhando com texto ou arquivos, voc&ecirc; pode 
    codificar, decifrar, assinar, e verificar selecionando o texto ou arquivo 
    e arrastando-o sobre o bot&atilde;o apropriado na janela de PGPtools.</p>
  <p>Se voc&ecirc; est&aacute; trabalhando com arquivos, clique no bot&atilde;o 
    apropriado na janela de PGPtools para escolher um arquivo ou selecionar a 
    &Aacute;rea de Transfer&ecirc;ncia.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Usando 
  PGP atrav&eacute;s do Windows Explorer</font></b></p>
<blockquote> 
  <p>Voc&ecirc; pode codificar e assinar ou pode decifrar e verificar arquivos 
    como documentos de processadores de texto, planilhas eletr&ocirc;nicas e clipes 
    de v&iacute;deo diretamente do Windows Explorer. Se voc&ecirc; n&atilde;o 
    est&aacute; usando um aplicativo de email como Qualcomm Eudora 
    que suporta o padr&atilde;o de PGP/MIME, ou um aplicativo como Exchange ou 
    Outlook que n&atilde;o requerem PGP para codificar ou assinar arquivos, voc&ecirc; 
    deve usar este m&eacute;todo para anexar arquivos que voc&ecirc; quer enviar 
    junto com suas mensagens de email. Voc&ecirc; tamb&eacute;m poderia querer 
    codificar e decifrar arquivos que voc&ecirc; armazena em seu pr&oacute;prio 
    computador para impedir que outros tenham acesso a eles.</p>
  <p>Para acessar fun&ccedil;&otilde;es de PGP de dentro do Windows Explorer, 
    escolha a op&ccedil;&atilde;o apropriada no submenu de PGP do menu Arquivo. 
    As op&ccedil;&otilde;es que aparecem dependem do estado atual do arquivo que 
    voc&ecirc; selecionou. Se o arquivo ainda n&atilde;o foi codificado ou assinado, 
    ent&atilde;o as op&ccedil;&otilde;es para executar estas fun&ccedil;&otilde;es 
    aparecem no menu. Se o arquivo j&aacute; foi codificado ou assinado, ent&atilde;o 
    op&ccedil;&otilde;es para decifrar e verificar o conte&uacute;do do arquivo 
    s&atilde;o exibidos.</p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Selecionando 
  Destinat&aacute;rios</font></b></p>
<blockquote> 
  <p>Quando voc&ecirc; envia email a algu&eacute;m que possui um aplicativo de 
    email suportado pelos plug-ins de PGP, o endere&ccedil;o de email do destinat&aacute;rio 
    determina quais chaves usar quando codificando o conte&uacute;do. Por&eacute;m, 
    se voc&ecirc; inserir um nome de usu&aacute;rio ou endere&ccedil;o de email 
    que n&atilde;o correspondam a quaisquer das chaves em seu chaveiro p&uacute;blico, 
    ou se voc&ecirc; est&aacute; codificando via &Aacute;rea de Transfer&ecirc;ncia 
    ou Windows Explorer, voc&ecirc; dever&aacute; selecionar manualmente a chave 
    p&uacute;blica do destinat&aacute;rio usando a caixa de di&aacute;logo &quot;Key 
    Selection&quot; (Sele&ccedil;&atilde;o de Chave) de PGP. Para selecionar a 
    chave p&uacute;blica de um destinat&aacute;rio, simplesmente arraste o &iacute;cone 
    representando a chave dele na caixa de lista de destinat&aacute;rios e ent&atilde;o 
    clique OK.</p>
  <p>Para instru&ccedil;&otilde;es completas sobre como codificar e assinar, e 
    decifrar e verificar email, veja o Cap&iacute;tulo 4. Se voc&ecirc; quer codificar 
    arquivos para armazenar em seu disco r&iacute;gido, ou enviar como anexos 
    de email, veja o Cap&iacute;tulo 5.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Tomando 
  Atalhos</font></b></p>
<blockquote> 
  <p>Embora voc&ecirc; ir&aacute; achar que PGP &eacute; f&aacute;cil de usar, 
    v&aacute;rios atalhos est&atilde;o dispon&iacute;veis para lhe ajudar a realizar 
    suas tarefas de codifica&ccedil;&atilde;o ainda mais rapidamente. Por exemplo, 
    enquanto voc&ecirc; est&aacute; administrando suas chaves na janela de PGPkeys, 
    voc&ecirc; pode apertar o bot&atilde;o direito do mouse para realizar todas 
    as fun&ccedil;&otilde;es de PGP necess&aacute;rias, ao inv&eacute;s de acess&aacute;-las 
    da barra de menu. Voc&ecirc; tamb&eacute;m pode arrastar um arquivo que cont&eacute;m 
    uma chave na janela de PGPkeys para adicion&aacute;-la a seu chaveiro.</p>
  <blockquote> 
    <p>Atalhos de teclado tamb&eacute;m est&atilde;o dispon&iacute;veis para a 
      maioria das opera&ccedil;&otilde;es de menu. Estes atalhos de teclado s&atilde;o 
      mostrados em todos os menus de PGP, e outros atalhos s&atilde;o descritos 
      em contexto ao longo deste manual.</p>
  </blockquote>
</blockquote>
<p> <font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Defini&ccedil;&otilde;es 
  dos &Iacute;cones de PGPkeys</b></font> </p>
<blockquote> 
  <p> <font color="#A00048" face="Arial, Helvetica, sans-serif"><b>&Iacute;cones 
    da Barra de Menu de PGPkeys</b></font></p>
  <p>A seguinte tabela mostra todos os &iacute;cones usados na barra de menu de 
    PGPkeys, juntamente com uma descri&ccedil;&atilde;o das fun&ccedil;&otilde;es 
    dos mesmos. </p>
</blockquote>
<table width="80%" border="0" align="center" cellspacing="10">
  <tr> 
    <th width="5%">&Iacute;cone</th>
    <th width="95%">Fun&ccedil;&atilde;o</th>
  </tr>
  <tr> 
    <td width="5%"><img src="keygen_wizard.gif" width="37" height="35"></td>
    <td width="95%">Executa o assistente para gera&ccedil;&atilde;o de chave (&quot;PGP 
      Key Generation Wizard&quot;). Clique este bot&atilde;o para criar um novo 
      par de chaves.</td>
  </tr>
  <tr> 
    <td width="5%"><img src="revoke_key.gif" width="37" height="35"></td>
    <td width="95%"> 
      <p>Revoga a assinatura ou chave atualmente selecionada. Clique este bot&atilde;o 
        para desabilitar uma chave ou revogar uma assinatura. Revogar uma chave 
        previne qualquer um de codificar dados para ela. </p>
    </td>
  </tr>
  <tr> 
    <td width="5%"><img src="sign_key.gif" width="36" height="37"></td>
    <td width="95%">Permite que voc&ecirc; assine a chave atualmente selecionada. 
      Assinando a chave, voc&ecirc; est&aacute; certificando que a chave e o ID 
      de usu&aacute;rio pertencem ao usu&aacute;rio identificado.</td>
  </tr>
  <tr> 
    <td width="5%"><img src="delete_key.gif" width="39" height="35"></td>
    <td width="95%">Apaga o item atualmente selecionado. Clique este bot&atilde;o 
      para remover uma chave, assinatura, ou ID fotogr&aacute;fico. </td>
  </tr>
  <tr> 
    <td width="5%"><img src="key_search.gif" width="37" height="35"></td>
    <td width="95%">Abre a janela de procura por chave (&quot;Key Search&quot;) 
      que lhe permite procurar chaves em chaveiros locais e servidores distantes. 
    </td>
  </tr>
  <tr> 
    <td width="5%"><img src="key_to_server.gif" width="36" height="33"></td>
    <td width="95%">Envia a chave atualmente selecionada ao servidor. Clique este 
      bot&atilde;o para enviar sua chave para o servidor de Certificados ou de 
      dom&iacute;nio. </td>
  </tr>
  <tr> 
    <td width="5%"><img src="update_key.gif" width="39" height="36"></td>
    <td width="95%">Atualiza a chave atualmente selecionada atrav&eacute;s de 
      um servidor de Certificados ou de dom&iacute;nio. Clique este bot&atilde;o 
      para importar chaves de um servidor de Certificados ou de dom&iacute;nio 
      para seu chaveiro. </td>
  </tr>
  <tr> 
    <td width="5%"><img src="properties.gif" width="35" height="34"></td>
    <td width="95%">Exibe a caixa de di&aacute;logo &quot;Properties&quot; para 
      a chave atualmente selecionada. Clique este bot&atilde;o para ver as propriedades 
      gerais e de subchaves (&quot;subkeys&quot;) para uma chave. </td>
  </tr>
  <tr> 
    <td width="5%"><img src="import_keys.gif" width="34" height="36"></td>
    <td width="95%">Permite que voc&ecirc; importe chaves de um arquivo para seu 
      chaveiro.</td>
  </tr>
  <tr> 
    <td width="5%"><img src="export_keys.gif" width="37" height="32"></td>
    <td width="95%">Permite que voc&ecirc; exporte a chave selecionada para um 
      arquivo.</td>
  </tr>
</table>
<blockquote> 
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">&Iacute;cones 
    de janelas de PGPkeys</font></b></p>
  <p>A tabela a seguir mostra todos os mini-&iacute;cones usados na janela PGPkeys, 
    juntamente com uma descri&ccedil;&atilde;o do que eles representam.</p>
</blockquote>
<table width="70%" border="0" cellspacing="10" align="center">
  <tr> 
    <th width="5%"> 
      <div align="center">&Iacute;cone</div>
    </th>
    <th width="95%">Descri&ccedil;&atilde;o</th>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="goldkey_user.gif" width="34" height="25"></div>
    </td>
    <td width="95%">Uma chave dourada e um usu&aacute;rio representam seu par 
      de chaves Diffie-Hellman/DSS, que consiste de sua chave privada e sua chave 
      p&uacute;blica.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="goldkey.gif" width="29" height="19"></div>
    </td>
    <td width="95%">Uma chave dourada simples representa uma chave p&uacute;blica 
      Diffie-Hellman/DSS.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="graykey_user.gif" width="27" height="26"></div>
    </td>
    <td width="95%">Uma chave cinza e um usu&aacute;rio representam seu par de 
      chaves RSA, que consiste de sua chave privada e sua chave p&uacute;blica.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="graykey.gif" width="29" height="21"></div>
    </td>
    <td width="95%">Uma chave cinza simples representa uma chave p&uacute;blica 
      RSA.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="dimmed_key.gif" width="28" height="21"></div>
    </td>
    <td width="95%">Quando um par de chaves ou chave est&aacute; escurecido, as 
      chaves estão temporariamente indisponíveis para codificar e assinar. Você 
      pode desabilitar uma chave atrav&eacute;s da janela de PGPkeys, o que previne 
      que chaves raramente usadas atrapalhem a caixa de diálogo de Seleção de 
      Chave (&quot;Key Selection&quot;).</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="photo_user.gif" width="32" height="25"></div>
    </td>
    <td width="95%">Este ícone indica que um ID fotogr&aacute;fico de usuário 
      (&quot;Photographic User ID&quot;) est&aacute; acompanhado da chave pública.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="key_redx.gif" width="32" height="28"></div>
    </td>
    <td width="95%">Uma chave com um X vermelho indica que a chave foi revogada. 
      Usu&aacute;rios revogam suas chaves quando elas n&atilde;o s&atilde;o mais 
      v&aacute;lidas ou foram comprometidas de alguma forma.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="key_clock.gif" width="35" height="31"></div>
    </td>
    <td width="95%">Uma chave com um rel&oacute;gio indica que a chave expirou. 
      A data de expira&ccedil;&atilde;o de uma chave &eacute; estabelecida quando 
      a chave &eacute; criada.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="envelope.gif" width="30" height="24"></div>
    </td>
    <td width="95%">Um envelope representa o possuidor da chave e lista os nomes 
      do usu&aacute;rio e endere&ccedil;os de email associados &agrave; chave.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="gray_circle.gif" width="27" height="25"></div>
    </td>
    <td width="95%">Um c&iacute;rculo cinza indica que a chave &eacute; inv&aacute;lida.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="green_circle.gif" width="25" height="28"></div>
    </td>
    <td width="95%">Um c&iacute;rculo verde indica que a chave &eacute; v&aacute;lida. 
      Um c&iacute;rculo vermelho adicional na coluna ADK (&quot;Additional Decryption 
      Key&quot;) indica que a chave possui uma Chave Adicional de Decodifica&ccedil;&atilde;o
      associada; um c&iacute;rculo cinza adicional na coluna ADK indica que a chave
      n&atilde;o possui uma ADK associada.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="green_circle_user.gif" width="30" height="30"></div>
    </td>
    <td width="95%">Um c&iacute;rculo verde e um usu&aacute;rio indica que voc&ecirc; 
      possui a chave, e que sua confiabilidade est&aacute; impl&iacute;cita.</td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="pencil_fountain_pen.gif" width="69" height="30"></div>
    </td>
    <td width="95%">Um lápis ou caneta de pena indicam as assinaturas dos usuários 
      de PGP que atestaram a autenticidade da chave. Uma assinatura com um X vermelho 
      atrav&eacute;s dela indicam uma assinatura revogada. Uma assinatura com 
      um ícone escurecido de um lápis indica uma assinatura ruim ou inv&aacute;lida. 
      Uma assinatura com uma seta azul próxima a ela indica que é exportável. 
    </td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="bar_empty.gif" width="64" height="23"></div>
    </td>
    <td width="95%">Uma barra vazia indica uma chave inv&aacute;lida ou um usu&aacute;rio 
      n&atilde;o confiado. </td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="bar_half.gif" width="66" height="17"></div>
    </td>
    <td width="95%">Uma barra meio-cheia indica um chave marginalmente v&aacute;lida 
      ou um usu&aacute;rio marginalmente confiado. </td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="bar_striped.gif" width="64" height="15"></div>
    </td>
    <td width="95%">Uma barra listada indica uma chave v&aacute;lida que voc&ecirc; 
      possui e &eacute; implicitamente confi&aacute;vel, seja qual forem as assinaturas 
      na chave. </td>
  </tr>
  <tr> 
    <td width="5%"> 
      <div align="center"><img src="bar_full.gif" width="64" height="17"></div>
    </td>
    <td width="95%">Uma barra cheia indica uma chave completamente v&aacute;lida 
      ou um usu&aacute;rio completamente confiado.</td>
  </tr>
</table>
<blockquote> 
  <p>&nbsp; </p>
</blockquote>
</body>
</html>
