<html>
<head>
<title>Criando e Trocando Chaves</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style></head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Criando 
        e Trocando Chaves</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>3</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Este cap&iacute;tulo descreve como gerar o par de chaves p&uacute;blica e 
    privada que voc&ecirc; precisa para se corresponder com outros usu&aacute;rios 
    de PGP. Tamb&eacute;m explica como distribuir sua chave p&uacute;blica e como 
    obter as chaves p&uacute;blicas de outros, de forma que voc&ecirc; possa come&ccedil;ar 
    a trocar email privado e autenticado.</p>
</blockquote>
<p><b><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><a name="conceitos"></a>Conceitos 
  chave</font></b> </p>
<blockquote> 
  <p> PGP &eacute; baseado em um sistema de <i>criptografia por chave p&uacute;blica</i> 
    amplamente aceito e altamente confi&aacute;vel, como mostrado na <a href="#3-1">figura 
    3-1</a>, pela qual voc&ecirc; e outros usu&aacute;rios de PGP geram um par 
    de chaves que consiste em uma chave privada e uma chave p&uacute;blica. Como 
    seu nome implica, s&oacute; voc&ecirc; tem acesso &agrave; sua chave privada, 
    mas para corresponder com outros usu&aacute;rios de PGP voc&ecirc; precisa 
    de uma c&oacute;pia da chave p&uacute;blica deles e eles precisam de uma c&oacute;pia 
    da sua. Voc&ecirc; usa sua chave privada para assinar as mensagens de email 
    e arquivos anexos que voc&ecirc; envia para outros, e para decifrar as mensagens 
    e arquivos que eles enviam a voc&ecirc;. Reciprocamente, voc&ecirc; usa as 
    chaves p&uacute;blicas de outros para enviar a eles emails codificados e para 
    verificar as assinaturas digitais deles.</p>
  <p align="center"><b><font face="Arial, Helvetica, sans-serif" size="2"><a name="3-1"></a><img src="diagrama_criptografia_por_chave_publica.gif" width="497" height="275"><br>
    Figura 3-1. Diagrama de Criptografia por Chave P&uacute;blica</font></b></p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><a name="criando_par_chaves"></a>Criando 
  um Par de Chaves</font></b></p>
<blockquote> 
  <p>A menos que voc&ecirc; j&aacute; tenha feito isso antes usando outra vers&atilde;o 
    de PGP, a primeira coisa que voc&ecirc; precisa fazer antes de enviar ou receber 
    um email codificado e assinado &eacute; criar um novo par de chaves. Um par 
    de chaves consiste em duas chaves: uma chave privada que s&oacute; voc&ecirc; 
    possui, e uma chave p&uacute;blica que voc&ecirc; distribui livremente para 
    as pessoas com quem voc&ecirc; se corresponde. Voc&ecirc; gera um novo par 
    de chaves na janela PGPkeys usando o &quot;PGP Key Generation Wizard&quot;, 
    que o guiar&aacute; durante o processo.</p>
  <p><b>NOTA</b>: Se voc&ecirc; est&aacute; atualizando PGP de uma vers&atilde;o 
    mais nova, voc&ecirc; provavelmente j&aacute; tem gerada uma chave privada 
    e j&aacute; distribuiu sua respectiva chave p&uacute;blica para aqueles com 
    quem voc&ecirc; se corresponde. Neste caso voc&ecirc; n&atilde;o tem que fazer 
    um novo par de chaves (como descrito na pr&oacute;xima se&ccedil;&atilde;o). 
    Ao inv&eacute;s, voc&ecirc; especifica a localiza&ccedil;&atilde;o de suas 
    chaves quando voc&ecirc; executar o programa PGPkeys. Voc&ecirc; pode ir para 
    o painel &quot;Files&quot; da caixa de di&aacute;logo &quot;Preferences&quot; 
    e localizar seus arquivos de chaveiro a qualquer hora.</p>
</blockquote>
<p><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para 
  Criar um Novo Par de Chaves</b></font></p>
<ol>
  <ol>
    <li> Abra a janela PGPkeys. Voc&ecirc; pode abri-la assim:<br>
      <br>
      <ul>
        <li>Clicando Iniciar --&gt; Programas --&gt; PGP --&gt; PGPkeys <br>
          <br>
        </li>
        <li>Clicando no &iacute;cone de PGPtray (<img src="decrypt_verify.gif" width="21" height="25" align="absmiddle">) 
          na bandeja do sistema, e ent&atilde;o &quot;PGPkeys&quot;.<br>
          <br>
        </li>
      </ul>
    </li>
    <li>Clicando (<img src="bt_par_de_chaves.gif" width="23" height="24" align="absmiddle">) 
      na barra de ferramentas da seu aplicativo de email. <br>
      <br>
      A janela de PGPkeys se abre, como mostrado na <a href="#3-2">figura 3-2</a>.<br>
      <br>
      <div align="center"> <font size="2" face="Arial, Helvetica, sans-serif"><b><a name="3-2"></a><img src="pgpkeys_window.gif" width="473" height="317"><br>
        Figura 3-2. A janela PGPkeys</b></font><br>
      </div>
      <br>
    </li>
    <li>Clique (<img src="keygen_wizard.gif" width="37" height="35" align="absmiddle">) 
      na barra de ferramentas de PGPkeys. O PGP Key Generation Wizard mostra algumas 
      informa&ccedil;&otilde;es introdut&oacute;ria na primeira tela.<br>
      <br>
    </li>
    <li>Quando voc&ecirc; tiver terminado de ler estas informa&ccedil;&otilde;es, 
      clique em &quot;Next&quot; para avan&ccedil;ar &agrave; pr&oacute;xima caixa 
      de di&aacute;logo.<br>
      <br>
      O PGP Key Generation Wizard lhe pede para entrar seu nome e endere&ccedil;o 
      de email.<br>
      <br>
    </li>
    <li>Entre seu nome na primeira linha e seu endere&ccedil;o de email na segunda 
      linha.<br>
      <br>
      N&atilde;o &eacute; absolutamente necess&aacute;rio entrar com seu nome 
      real ou at&eacute; mesmo seu endere&ccedil;o de email. Por&eacute;m, usando 
      seu nome real torna mais f&aacute;cil para outros identific&aacute;-lo como 
      dono de sua chave p&uacute;blica. Tamb&eacute;m, usando seu endere&ccedil;o 
      de email correto, voc&ecirc; e outros podem aproveitar a caracter&iacute;stica 
      do plug-in que automaticamente procura a chave apropriada em seu chaveiro 
      atual quando voc&ecirc; envia correio a um destinat&aacute;rio em particular. 
      Chaves de Assinaturas Corporativas e Chaves Adicionais de Decodifica&ccedil;&atilde;o
      n&atilde;o t&ecirc;m nenhum uso para um endere&ccedil;o de email 
      porque eles n&atilde;o representam indiv&iacute;duos.<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot; para avan&ccedil;ar &agrave; pr&oacute;xima caixa 
      de di&aacute;logo. O Assistente de Gera&ccedil;&atilde;o de Chave lhe pede 
      que selecione um tipo chave.<br>
      <br>
    </li>
    <li>Selecione um tipo de chave, Diffie-Hellman/DSS ou RSA e ent&atilde;o clique 
      Avan&ccedil;ar.<br>
      <br>
      Vers&otilde;es anteriores de PGP usam uma tecnologia mais antiga chamada 
      RSA para gerar chaves. Com PGP Vers&atilde;o 5.0 e superiores, voc&ecirc; 
      tem a op&ccedil;&atilde;o de criar um novo tipo de chave, baseado na variante 
      de Elgamal melhorada da tecnologia Diffie-Hellman.<br>
      <br>
      <ul>
        <li>Se voc&ecirc; planeja se corresponder com pessoas que ainda est&atilde;o 
          usando chaves RSA, voc&ecirc; pode querer gerar um par de chaves RSA 
          que &eacute; compat&iacute;vel com vers&otilde;es anteriores do programa.<br>
          <br>
        </li>
        <li>Se voc&ecirc; planeja se corresponder com pessoas que t&ecirc;m PGP 
          Vers&atilde;o 5.0 ou superior, voc&ecirc; pode tirar proveito da nova 
          tecnologia e gerar um par de chaves Diffie-Hellman/DSS.<br>
          <br>
        </li>
        <li> Se voc&ecirc; quer trocar email com todos os usu&aacute;rios de PGP, 
          fa&ccedil;a um par de chaves RSA e um par de chaves Diffie-Hellman/DSS, 
          ent&atilde;o use o par apropriado, dependendo da vers&atilde;o de PGP 
          usado pelo destinat&aacute;rio. Voc&ecirc; deve criar um par de chaves 
          separado para cada tipo de chave da que voc&ecirc; precisar.</li>
      </ul>
      <br>
        <b>NOTA</b>: Se sua vers&atilde;o de PGP n&atilde;o suporta RSA, este 
        passo pode n&atilde;o estar dispon&iacute;vel a voc&ecirc;. Para mais 
        informa&ccedil;&otilde;es sobre suporte RSA, veja o arquivo LeiaMe que 
        acompanha o produto.<br><br>
    </li>
    <li>O PGP Key Generation Wizard lhe pede para especificar um tamanho para 
      suas novas chaves.<br>
      <br>
      Selecione um tamanho para as chaves entre 768 e 3072 bits, ou entre um tamanho 
      personalizado entre 768<br>
      e 4096 bits.<br>
      <br>
      <b>NOTA</b>: Um tamanho personalizado para as chaves pode levar muito tempo 
      para serem gerados, dependendo da velocidade do computador que voc&ecirc; 
      est&aacute; usando.<br>
      <br>
      O tamanho das chave correspondem ao n&uacute;mero de bits usados para construir 
      sua chave digital. Quanto maior a chave, menores chances algu&eacute;m ter&aacute; 
      para quebr&aacute;-las, mas mais muito tempo levar&atilde;o para executar 
      os processos de decifra&ccedil;&atilde;o e codifica&ccedil;&atilde;o. Voc&ecirc; 
      precisar&aacute; encontrar um ponto de equil&iacute;brio entre a conveni&ecirc;ncia 
      de executar as fun&ccedil;&otilde;es de PGP mais depressa com uma chave 
      menor e o maior n&iacute;vel de seguran&ccedil;a provido por uma chave maior. 
      A menos que voc&ecirc; esteja trocando informa&ccedil;&otilde;es extremamente 
      sens&iacute;veis, que seria de interesse suficiente para que algu&eacute;m 
      estivesse disposto a montar um ataque criptogr&aacute;fico caro e demorado 
      para l&ecirc;-las, voc&ecirc; est&aacute; seguro usando uma chave composta 
      por 1024 bits.<br>
      <br>
      <b>NOTA</b>: Quando criando um par de chaves Diffie-Hellman/DSS, o tamanho 
      da por&ccedil;&atilde;o DSS da chave &eacute; menor que ou igual ao tamanho 
      da por&ccedil;&atilde;o Diffie-Hellman da chave, e est&aacute; limitado 
      a um tamanho m&aacute;ximo de 1024 bits.<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot; para avan&ccedil;ar ao pr&oacute;ximo painel. 
      O PGP Key Generation Wizard lhe pede que indique quando o par de chaves 
      ir&aacute; expirar.<br>
      <br>
    </li>
    <li> Indique quando voc&ecirc; quer que suas chaves expirem. Voc&ecirc; pode 
      usar tanto a op&ccedil;&atilde;o padr&atilde;o, que &eacute; &quot;Nunca&quot; 
      (&quot;Never&quot;), ou pode entrar uma data espec&iacute;fica depois da 
      qual as chaves expirar&atilde;o. Uma vez que voc&ecirc; criar um par de 
      chaves e distribuir sua chave p&uacute;blica para o mundo, voc&ecirc; provavelmente 
      continuar&aacute; usando as mesmas chaves daquele ponto em diante. Por&eacute;m, 
      sobre certas condi&ccedil;&otilde;es voc&ecirc; pode querer criar um par 
      de chaves especial, que voc&ecirc; planeja usar por apenas um per&iacute;odo 
      limitado de tempo. Neste caso, quando a chave p&uacute;blica expira, j&aacute; 
      n&atilde;o pode ser usada por algu&eacute;m para codificar mensagens para 
      voc&ecirc;, mas poder&aacute; ainda ser usada para verificar sua assinatura 
      digital. Semelhantemente, quando sua chave privada expira, ainda pode ser 
      usada para decifrar mensagens que foram enviadas a voc&ecirc; antes de sua 
      chave p&uacute;blica expirar, mas j&aacute; n&atilde;o podem ser usadas 
      para assinar mensagens para outros.<br>
      <br>
    </li>
    <li> Clique &quot;Next&quot; para seguir &agrave; pr&oacute;xima tela. O Assistente 
      de Gera&ccedil;&atilde;o de Chaves lhe pede que entre uma &quot;frase-senha&quot; 
      (passphrase).<br>
      <br>
    </li>
    <li> Na caixa de di&aacute;logo &quot;Passphrase&quot;, entre a s&eacute;rie 
      de caracteres ou palavras que voc&ecirc; quer usar para manter acesso exclusivo 
      &agrave; sua chave privada. Para confirmar sua entrada, aperte a tecla &quot;Tab&quot; 
      para avan&ccedil;ar &agrave; pr&oacute;xima linha, ent&atilde;o entre a 
      mesma frase-senha novamente.<br>
      <br>
      Normalmente, como um n&iacute;vel adicional de seguran&ccedil;a, os caracteres 
      que voc&ecirc; entra para a frase-senha n&atilde;o aparecem na tela. Por&eacute;m, 
      se voc&ecirc; est&aacute; seguro que ningu&eacute;m est&aacute; vendo, e 
      voc&ecirc; gostaria de ver os caracteres de sua frase-senha enquanto voc&ecirc; 
      os digita, desmarque a caixa &quot;Hide Typing&quot;.<br>
      <br>
      <b>NOTA</b>: Sua frase-senha deve conter v&aacute;rias palavras e podem 
      incluir espa&ccedil;os, n&uacute;meros, e caracteres de pontua&ccedil;&atilde;o. 
      Escolha algo que voc&ecirc; possa se lembrar facilmente, mas que outros 
      n&atilde;o sejam capazes de adivinhar. A frase-senha &eacute; &quot;sens&iacute;vel 
      a caso&quot;, o que significa que faz distin&ccedil;&atilde;o entre mai&uacute;sculas 
      e min&uacute;sculas. Quanto mais longa sua frase-senha, e maior a variedade 
      de caracteres que contenha, mais segura ela &eacute;. Frases-senhas fortes 
      incluem letras mai&uacute;sculas e min&uacute;sculas, n&uacute;meros, pontua&ccedil;&atilde;o 
      e espa&ccedil;os, mas s&atilde;o mais f&aacute;ceis de serem esquecidas. 
      Veja <a href="#criando_frase_senha_que_voce_vai_se_lembrar">&quot;Criando 
      um frase-senha que voc&ecirc; vai se lembrar&quot; na p&aacute;gina 38</a>, 
      para mais informa&ccedil;&otilde;es sobre como escolher uma frase-senha.<br>
      <br>
      <b>ADVERT&Ecirc;NCIA</b>: Ningu&eacute;m, inclusive a Network Associates, 
      pode recuperar uma frase-senha esquecida.<br>
      <br>
    </li>
    <li> Clique &quot;Next&quot; para iniciar o processo de gera&ccedil;&atilde;o 
      da chave.<br>
      <br>
      O Assistente de Gera&ccedil;&atilde;o de Chave indica que est&aacute; ocupado 
      gerando sua chave.<br>
      <br>
      Se voc&ecirc; entrou uma frase-senha inadequada, uma mensagem de advert&ecirc;ncia 
      aparece antes das chaves serem geradas e voc&ecirc; tem a escolha de aceitar 
      a frase-senha ruim ou entrar uma mais segura antes de continuar. Para mais 
      informa&ccedil;&otilde;es sobre frases-senha, veja <a href="#criando_frase_senha_que_voce_vai_se_lembrar">&quot;Criando 
      um frase-senha que voc&ecirc; vai se lembrar&quot; na p&aacute;gina 38</a>.<br>
      <br>
      Se n&atilde;o houver suficiente informa&ccedil;&atilde;o aleat&oacute;ria 
      sobre a qual a chave ser&aacute; constru&iacute;da, a caixa de di&aacute;logo 
      &quot;Random Data&quot; aparece. Como instru&iacute;do na caixa de di&aacute;logo, 
      mova seu mouse pela tela e pressione uma s&eacute;rie de teclas aleat&oacute;rias 
      at&eacute; que a barra de progresso esteja completamente preenchida. Seus 
      movimentos do mouse e teclas pressionadas geram informa&ccedil;&otilde;es 
      aleat&oacute;rias que s&atilde;o necess&aacute;rias para se criar um par 
      de chaves &uacute;nico.<br>
      <br>
      <b>NOTA</b>: PGPkeys junta dados aleat&oacute;rios continuamente a partir 
      de muitas fontes no sistema, inclusive posi&ccedil;&atilde;o do mouse, temporizadores, 
      e pressionamento de teclas. Se a caixa de di&aacute;logo de Dados Aleat&oacute;rios 
      n&atilde;o aparecer, isto indica que PGP j&aacute; coletou todos os dados 
      aleat&oacute;rios que precisava para criar o par de chaves.<br>
      <br>
      Depois que o processo de gera&ccedil;&atilde;o da chave come&ccedil;a, pode 
      demorar um tempo para gerar as chaves. De fato, se voc&ecirc; especificar 
      um tamanho diferente dos valores padr&atilde;o para uma chave Diffie-Hellman/DSS, 
      a op&ccedil;&atilde;o de gera&ccedil;&atilde;o de chave r&aacute;pida n&atilde;o 
      &eacute; usada e pode levar horas para gerar sua chave com tamanhos maiores. 
      Eventualmente o Assistente de Gera&ccedil;&atilde;o de Chave indicar&aacute; 
      que o processo de gera&ccedil;&atilde;o das chaves foi completado.<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot; para seguir &agrave; pr&oacute;xima tela.<br>
      <br>
      O Assistente de Gera&ccedil;&atilde;o de Chaves indica que voc&ecirc; gerou 
      com sucesso um novo par de chaves e pergunta se voc&ecirc; quer enviar sua 
      chave p&uacute;blica para um Servidor de Chaves.<br>
      <br>
    </li>
    <li>Especifique se voc&ecirc; quer enviar sua nova chave p&uacute;blica para 
      o servidor, e ent&atilde;o clique &quot;Next&quot; (o servidor padr&atilde;o 
      &eacute; especificado em suas prefer&ecirc;ncias).<br>
      <br>
      Quando voc&ecirc; envia sua chave p&uacute;blica ao Servidor de Chaves, 
      qualquer um que tiver acesso &agrave;quele Servidor de Chaves pode obter 
      uma c&oacute;pia de sua chave quando precisar. Para detalhes completos, 
      veja <a href="#distribuindo_chave_publica">&quot;Distribuindo sua chave 
      p&uacute;blica&quot; na p&aacute;gina 46</a>. Quando o processo de gera&ccedil;&atilde;o 
      da chave estiver completo, a tela final aparece.<br>
      <br>
    </li>
    <li>Clique &quot;Done&quot;.<br>
      <br>
      Um par de chaves que representam suas chaves recentemente criadas aparece 
      na janela de PGPkeys. Neste momento voc&ecirc; pode examinar suas chaves, 
      conferindo as propriedades delas e os atributos associados &agrave; suas 
      chaves; voc&ecirc; tamb&eacute;m pode querer adicionar outros endere&ccedil;os 
      de email que perten&ccedil;am a voc&ecirc;. Veja <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm#adicionando_novo_nome_ou_endereco_para_um_par_de_chaves">&quot;Adicionando 
      um novo nome de usu&aacute;rio ou endere&ccedil;o para um par de chaves&quot; 
      na p&aacute;gina 88</a>, para detalhes sobre como adicionar um novo nome 
      de usu&aacute;rio &agrave; sua chave.</li>
  </ol>
</ol>
<p>&nbsp;</p>
<p><b><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><a name="criando_frase_senha_que_voce_vai_se_lembrar"></a>Criando 
  uma Frase-Senha Que Voc&ecirc; Vai Se Lembrar</font></b></p>
<blockquote> 
  <p>Codificar um arquivo e depois se achar impossibilitado de decifr&aacute;-lo 
    &eacute; uma dolorosa li&ccedil;&atilde;o para aprender a escolher uma frase-senha 
    da qual voc&ecirc; se lembrar&aacute;. A maioria das aplica&ccedil;&otilde;es 
    requer uma senha entre tr&ecirc;s e oito letras. Uma senha de uma s&oacute; 
    palavra &eacute; vulner&aacute;vel a um &quot;ataque de dicion&aacute;rio&quot;, 
    que consiste em fazer um computador tentar todas as palavras de um dicion&aacute;rio 
    at&eacute; achar sua senha. Para proteger-se contra esta maneira de ataque, 
    &eacute; amplamente recomendado que voc&ecirc; crie uma frase que inclua uma 
    combina&ccedil;&atilde;o de letras mai&uacute;sculas e min&uacute;sculas, 
    n&uacute;meros, marcas de pontua&ccedil;&atilde;o, e espa&ccedil;os. Isto 
    resulta em uma senha mais forte, mas obscura, que &eacute; improv&aacute;vel 
    que se lembre facilmente. N&oacute;s n&atilde;o recomendamos que voc&ecirc; 
    usa um frase-senha de uma s&oacute; palavra.</p>
  <p>Uma frase-senha &eacute; menos vulner&aacute;vel a um ataque de dicion&aacute;rio. 
    Isto &eacute; realizado facilmente usando v&aacute;rias palavras em sua frase-senha, 
    ao inv&eacute;s de tentar contrariar um ataque de dicion&aacute;rio inserindo 
    arbitrariamente montes de caracteres engra&ccedil;ados n&atilde;o-alfab&eacute;ticos, 
    que t&ecirc;m o efeito de fazer sua frase-senha muito f&aacute;cil de se esquecer 
    e poder conduzir a uma perda desastrosa de informa&ccedil;&otilde;es porque 
    voc&ecirc; n&atilde;o pode decifrar seus pr&oacute;prios arquivos. Por&eacute;m, 
    a menos que a frase-senha que voc&ecirc; escolher seja algo que &eacute; facilmente 
    grav&aacute;vel em sua mem&oacute;ria de longo prazo, &eacute; pouco prov&aacute;vel 
    que voc&ecirc; ir&aacute; se lembrar dela literalmente. &Eacute; prov&aacute;vel 
    que a escolha de uma frase no calor de um determinado momento resulte em seu 
    esquecimento por completo. Escolha algo que j&aacute; est&aacute; gravado 
    em sua mem&oacute;ria de longo prazo. Talvez um prov&eacute;rbio tolo que 
    voc&ecirc; ouviu anos atr&aacute;s e que de alguma maneira ficou em sua mente 
    por todo esse tempo. N&atilde;o deve ser algo que voc&ecirc; repetiu recentemente 
    a outros, nem uma frase famosa, porque voc&ecirc; quer que ela seja dura para 
    um atacante sofisticado adivinhar. Se j&aacute; estiver profundamente enraizado 
    em sua mem&oacute;ria de longo prazo, voc&ecirc; provavelmente n&atilde;o 
    a esquecer&aacute;.</p>
  <p>Claro que, se voc&ecirc; est&aacute; despreocupado o bastante para escrever 
    sua frase-senha e grud&aacute;-la no seu monitor ou guard&aacute;-la dentro da
    gaveta de sua escrivaninha, n&atilde;o importa o qu&ecirc; voc&ecirc; escolher&aacute;.</p>
</blockquote>
<p>&nbsp;</p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="adicionando_id_fotografico"></a>Adicionando 
  um ID fotogr&aacute;fico &agrave; sua chave </b></font></p>
<blockquote> 
  <p>Voc&ecirc; pode incluir um ID fotogr&aacute;fico de usu&aacute;rio (&quot;Photographic 
    User ID&quot;) em sua chave Diffie-Hellman/DSS. </p>
  <p> <b>ADVERT&Ecirc;NCIA</b>: Embora voc&ecirc; possa ver o ID fotogr&aacute;fico 
    que acompanha a chave de algu&eacute;m para verifica&ccedil;&atilde;o, voc&ecirc; 
    sempre deve conferir e comparar as &quot;impress&otilde;es digitais&quot;. Veja 
    <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm#verificando_chave_publica_de_alguem">&quot;Verificando 
    a chave p&uacute;blica de algu&eacute;m&quot; na p&aacute;gina 89</a> para 
    mais informa&ccedil;&otilde;es sobre autentica&ccedil;&atilde;o.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif"><a name="adicionar_foto_a_sua_chave"></a>Para 
  adicionar sua fotografia &agrave; sua chave:</font></b></p>
<ol>
  <ol>
    <li>Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione seu par de chaves e ent&atilde;o clique &quot;Add Photo&quot; 
      (Adicionar Fotografia) no menu &quot;Keys&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Add Photo&quot; abre-se, como mostrado na 
      <a href="#3-3">Figura 3-3</a>.<br>
      <br>
      <div align="center"> <font face="Arial, Helvetica, sans-serif" size="2"><b><a name="3-3"></a><img src="add_photo_window.gif" width="289" height="258"><br>
        Figura 3-3. A caixa de di&aacute;logo &quot;Add Photo&quot;.</b></font></div>
      <br>
      <br>
    </li>
    <li>Arraste ou cole sua fotografia sobre a caixa de di&aacute;logo &quot;Add 
      Photo&quot; ou procure-a clicando o bot&atilde;o &quot;Select File&quot;.<br>
      <br>
      <b>NOTA</b>: A fotografia deve ser um arquivo .JPG ou .BMP. Para qualidade 
      m&aacute;xima da fotografia, corte a figura para 120x144 antes de adicion&aacute;-la 
      &agrave; caixa de di&aacute;logo &quot;Add Photo&quot;. Se voc&ecirc; n&atilde;o 
      fizer isto, PGP ir&aacute; colocar a foto nesta escala para voc&ecirc;.<br>
      <br>
    </li>
    <li>Clique OK.<br>
      <br>
      A caixa de di&aacute;logo &quot;Passphrase&quot; abre-se, como mostrado 
      na <a href="#3-4">Figura 3-4</a>.<br>
      <br>
      <div align="center"><b><font face="Arial, Helvetica, sans-serif" size="2"><a name="3-4"></a><img src="passphrase.gif" width="292" height="136"><br>
      Figura 3-4. A caixa de di&aacute;logo &quot;Passphrase&quot;</font></b></div><br>
      <br>
    </li>
    <li>Entre sua frase-senha no espa&ccedil;o provido, ent&atilde;o clique OK.<br>
      <br>
      Seu ID fotogr&aacute;fico de usu&aacute;rio &eacute; adicionado &agrave; 
      sua chave p&uacute;blica e &eacute; listado na janela de PGPkeys. Voc&ecirc; 
      pode enviar sua chave agora para o servidor. Veja <a href="#para_enviar_chave_publica_a_servidor">&quot;Para 
      enviar sua chave p&uacute;blica a um servidor de chaves&quot; na p&aacute;gina 
      47</a>, para instru&ccedil;&otilde;es adicionais.</li>
  </ol>
</ol>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Para 
  substituir seu ID fotogr&aacute;fico</font></b></p>
<ol>
  <ol>
    <li>Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione seu par de chaves<br>
      <br>
    </li>
    <li>Selecione a fotografia que voc&ecirc; quer substituir. <br>
      <br>
    </li>
    <li>Escolha &quot;Delete&quot; no menu &quot;Edit&quot;.<br>
      <br>
    </li>
    <li>Adicione seu novo ID fotogr&aacute;fico usando as instru&ccedil;&otilde;es 
      mostradas em <a href="#adicionar_foto_a_sua_chave">&quot;Para adicionar 
      sua fotografia &agrave; sua chave&quot; na p&aacute;gina 39</a>.</li>
  </ol>
</ol>
<p>&nbsp;</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="criando_novas_subchaves"></a>Criando 
  novas subchaves</b></font></p>
<blockquote> 
  <p>Cada chave Diffie-Hellman/DSS &eacute; na verdade composta de duas chaves: 
    uma chave DSS, usada para assinar, e uma subchave Diffie-Hellman para codificar. 
    PGP Versão 6.0 permite criar e revogar novas chaves de codifica&ccedil;&atilde;o 
    sem sacrificar sua chave mestra de assinatura e as assinaturas adicionadas 
    a ela. Um dos usos mais comuns para esta característica é para criar múltiplas 
    chaves que s&atilde;o configuradas para serem usadas durante diferentes períodos 
    da vida da chave. Por exemplo, se você cria uma chave que vai expirar em 3 
    anos, você também poderia criar 3 subchaves e poderia usar cada uma delas 
    para um dos anos de vida da chave. Esta pode ser uma medida de segurança útil 
    e provê um modo automático para trocar periodicamente uma nova chave de codifica&ccedil;&atilde;o 
    sem ter que recriar e distribuir uma nova chave pública.</p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Para 
  criar novas subchaves</font></b></p>
<ol>
  <ol>
    <li>Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione seu par de chaves e ent&atilde;o clique &quot;Properties&quot; 
      no menu &quot;Keys&quot;, ou clique (<img src="properties.gif" width="35" height="34" align="absmiddle">).<br>
      <br>
      A janela de propriedades &eacute; aberta.<br>
      <br>
    </li>
    <li>Clique a aba &quot;Subkeys&quot;.<br>
      <br>
      A janela &quot;subkeys&quot; &eacute; aberta, como mostrado na <a href="#3-5">figura 
      3-5</a>.<br>
      <br>
      <div align="center">
      <a name="3-5"></a><img src="key_properties_subkeys.gif" width="365" height="397"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 3-5. P&aacute;gina &quot;PGP key property&quot; (caixa de di&aacute;logo 
      &quot;Subkeys&quot;)</b></font></div><br>
      <br>
    </li>
    <li> Para criar uma nova subchave, clique &quot;New&quot;.<br>
      <br>
      A janela &quot;New Subkey&quot; &eacute; aberta.<br>
      <br>
    </li>
    <li>Especifique um tamanho de chave entre 768 e 3072 bits, ou insira um valor 
      personalizado entre 768 e 4096 bits.<br>
      <br>
    </li>
    <li>Indique a data inicial na qual voc&ecirc; quer que sua subchave seja ativada.<br>
      <br>
    </li>
    <li>Indique quando voc&ecirc; deseja que sua subchave ir&aacute; expirar. 
      Voc&ecirc; pode usar a sele&ccedil;&atilde;o padr&atilde;o, que &eacute; 
      &quot;Nunca&quot; (&quot;Never&quot;), ou pode inserir uma data espec&iacute;fica 
      ap&oacute;s a qual a subchave ir&aacute; expirar.<br>
      <br>
    </li>
    <li> Clique OK.<br>
      <br>
      A janela &quot;passphrase&quot; aparecer&aacute;.<br>
      <br>
    </li>
    <li>Insira sua frase-senha e ent&atilde;o clique OK.<br>
      <br>
      Sua nova subchave &eacute; listada na janela &quot;Subkeys&quot;.</li>
  </ol>
</ol>
<p>&nbsp;</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="divisao_chaves"></a>Divis&atilde;o 
  de Chaves</b></font></p>
<blockquote> 
  <p>Qualquer chave privada pode ser dividida em partes entre v&aacute;rios &quot;propriet&aacute;rios&quot;, 
    usando um processo criptogr&aacute;fico conhecido como &quot;divis&atilde;o 
    de chave de Blakely-Shamir&quot;. Esta t&eacute;cnica &eacute; recomendada 
    para chaves com seguran&ccedil;a extremamente alta. Por exemplo, a Network 
    Associates mant&ecirc;m uma chave corporativa dividida entre v&aacute;rios 
    indiv&iacute;duos. Sempre que eles precisam assinar com aquela chave, 
    as partes da chave s&atilde;o temporariamente reunidas. Para dividir uma chave, 
    selecione o par de chaves que ser&aacute; dividido e escolha &quot;Share Split&quot; 
    no menu &quot;Keys&quot;. Ent&atilde;o lhe ser&aacute; pedido que voc&ecirc; 
    especifique quantas pessoas diferentes ser&atilde;o necess&aacute;rias para 
    reunir a chave. As partes s&atilde;o armazenadas como arquivos ou codificados 
    para a chave p&uacute;blica de um dos propriet&aacute;rios, ou codificados 
    convencionalmente se o propriet&aacute;rio n&atilde;o possuir uma chave p&uacute;blica. 
    Depois que a chave foi dividida, tentativas de us&aacute;-la para assinar 
    ou decifrar ir&atilde;o automaticamente tentar reunir a chave. Para informa&ccedil;&otilde;es 
    sobre como reunir uma chave dividida, veja <a href="5%20-%20Usando%20PGP%20para%20Armazenamento%20Seguro%20de%20Dados.htm#assinando_decifrando_arquivos_com_chave_dividida">&quot;Assinando 
    e decifrando arquivos com uma chave dividida&quot; na p&aacute;gina 73.</a></p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Para 
  criar uma chave dividida em m&uacute;ltiplas partes</font></b> </p>
<ol>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Na janela de PGPkeys, crie um novo par de chaves ou selecione um par de 
      chaves j&aacute; existente que voc&ecirc; quer dividir.<br>
      <br>
    </li>
    <li>No menu &quot;Keys&quot;, clique &quot;Share Split&quot;.<br>
      <br>
      A janela &quot;Share Split&quot; se abre (<a href="#3-6">Figura 3-6</a>) 
      sobre a janela de PGPkeys.<br>
      <br>
      <div align="center"><a name="3-6"></a><img src="share_split.gif" width="314" height="316"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 3-6. A janela 
        &quot;Share Split&quot;</b></font> </div>
      <br>
      <br>
    </li>
    <li>Adicione os propriet&aacute;rios para o par de chaves arrastando as chaves 
      deles da janela de PGPkeys para a lista de Propriet&aacute;rios na caixa 
      de di&aacute;logo &quot;Share Split&quot;.<br>
      <br>
      Para adicionar um propriet&aacute;rio que possui uma chave p&uacute;blica, 
      clique &quot;Add&quot; na caixa de di&aacute;logo &quot;Share Split&quot;, 
      entre o nome da pessoa e ent&atilde;o d&ecirc; permiss&atilde;o &agrave; 
      pessoa para digitar a frase-senha dela.<br>
      <br>
    </li>
    <li>Quando todos os propriet&aacute;rios estiverem listados, voc&ecirc; pode 
      especificar o n&uacute;mero de partes da chave que s&atilde;o necess&aacute;rios 
      para se decifrar ou assinar com esta chave.<br>
      <br>
      Na <a href="#3-7">figura 3-7</a>, por exemplo, o n&uacute;mero total de 
      partes que comp&otilde;e a chave de Administra&ccedil;&atilde;o &eacute; 
      quatro, e o n&uacute;mero total de partes requeridas para decifrar ou assinar 
      &eacute; tr&ecirc;s. Isto prov&ecirc; um &quot;plano de conting&ecirc;ncia&quot; 
      no evento de um dos propriet&aacute;rios estiver impossibilitado de prover 
      a parte dele na chave, ou esquecer a frase-senha.<br>
      <br>
      <div align="center"><a name="3-7"></a><img src="share_split_example.gif" width="351" height="348"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 3-7. A caixa 
        de di&aacute;logo &quot;Share Split&quot; (exemplo)</b></font></div>
      <br>
      <br>
      Por padr&atilde;o, cada propriet&aacute;rio &eacute; respons&aacute;vel 
      por uma parte. Para aumentar o n&uacute;mero de partes que um propriet&aacute;rio 
      possui, clique o nome do mesmo na lista de propriet&aacute;rios para exibi-lo 
      no campo de texto logo abaixo. Digite o novo n&uacute;mero de partes da chave ou
      use as setas para selecionar uma nova quantidade.<br>
      <br>
    </li>
    <li>Clique &quot;Split Key&quot;.<br>
      <br>
      Uma janela se abre e pede que voc&ecirc; selecione um diret&oacute;rio aonde 
      armazenar as partes.<br>
      <br>
    </li>
    <li>Selecione o local para armazenar as partes da chave.<br>
      <br>
      A janela &quot;Passphrase&quot; &eacute; aberta.<br>
      <br>
    </li>
    <li>Entre a frase-senha para a chave que voc&ecirc; quer dividir, e ent&atilde;o 
      clique OK.<br>
      <br>
      Uma caixa de di&aacute;logo de confirma&ccedil;&atilde;o se abre.<br>
      <br>
    </li>
    <li>Clique &quot;Sim&quot; para dividir a chave.<br>
      <br>
      A chave &eacute; dividida e as partes s&atilde;o armazenadas no local que 
      voc&ecirc; especificou. Cada parte da chave &eacute; armazenada com o nome 
      do propriet&aacute;rio como nome de arquivo e uma extens&atilde;o .SHF, 
      como mostrado no exemplo abaixo:<br><br>
      <div align="center"><img src="shf_files.gif" width="285" height="71"></div>
      <br><br>
    </li>
    <li>Distribua as partes da chave para os donos, ent&atilde;o apague as c&oacute;pias 
      locais. Uma vez que uma chave &eacute; dividida entre v&aacute;rios propriet&aacute;rios 
      e tenta-se assinar ou decifrar com ela, isto far&aacute; PGP tentar reunir 
      a chave automaticamente.<br>
      <br>
      Para aprender a reunir uma chave dividida para assinar ou decifrar arquivos, 
      veja <a href="5%20-%20Usando%20PGP%20para%20Armazenamento%20Seguro%20de%20Dados.htm#assinando_decifrando_arquivos_com_chave_dividida">&quot;Assinando 
      e decifrando arquivos com uma chave dividida&quot; na p&aacute;gina 73</a>.</li>
  </ol>
</ol>
<p>&nbsp;</p>
<p><b><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><a name="protegendo_chaves"></a>Protegendo 
  suas chaves</font></b></p>
<blockquote> 
  <p> Uma vez voc&ecirc; gerou um par de chave, &eacute; s&aacute;bio colocar 
    uma c&oacute;pia dela em um local seguro no caso de algo acontecer aos originais. 
    PGP pede que voc&ecirc; armazene uma c&oacute;pia de <i>backup</i> quando 
    voc&ecirc; fecha o programa PGPkeys ap&oacute;s criar um novo par de chaves.</p>
  <p>Suas chaves privadas e suas chaves p&uacute;blicas s&atilde;o armazenadas 
    em arquivos de chaveiro separados, os quais voc&ecirc; pode copiar como qualquer 
    outro arquivo para outro local em seu disco r&iacute;gido ou para um disquete. 
    Por padr&atilde;o, o chaveiro privado (secring.skr) e o chaveiro p&uacute;blico 
    (pubring.pkr) s&atilde;o armazenados juntos com os outros arquivos de programa 
    na pasta &quot;PGP Keyrings&quot; na pasta &quot;PGP 6.0&quot;, mas voc&ecirc; 
    pode armazenar seus <i>backups</i> em qualquer local que queira.</p>
  <p>Quando voc&ecirc; especifica que voc&ecirc; quer armazenar uma c&oacute;pia 
    <i>backup</i> de suas chaves, a janela &quot;Salvar Como&quot; aparece e lhe 
    pede para especifique o local para os arquivos de <i>backup</i> dos chaveiros 
    privados e p&uacute;blicos que ser&atilde;o criados.</p>
  <p>Al&eacute;m de fazer c&oacute;pias de seguran&ccedil;a de suas chaves, voc&ecirc; 
    deve ter cuidado especial a respeito de onde voc&ecirc; armazena sua chave 
    privada. Embora sua chave privada seja protegida por uma frase-senha que s&oacute; 
    voc&ecirc; deve saber, &eacute; poss&iacute;vel que algu&eacute;m possa descobrir 
    sua frase-senha e ent&atilde;o poderia usar sua chave privada para decifrar 
    seu email ou forjar sua assinatura digital. Por exemplo, algu&eacute;m possa 
    espiar sobre seus ombros e ver as teclas que voc&ecirc; pressiona ou 
    intercept&aacute;-las numa rede ou at&eacute; mesmo via ondas de ar.</p>
  <p>Para se prevenir de qualquer um que possa interceptar sua frase-senha de 
    usar sua chave privada, voc&ecirc; deve armazenar sua chave privada somente
    em seu pr&oacute;prio computador. Se seu computador est&aacute; ligado a uma 
    rede, voc&ecirc; deve tamb&eacute;m se certificar de que seus arquivos n&atilde;o 
    ser&atilde;o inclu&iacute;dos automaticamente em um <i>backup</i> completo 
    do sistema, onde outros poderiam ganhar acesso &agrave; sua chave privada. 
    Dada a facilidade com que computadores s&atilde;o acess&iacute;veis 
    em redes, se voc&ecirc; est&aacute; trabalhando com informa&ccedil;&otilde;es 
    extremamente sens&iacute;veis, voc&ecirc; pode querer manter sua chave privada 
    em um disquete que voc&ecirc; poder&aacute; inserir como uma &quot;chave comum&quot; 
    sempre que voc&ecirc; quiser ler ou assinar informa&ccedil;&otilde;es privativas.</p>
  <p>Como outra precau&ccedil;&atilde;o de seguran&ccedil;a, considere dar um 
    nome diferente para o arquivo de seu chaveiro privado e armazen&aacute;-lo 
    em um lugar diferente do diret&oacute;rio padr&atilde;o (pasta do PGP) onde 
    n&atilde;o ser&aacute; t&atilde;o f&aacute;cil de localizar. Voc&ecirc; usa 
    a &aacute;rea &quot;Files&quot; da janela &quot;Preferences&quot; de PGPkeys 
    para especificar um nome e localiza&ccedil;&atilde;o para seus arquivos de 
    chaveiro privados e p&uacute;blicos. </p>
</blockquote>
<p>&nbsp; </p>
<font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="distribuindo_chave_publica"></a>Distribuindo 
sua chave p&uacute;blica</b></font>
<blockquote> 
  <p>Depois que voc&ecirc; criou suas chaves, voc&ecirc; precisa torn&aacute;-las 
    dispon&iacute;veis para outros de forma que eles possam enviar a voc&ecirc; 
    informa&ccedil;&otilde;es codificadas e verificar sua assinatura digital. 
  </p>
  <p> Voc&ecirc; tem tr&ecirc;s op&ccedil;&otilde;es para distribuir sua chave 
    p&uacute;blica: </p>
  <ul>
    <li>Tornar sua chave p&uacute;blica dispon&iacute;vel atrav&eacute;s de um 
      Servidor P&uacute;blico de Chaves.<br>
      <br>
    </li>
    <li> Incluir sua chave p&uacute;blica em uma mensagem de email. <br>
      <br>
    </li>
    <li> Exportar sua chave p&uacute;blica ou copi&aacute;-la para um arquivo 
      de texto. </li>
  </ul>
  <p> Sua chave p&uacute;blica &eacute; basicamente composta por um bloco de texto, 
    assim &eacute; bastante f&aacute;cil torn&aacute;-la dispon&iacute;vel atrav&eacute;s 
    de um Servidor P&uacute;blico de Chaves, inclu&iacute;-la em uma mensagem 
    de email, ou export&aacute;-la copiando-a para um arquivo. O destinat&aacute;rio 
    pode ent&atilde;o usar qualquer dos m&eacute;todo que for mais conveniente 
    para adicionar sua chave p&uacute;blica ao chaveiro p&uacute;blico dele.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif"><a name="tornando_sua_chave_publica_disponivel_via_servidor"></a>Tornando 
  sua chave p&uacute;blica dispon&iacute;vel atrav&eacute;s de um Servidor de 
  Chaves</font></b></p>
<blockquote> 
  <p>O melhor m&eacute;todo para tornar dispon&iacute;vel sua chave p&uacute;blica 
    &eacute; coloc&aacute;-la em um Servidor P&uacute;blico de Chaves onde qualquer 
    um pode acess&aacute;-la. Deste modo, as pessoas podem lhe enviar email sem 
    ter que explicitamente pedir uma c&oacute;pia de sua chave. Tamb&eacute;m 
    poupa voc&ecirc; e outros de ter que manter um n&uacute;mero grande de chaves 
    p&uacute;blicas que voc&ecirc; raramente usa. H&aacute; v&aacute;rios servidores 
    de chaves no mundo, incluindo os oferecidos pela Network Associates, Inc., 
    onde voc&ecirc; pode tornar sua chave dispon&iacute;vel para qualquer um ter 
    acesso. Sua Gerente de Seguran&ccedil;a normalmente ir&aacute; previamente 
    configurar os par&acirc;metros de seu servidor de chaves de forma que tudo 
    funcione corretamente para seu escrit&oacute;rio.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif"><a name="para_enviar_chave_publica_a_servidor"></a>Para 
    enviar sua chave p&uacute;blica a um Servidor de Chaves </font></b></p>
  <ol>
    <li>Conecte-se &agrave; Internet.<br>
      <br>
    </li>
    <li>Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li> Selecione o &iacute;cone que representa a chave p&uacute;blica que voc&ecirc; 
      quer postar no Servidor de Chaves. <br>
      <br>
    </li>
    <li>Abra o menu &quot;Server&quot;, ent&atilde;o selecione o Servidor de Chaves 
      aonde voc&ecirc; quer postar, atrav&eacute;s do submenu &quot;Send To&quot;.</li>
  </ol>
  <p>Uma vez que voc&ecirc; colocar uma c&oacute;pia de sua chave p&uacute;blica 
    em um Servidor de Chaves, voc&ecirc; pode dizer &agrave;s pessoas que querem 
    enviar dados codificados a voc&ecirc; ou verificar sua assinatura digital 
    para obter uma c&oacute;pia de sua chave atrav&eacute;s do servidor. Mesmo 
    que voc&ecirc; n&atilde;o explicitamente os indique sua chave p&uacute;blica, 
    eles podem adquirir uma c&oacute;pia procurando o seu nome ou endere&ccedil;o 
    de email no Servidor de Chaves. Muitas pessoas incluem o endere&ccedil;o WWW 
    para a chave p&uacute;blica deles ao t&eacute;rmino das mensagens de email; 
    na maioria dos casos o destinat&aacute;rio pode simplesmente clicar duas vezes 
    o endere&ccedil;o para ter acesso a uma c&oacute;pia da chave no servidor. 
    Algumas pessoas chegam a colocar a Impress&atilde;o Digital de PGP (&quot;PGP 
    Fingerprint&quot;) delas em seus cart&otilde;es de visita para verifica&ccedil;&atilde;o 
    mais f&aacute;cil. </p>
</blockquote>
<p> <font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Atualizando 
  sua chave em um Servidor de Chaves </b></font> </p>
<blockquote> 
  <p> Se voc&ecirc; alguma vez precisar mudar seu endere&ccedil;o de email, ou 
    se voc&ecirc; adquirir novas assinaturas, tudo o que voc&ecirc; tem que fazer 
    para substituir sua chave antiga &eacute; enviar uma nova c&oacute;pia para 
    o servidor; a informa&ccedil;&atilde;o &eacute; atualizada automaticamente. 
    Por&eacute;m, voc&ecirc; deve manter em mente que Servidores de Chaves P&uacute;blicas 
    s&oacute; s&atilde;o capazes de atualizar novas informa&ccedil;&otilde;es, 
    e n&atilde;o permitir&atilde;o remover nomes de usu&aacute;rios ou assinaturas 
    de sua chave. Para remover assinaturas ou o nomes de usu&aacute;rio de sua 
    chave, veja <a href="#removendo_assinaturas_ou_nomes_associados">&quot;Removendo 
    assinaturas ou nomes de usu&aacute;rio associados com sua chave&quot; na p&aacute;gina 
    48</a> para instru&ccedil;&otilde;es. Se sua chave estiver comprometida, voc&ecirc; 
    pode revog&aacute;-la, o que diz ao mundo para n&atilde;o mais confiar naquela 
    vers&atilde;o de sua chave. Veja o <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm">Cap&iacute;tulo 
    6, &quot;Gerenciando Chaves e Configurando Prefer&ecirc;ncias&quot;</a> para 
    mais detalhes sobre como revogar uma chave.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif"><a name="removendo_assinaturas_ou_nomes_associados"></a>Removendo 
  assinaturas ou nomes de usu&aacute;rio associados com sua chave </font></b> 
</p>
<blockquote> 
  <p> Servidores de Chaves P&uacute;blicas s&oacute; s&atilde;o capazes de atualizar 
    novas informa&ccedil;&otilde;es, e n&atilde;o permitir&atilde;o remover nomes 
    de usu&aacute;rios ou assinaturas de sua chave. Se voc&ecirc; quer remover 
    assinaturas ou nomes de usu&aacute;rio associados com sua chave p&uacute;blica, 
    voc&ecirc; deve primeiro remover sua chave do servidor.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para apagar 
    sua chave de um Servidor de Certificados </font></b></p>
  <ol>
    <li> Abra a janela de PGPkeys. <br>
      <br>
    </li>
    <li>Escolha &quot;Search&quot; no menu &quot;Server&quot;, ou clique o bot&atilde;o 
      Procurar (<img src="key_search.gif" width="37" height="35" align="absmiddle">) 
      no menu de PGPkeys. <br>
      <br>
      A janela &quot;Search&quot; aparece. <br>
      <br>
    </li>
    <li>Escolha o servidor onde voc&ecirc; deseja procurar, usando o menu &quot;Search 
      For Keys On&quot;. <br>
      <br>
    </li>
    <li>Especifique seu crit&eacute;rio de procura para localizar sua chave p&uacute;blica:<br>
      <br>
      O padr&atilde;o &eacute; ID do usu&aacute;rio, mas voc&ecirc; pode clicar 
      as setas para selecionar ID da Chave, Status da Chave, Tipo de Chave, Tamanho 
      da Chave, Data de Cria&ccedil;&atilde;o, ou Data de Expira&ccedil;&atilde;o. 
      Por exemplo, voc&ecirc; poderia procurar todas as chaves que possuam ID 
      de Usu&aacute;rio de Fred. <br>
      <br>
    </li>
    <li>Para iniciar a procura, clique &quot;Search&quot;. <br>
      <br>
      Os resultados da procura aparecem na janela. <br>
      <br>
    </li>
    <li>Clique com o bot&atilde;o direito na chave que voc&ecirc; quer remover 
      do servidor, ent&atilde;o selecione &quot;Delete&quot;. <br>
      <br>
      A janela &quot;Passphrase&quot; aparece. <br>
      <br>
    </li>
    <li>Entre a frase-senha para a chave voc&ecirc; quer remover do servidor e 
      ent&atilde;o clique OK.<br>
      <br>
      Uma janela de confirma&ccedil;&atilde;o aparece e a chave &eacute; removida. 
      <br>
      <br>
    </li>
    <li>Se voc&ecirc; quer enviar uma chave atualizada a um Servidor de Certificados, 
      veja <a href="#tornando_sua_chave_publica_disponivel_via_servidor">&quot;Tornando 
      sua chave p&uacute;blica dispon&iacute;vel atrav&eacute;s de um Servidor 
      de Chaves&quot; na p&aacute;gina 47</a> para instru&ccedil;&otilde;es.</li>
  </ol>
  <p><b>ADVERT&Ecirc;NCIA</b>: Se voc&ecirc; apagar sua chave de um Servidor de 
    Certificado, voc&ecirc; deve estar ciente de que algu&eacute;m que possua 
    sua chave p&uacute;blica em seu chaveiro pode envi&aacute;-la novamente para 
    o servidor. Voc&ecirc; deve conferir o servidor periodicamente para ver se 
    a chave reapareceu - voc&ecirc; pode ter que apagar sua chave do servidor 
    mais de uma vez.</p>
</blockquote>
<p><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Incluindo 
  sua Chave P&uacute;blica em uma Mensagem de Email </b></font></p>
<blockquote> 
  <p> Outro m&eacute;todo conveniente para entregar sua chave p&uacute;blica a 
    algu&eacute;m &eacute; inclu&iacute;-la junto a uma mensagem de email. </p>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para Incluir 
    sua Chave P&uacute;blica em uma Mensagem de Email</b></font> </p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione seu par de chaves e ent&atilde;o escolha &quot;Copy&quot; no 
      menu &quot;Edit&quot;.<br>
      <br>
    </li>
    <li>Abra o editor que voc&ecirc; usa para compor suas mensagens de email, 
      coloque o cursor na &aacute;rea desejada, e ent&atilde;o clique &quot;Paste&quot; 
      no menu &quot;Edit&quot;. Em programas de email mais novos, voc&ecirc; pode 
      simplesmente arrastar sua chave da janela de PGPkeys no texto da mensagem 
      de email para transferir as informa&ccedil;&otilde;es da chave.</li>
  </ol>
  <p>Quando voc&ecirc; enviar sua chave p&uacute;blica para algu&eacute;m, certifique-se 
    de assinar o email. Desta forma, o destinat&aacute;rio pode verificar sua 
    assinatura e ter certeza de que ningu&eacute;m alterou a informa&ccedil;&atilde;o 
    no caminho. &Eacute; claro, se sua chave ainda n&atilde;o foi assinada por 
    algum apresentador de confian&ccedil;a, destinat&aacute;rios de sua assinatura 
    podem apenas ter certeza de que a assinatura &eacute; sua verificando a impress&atilde;o 
    digital de sua chave.</p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Exportando 
  sua chave p&uacute;blica para um arquivo</font></b></p>
<blockquote> 
  <p>Outro m&eacute;todo de distribuir sua chave p&uacute;blica &eacute; copi&aacute;-la 
    para um arquivo e ent&atilde;o tornar este arquivo dispon&iacute;vel para 
    a pessoa com que voc&ecirc; quer se comunicar.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para exportar 
    sua chave p&uacute;blica para um arquivo</font></b></p>
  <p>H&aacute; tr&ecirc;s formas de exportar ou armazenar sua chave p&uacute;blica 
    em um arquivo:</p>
  <ul>
    <li>Selecione o &iacute;cone que representa seu par de chaves na janela de 
      PGPkeys, ent&atilde;o clique &quot;Export&quot; no menu &quot;Keys&quot; 
      e entre o nome do arquivo para onde voc&ecirc; quer que sua chave seja armazenada.<br>
      <br>
    </li>
    <li>Selecione o &iacute;cone que representa seu par de chaves na janela de 
      PGPkeys, clique &quot;Copy&quot; no menu &quot;Edit&quot;, ent&atilde;o 
      clique &quot;Paste&quot; para inserir as informa&ccedil;&otilde;es da chave 
      em um documento texto.</li>
  </ul>
  <p> <b>NOTA</b>: Se voc&ecirc; estiver enviando sua chave para colegas que est&atilde;o 
    usando PCs, entre o nome com no m&aacute;ximo oito caracteres iniciais e tr&ecirc;s 
    caracteres adicionais para a extens&atilde;o do tipo de arquivo (por exemplo, 
    email.txt).</p>
</blockquote>
<p>&nbsp;</p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="obtendo_chaves_publicas_de_outros"></a>Obtendo 
  as chaves p&uacute;blicas de outros</b></font></p>
<blockquote> 
  <p>Da mesma forma que voc&ecirc; precisa distribuir sua chave p&uacute;blica 
    para aqueles que querem enviar email codificados para voc&ecirc;, ou verificar 
    sua assinatura digital, voc&ecirc; precisa obter a chave p&uacute;blica dos 
    outros de forma que voc&ecirc; possa enviar a eles email codificado ou verificar 
    as assinaturas digitais deles.</p>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para obter a 
    chave p&uacute;blica de algu&eacute;m</b></font></p>
  <p>H&aacute; tr&ecirc;s formas de se obter a chave p&uacute;blica de algu&eacute;m:</p>
  <ul>
    <li> Obter a chave de um servidor de chaves.<br>
      <br>
    </li>
    <li>Adicionar a chave p&uacute;blica a seu chaveiro diretamente de uma mensagem 
      de email.<br>
      <br>
    </li>
    <li>Importar a chave p&uacute;blica usando um arquivo exportado.</li>
  </ul>
  <p>Chaves p&uacute;blicas s&atilde;o apenas blocos de texto, portanto s&atilde;o 
    f&aacute;ceis de serem adicionadas a seu chaveiro importando-as de um arquivo 
    ou copiando-as de uma mensagem de email, e ent&atilde;o colando-as em seu 
    chaveiro p&uacute;blico.</p>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Obtendo 
  uma Chave de um Servidor de Chaves P&uacute;blicas </font></b></p>
<blockquote> 
  <p>Se as pessoa para quem voc&ecirc; quer enviar email codificado s&atilde;o 
    usu&aacute;rios experientes de PGP, h&aacute; chance de que eles tenham colocado 
    uma c&oacute;pia de sua chave p&uacute;blica em um servidor de chaves. Isto 
    torna muito conveniente para que voc&ecirc; adquira a c&oacute;pia mais atualizada 
    da chave da pessoa desejada sempre que voc&ecirc; quer lhe enviar um email, 
    e tamb&eacute;m poupa-lhe o trabalho de ter que armazenar muitas chaves em 
    seu chaveiro p&uacute;blico.</p>
  <p>Seu gerente de seguran&ccedil;a pode direcion&aacute;-lo a usar um servidor 
    de chaves corporativas que armazenam todas as chaves freq&uuml;entemente usadas 
    de sua organiza&ccedil;&atilde;o. Neste caso, seu PGP provavelmente j&aacute; 
    estar&aacute; configurado para acessar o servidor apropriado. </p>
  <p>Voc&ecirc; pode procurar por chaves em um servidor de chaves usando estes 
    m&eacute;todos:</p>
  <ul>
    <li>ID do usu&aacute;rio<br>
      <br>
    </li>
    <li>ID da chave<br>
      <br>
    </li>
    <li>Status da chave (revogada ou desabilitada)<br>
      <br>
    </li>
    <li>Tipo de chave (Diffie-Hellman ou RSA)<br>
      <br>
    </li>
    <li>Data de cria&ccedil;&atilde;o<br>
      <br>
    </li>
    <li> Data de expira&ccedil;&atilde;o<br>
      <br>
    </li>
    <li> Chaves revogadas<br>
      <br>
    </li>
    <li> Chaves desabilitadas<br>
      <br>
    </li>
    <li>Tamanho da chave<br>
      <br>
    </li>
    <li>Chaves assinadas por uma chave em particular</li>
  </ul>
  <p>O inverso da maioria destas opera&ccedil;&otilde;es tamb&eacute;m est&aacute; 
    dispon&iacute;vel. Por exemplo, voc&ecirc; pode pesquisar usando &quot;ID 
    do usu&aacute;rio n&atilde;o &eacute; Bob&quot; como seu crit&eacute;rio.</p>
  <p>Existem v&aacute;rios Servidores de Chaves P&uacute;blicas, como o que &eacute; 
    mantido pela Network Associates, Inc., onde voc&ecirc; pode localizar as chaves 
    da maioria dos usu&aacute;rios de PGP. Se o destinat&aacute;rio n&atilde;o 
    o apontou ao endere&ccedil;o WWW onde a chave dele(a) est&aacute; armazenada, 
    voc&ecirc; pode acessar qualquer servidor de chaves e pesquisar pelo nome 
    do usu&aacute;rio ou endere&ccedil;o de email, porque todos os servidores 
    de chave s&atilde;o regularmente atualizados para incluir as chaves armazenadas 
    em todos os outros servidores.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para obter a 
    chave p&uacute;blica de algu&eacute;m atrav&eacute;s de um servidor de chaves</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li> Escolha &quot;Search Server&quot; no menu &quot;Keys&quot;, ou clique 
      (<img src="key_search.gif" width="37" height="35" align="absmiddle">) para 
      abrir a caixa de di&aacute;logo &quot;Search&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Search&quot; aparece.<br>
      <br>
    </li>
    <li>Na caixa &quot;Search For Keys On&quot;, selecione a localiza&ccedil;&atilde;o 
      ou servidor aonde voc&ecirc; deseja procurar.<br>
      <br>
    </li>
    <li>Entre o crit&eacute;rio de procura a ser usado para localizar a chave 
      p&uacute;blica do usu&aacute;rio. Para refinar a procura, clique &quot;More 
      Choices&quot; para especificar crit&eacute;rios adicionais.</li>
  </ol>
  <p>Quando a chave p&uacute;blica for encontrada, voc&ecirc; pode examin&aacute;-la 
    na caixa de di&aacute;logo &quot;Search&quot; para certificar-se de que ela 
    &eacute; v&aacute;lida. Se voc&ecirc; decidir adicionar a chave a seu chaveiro 
    p&uacute;blico, arraste-a para a janela principal de PGPkeys.</p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Adicionando 
  chaves p&uacute;blicas a partir de mensagens de email</font></b></p>
<blockquote> 
  <p>Um modo conveniente de obter uma c&oacute;pia da chave p&uacute;blica de 
    algu&eacute;m &eacute; fazer com que a pessoa a inclua em uma mensagem de 
    email. Quando uma chave p&uacute;blica &eacute; enviada atrav&eacute;s de 
    chave p&uacute;blica , ela aparece como um bloco de texto no corpo da mensagem.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para adicionar 
    uma chave p&uacute;blica a partir de uma mensagem de email</font></b></p>
  <p>Execute um dos seguintes:</p>
  <ul>
    <li>Se voc&ecirc; tem um aplicativo de email que &eacute; suportado pelo plug-in 
      PGP, ent&atilde;o clique (<img src="bt_envelope_e_cadeado_abertos.gif" width="28" height="28" align="absmiddle">) 
      para adicionar a chave p&uacute;blica do emitente a seu chaveiro p&uacute;blico.<br>
      <br>
    </li>
    <li>Se voc&ecirc; est&aacute; usando um aplicativo de email que n&atilde;o 
      &eacute; suportado pelos plug-ins, voc&ecirc; pode adicionar a chave p&uacute;blica 
      ao chaveiro copiando o bloco de texto que representa a chave p&uacute;blica 
      e colar a mesma na janela de PGPkeys.</li>
  </ul>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Importando 
  uma chave p&uacute;blica de um arquivo</font></b></p>
<blockquote> 
  <p>Outro m&eacute;todo de obter a chave p&uacute;blica de algu&eacute;m &eacute; 
    fazer com que a pessoa salve-a para um arquivo do qual voc&ecirc; pode import&aacute;-la 
    ou copiar e col&aacute;-la em seu chaveiro p&uacute;blico.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para importar 
    uma chave p&uacute;blica de um arquivo</font></b></p>
  <p>H&aacute; tr&ecirc;s m&eacute;todos de extrair a chave p&uacute;blica de 
    algu&eacute;m e adicion&aacute;-la a seu chaveiro p&uacute;blico:</p>
  <ul>
    <li>Clique &quot;Import&quot; no menu &quot;Keys&quot; e ent&atilde;o localize 
      o arquivo onde a chave p&uacute;blica est&aacute; armazenada.<br>
      <br>
    </li>
    <li>Arraste o arquivo que cont&eacute;m a chave p&uacute;blica para a janela 
      principal de PGPkeys.<br>
      <br>
    </li>
    <li>Abra o documento texto onde a chave p&uacute;blica est&aacute; armazenada, 
      selecione o bloco de texto que representa a chave, e ent&atilde;o clique 
      &quot;Copy&quot; no menu &quot;Edit&quot;. V&aacute; &agrave; janela de 
      PGPkeys e clique &quot;Paste&quot; no menu &quot;Edit&quot; para copiar 
      a chave. A chave ent&atilde;o &eacute; mostrada como um &iacute;cone na 
      janela de PGPkeys.</li>
  </ul>
</blockquote>
<p>&nbsp;</p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="verificando_autenticidade"></a>Verificando 
  a autenticidade de uma chave</b></font></p>
<blockquote> 
  <p>Quando voc&ecirc; troca chaves com algu&eacute;m, &agrave;s vezes &eacute; 
    dif&iacute;cil dizer se a chave realmente pertence &agrave;quela pessoa. PGP 
    prov&ecirc; v&aacute;rios recursos de seguran&ccedil;a que lhe permitem checar 
    a autenticidade de uma chave e certificar que a chave pertence a um usu&aacute;rio 
    em particular (ou seja, <i>valid&aacute;-la</i>). PGP tamb&eacute;m lhe avisa 
    se voc&ecirc; tentar usar uma chave que n&atilde;o &eacute; v&aacute;lida 
    e tamb&eacute;m tem como padr&atilde;o alert&aacute;-lo quando voc&ecirc; 
    for usar uma chave marginalmente v&aacute;lida.</p>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Por qu&ecirc; 
    verificar a autenticidade de uma chave?</b></font></p>
  <p>Uma das maiores vulnerabilidades dos sistemas de criptografia por chave p&uacute;blica 
    &eacute; a habilidade de espi&otilde;es sofisticados montarem um ataque &quot;homem 
    no meio&quot; atrav&eacute;s da substitui&ccedil;&atilde;o da chave p&uacute;blica 
    de algu&eacute;m por uma que eles possuem. Desta forma eles podem interceptar 
    qualquer email codificado para esta pessoa, decifr&aacute;-la usando a chave 
    deles mesmos, e ent&atilde;o codific&aacute;-la novamente com a chave real 
    da pessoa e envi&aacute;-la para ela como se nada houvesse acontecido. De 
    fato, isto poderia ser feito automaticamente atrav&eacute;s de um programa 
    de computador sofisticado que ficaria no meio e decifraria todas as suas correspond&ecirc;ncias.</p>
  <p>Baseado neste cen&aacute;rio, voc&ecirc; a aqueles com quem voc&ecirc; deseja 
    trocar email precisam de uma forma de determinar se voc&ecirc;s realmente 
    possuem c&oacute;pias leg&iacute;timas da chave de cada um. A melhor forma 
    de se estar absolutamente certo que uma chave p&uacute;blica realmente pertence 
    a uma pessoa em particular &eacute; fazer com que o propriet&aacute;rio da 
    chave a copie para um disquete e ent&atilde;o fisicamente o entregue a voc&ecirc;. 
    Entretanto, voc&ecirc; raramente est&aacute; perto o suficiente para entregar 
    pessoalmente o disquete a algu&eacute;m; voc&ecirc;s geralmente trocam chaves 
    p&uacute;blicas via email ou as obt&eacute;m atrav&eacute;s de um servidor 
    de chaves p&uacute;blicas. </p>
  <p> <font color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="verificando_com_impressao_digital"></a>Verificando 
    com uma impress&atilde;o digital</b></font></p>
  <p>Voc&ecirc; pode determinar se uma chave realmente pertence a uma pessoa em 
    particular checando a impress&atilde;o digital da chave, que &eacute; uma 
    s&eacute;rie &uacute;nica de n&uacute;meros gerados quando a chave &eacute; 
    criada. Comparando a impress&atilde;o digital da sua c&oacute;pia da chave 
    p&uacute;blica de algu&eacute;m com a impress&atilde;o digital da chave original, 
    voc&ecirc; pode estar absolutamente certo de que voc6e realmente possui uma 
    c&oacute;pia v&aacute;lida daquela chave. Para aprender como verificar com 
    uma impress&atilde;o digital, veja <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm#verificando_chave_publica_de_alguem">&quot;Verificando 
    a chave p&uacute;blica de algu&eacute;m&quot; na p&aacute;gina 89</a>.</p>
</blockquote>
<p>&nbsp;</p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="assinando_chave_publica"></a>Assinando 
  a chave p&uacute;blica</b></font></p>
<blockquote> 
  <p>Uma vez que voc&ecirc; est&aacute; absolutamente convencido de que possui 
    uma c&oacute;pia leg&iacute;tima da chave p&uacute;blica de algu&eacute;m, 
    voc&ecirc; poder&aacute; ent&atilde;o assinar a chave daquela pessoa. Assinando 
    a chave p&uacute;blica de algu&eacute;m com sua chave privada, voc&ecirc; 
    est&aacute; certificando ter certeza de que aquela chave pertence ao usu&aacute;rio 
    alegado. Por exemplo, quando voc&ecirc; cria uma nova chave, ela &eacute; 
    automaticamente certificada com sua pr&oacute;pria assinatura digital. Por 
    padr&atilde;o, assinaturas que voc&ecirc; cria em outras chaves n&atilde;o 
    s&atilde;o export&aacute;veis, o que significa que elas aplicam-se apenas 
    &agrave; chave quando ela est&aacute; em seu chaveiro local. Para instru&ccedil;&otilde;es 
    detalhadas sobre assinar uma chave, veja <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm#assinando_chave_publica_de_alguem">&quot;Assinando 
    a chave p&uacute;blica de algu&eacute;m&quot; na p&aacute;gina 90</a>.</p>
</blockquote>
<p>&nbsp; </p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="obtendo_chaves_via_apresentadores_confiaveis"></a>Obtendo 
  chaves p&uacute;blicas a partir de apresentadores de confian&ccedil;a</b></font></p>
<blockquote> 
  <p>Usu&aacute;rios de PGP geralmente possuem outros usu&aacute;rios de confian&ccedil;a 
    para assinar suas chaves p&uacute;blicas para atestar sua autenticidade. Por 
    exemplo, voc&ecirc; poderia enviar a um colega de confian&ccedil;a uma c&oacute;pia 
    de sua chave p&uacute;blica, com um pedido de que ele/ela certifique-a e retorne-a 
    a voc&ecirc;, de forma que voc&ecirc; possa incluir a assinatura quando postar 
    sua chave em um servidor de chaves p&uacute;blicas. Usando PGP, quando algu&eacute;m 
    obt&eacute;m uma c&oacute;pia da sua chave p&uacute;blica, eles n&atilde;o 
    precisam checar a autenticidade da chave eles mesmos, mas ao inv&eacute;s 
    podem basear-se em o quanto eles confiam na(s) pessoa(s) que assinou/assinaram 
    sua chave. PGP prov&ecirc; os meios de estabelecer um n&iacute;vel de validade 
    para cada um das chaves p&uacute;blicas que voc&ecirc; adiciona a seu chaveiro 
    p&uacute;blico, e mostra o n&iacute;vel de confian&ccedil;a e validade associado 
    a cada chave na janela de PGPkeys. Isto significa que quando voc&ecirc; obt&eacute;m 
    a chave de algu&eacute;m cuja chave &eacute; assinada por um apresentador 
    de confian&ccedil;a, voc&ecirc; pode estar bem certo de que a chave pertence 
    o usu&aacute;rio alegado. Para detalhes sobre como assinar chaves e validar 
    usu&aacute;rios, veja <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm#assinando_chave_publica_de_alguem">&quot;Assinando 
    a chave p&uacute;blica de algu&eacute;m&quot; na p&aacute;gina 90</a>.</p>
  <p>Seu Gerente de Seguran&ccedil;a pode agir como um apresentador de seguran&ccedil;a, 
    e voc&ecirc; pode ent&atilde;o confiar em qualquer chave assinada pela chave 
    corporativa como sendo uma chave v&aacute;lida. Se voc&ecirc; trabalha em 
    uma grande companhia com diversos locais, voc&ecirc; pode ter apresentadores 
    regionais, e seu Gerente de Seguran&ccedil;a pode ser um meta-apresentador, 
    ou um apresentador de confian&ccedil;a de apresentadores de confian&ccedil;a.</p>
</blockquote>
</body>
</html>
