<html>
<head>
<title>Enviando e Recebendo EMail Seguro</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style></head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Enviando 
        e Recebendo EMail Seguro</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>4</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Este cap&iacute;tulo explica como codificar e assinar o email que voc&ecirc; 
    envia a outros e decifrar e verificar o email que outros enviam a voc&ecirc;. 
  </p>
</blockquote>
<p>&nbsp;</p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="codificando_e_assinando_email"></a>Codificando 
  e assinando email</b></font></p>
<blockquote> 
  <p>H&aacute; tr&ecirc;s formas de codificar e assinar mensagens de email. A 
    forma mais r&aacute;pida e f&aacute;cil de codificar e assinar email &eacute; 
    com um aplicativo suportado pelos plug-ins de email de PGP. Apesar dos procedimentos 
    variarem um pouco entre diferentes aplicativos de email, voc&ecirc; executa 
    o processo de codificar e assinar clicando os bot&otilde;es apropriados na 
    barra de ferramentas do aplicativo. Se voc&ecirc; estiver usando um aplicativo 
    de email que n&atilde;o &eacute; suportado pelos plug-ins de PGP, voc&ecirc; 
    pode codificar e assinar suas mensagens de email via &Aacute;rea de Transfer&ecirc;ncia 
    de Windows, selecionando a op&ccedil;&atilde;o apropriada do &iacute;cone 
    da fechadura na bandeja de sistema. Para incluir arquivos anexos, voc&ecirc; 
    codifica os arquivos atrav&eacute;s do Windows Explorer antes de anex&aacute;-los.</p>
  <p><b>DICA</b>: Se voc&ecirc; est&aacute; enviando email sens&iacute;vel, considere 
    deixar a linha de assunto em branco ou criar uma linha de assunto que n&atilde;o 
    revele o conte&uacute;do da mensagem codificada. </p>
  <p>Se voc&ecirc; n&atilde;o possui um dos aplicativos de email suportados por 
    PGP, veja o <a href="5%20-%20Usando%20PGP%20para%20Armazenamento%20Seguro%20de%20Dados.htm">Cap&iacute;tulo 
    5</a> para informa&ccedil;&otilde;es sobre como codificar arquivos. </p>
  <p>Como alternativa ao uso dos plug-ins, voc&ecirc; pode usar PGPtools para 
    codificar e assinar seus textos de email e anexos antes de envi&aacute;-los, 
    veja <a href="#codificar_e_assinar_com_PGPtools">&quot;Para codificar e assinar 
    usando PGPtools&quot; na p&aacute;gina 59</a>.</p>
</blockquote>
<p><b><font color="#A00048" size="5" face="Arial, Helvetica, sans-serif">Codificando 
  e assinando com os aplicativos de email suportados</font></b></p>
<blockquote> 
  <p>Quando voc&ecirc; codifica e assina com um aplicativo de email que &eacute; 
    suportado pelos plug-ins de PGP, voc&ecirc; tem duas escolhas, dependendo 
    do tipo de aplicativo de email que o destinat&aacute;rio est&aacute; usando. 
    Se voc&ecirc; est&aacute; se comunicando com outros usu&aacute;rios de PGP 
    que possuem um aplicativo de email que suporta o padr&atilde;o PGP/MIME, voc&ecirc; 
    pode tomar vantagem de um recurso de PGP/MIME para codifica e assina suas 
    mensagens de email e quaisquer arquivos anexos automaticamente quando os enviar. 
    Se voc&ecirc; est&aacute; se comunicando com algu&eacute;m que n&atilde;o 
    possui um aplicativo de email compat&iacute;vel com PGP/MIME, voc&ecirc; deve 
    codificar seu email com PGP/MIME desligado para evitar qualquer problema de 
    compatibilidade. Veja a <a href="#tabela4-1">tabela 4-1, &quot;Recursos de 
    Plug-in de PGP&quot;</a>, para uma lista de plug-ins e seus recursos.</p>
  <p><b><font size="2" face="Arial, Helvetica, sans-serif"><a name="tabela4-1"></a>Tabela 
    4-1. Recursos de Plug-in de PGP</font></b></p>
</blockquote>
<table width="75%" border="0" cellspacing="8" align="center">
  <tr> 
    <td width="29%">&nbsp;</td>
    <th width="14%" nowrap>Eudora 3.0.x</th>
    <th width="15%" nowrap>Eudora 4.0.x</th>
    <th width="21%" nowrap>Exchange/Outlook</th>
    <th width="21%" nowrap>Outlook Express</th>
  </tr>
  <tr> 
    <td colspan="5"> 
      <hr size="2" noshade>
    </td>
  </tr>
  <tr> 
    <td width="29%"><b>PGP/MIME</b></td>
    <td width="14%">Sim</td>
    <td width="15%">Sim</td>
    <td width="21%">N&atilde;o</td>
    <td width="21%">N&atilde;o</td>
  </tr>
  <tr> 
    <td width="29%"><b>Auto-decifrar</b></td>
    <td width="14%">Sim</td>
    <td width="15%">N&atilde;o</td>
    <td width="21%">Sim</td>
    <td width="21%">Sim</td>
  </tr>
  <tr> 
    <td width="29%"><b>Codificar HTML</b></td>
    <td width="14%">N/D</td>
    <td width="15%">Sim</td>
    <td width="21%">converte para texto puro antes de codificar</td>
    <td width="21%">N&atilde;o</td>
  </tr>
  <tr> 
    <td width="29%"><b>Ver HTML decifrado como documento HTML</b></td>
    <td width="14%">N&atilde;o</td>
    <td width="15%">Sim</td>
    <td width="21%">N&atilde;o</td>
    <td width="21%">N&atilde;o</td>
  </tr>
  <tr> 
    <td width="29%"><b>Codificar anexos</b></td>
    <td width="14%">Sim</td>
    <td width="15%">Sim</td>
    <td width="21%">Sim</td>
    <td width="21%">N&atilde;o</td>
  </tr>
  <tr> 
    <td width="29%"><b>Padr&otilde;es para codificar/assinar</b></td>
    <td width="14%">Sim</td>
    <td width="15%">Sim</td>
    <td width="21%">Sim</td>
    <td width="21%">Sim</td>
  </tr>
</table>
<blockquote> 
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="para_codificar_e_assinar_com_apps_suportados"></a>Para 
    codificar e assinar com aplicativos de email suportados</b></font></p>
  <ol>
    <li> Use seu aplicativo de email para compor sua mensagem de email como normalmente 
      faria.<br>
      <br>
    </li>
    <li> Quando tiver terminado de compor o texto da sua mensagem de email, clique 
      (<img src="envelope_and_lock.gif" width="26" height="25" align="absmiddle">) 
      para codificar o texto de sua mensagem, e ent&atilde;o clique (<img src="pen_and_paper.gif" width="26" height="25" align="absmiddle">) 
      para assinar a mensagem. 
      <p><b>NOTA</b>: Se voc&ecirc; sabe que ir&aacute; usar PGP/MIME regularmente, 
        voc&ecirc; pode deix&aacute;-lo ativo selecionando a configura&ccedil;&atilde;o 
        apropriada no painel &quot;email&quot; da janela &quot;Preferences&quot;.</p>
    </li>
    <li> Envie sua mensagem como normalmente faria. 
      <p> Se voc&ecirc; possui uma c&oacute;pia das chaves p&uacute;blicas de 
        cada um dos destinat&aacute;rios, as chaves apropriadas s&atilde;o usadas. 
        Entretanto, se voc&ecirc; especificar um destinat&aacute;rio para quem 
        n&atilde;o h&aacute; uma chave p&uacute;blica correspondente ou uma ou 
        mais das chaves possuem validade insuficiente, a caixa de di&aacute;logo 
        &quot;PGP Key Selection&quot; aparece (<a href="#4-1">Figura 4-1</a>) 
        de forma que voc&ecirc; possa especificar a chave correta.</p>
      <div align="center"><a name="4-1"></a><img src="recipients.gif" width="420" height="307"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 4-1. A janela 
        &quot;Recipients&quot;</b></font></div>
      <br>
    </li>
    <li> Arraste as chaves p&uacute;blicas daqueles que ir&atilde;o receber uma 
      c&oacute;pia da mensagem de email codificada na lista de destinat&aacute;rios. 
      Voc&ecirc; pode tamb&eacute;m dar um duplo clique em qualquer uma das chaves 
      para mov&ecirc;-las de uma &aacute;rea da tela para outra. O &iacute;cone 
      de validade (&quot;Validity&quot;) indica o n&iacute;vel m&iacute;nimo de 
      confian&ccedil;a de que as chaves p&uacute;blicas na lista de Destinat&aacute;rios 
      s&atilde;o v&aacute;lidas. A validade &eacute; baseada nas assinaturas associadas 
      com a chave. Veja o <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm">cap&iacute;tulo 
      6, &quot;Gerenciando Chaves e Configurando Prefer&ecirc;ncias&quot;</a>, 
      para detalhes.<br>
      <br>
    </li>
    <li> Selecione a op&ccedil;&atilde;o de criptografia convencional (&quot;Conventional 
      Encrypt&quot;) para usar uma frase-senha comum ao inv&eacute;s da criptografia 
      por chaves p&uacute;blicas. Se voc&ecirc; selecionar esta op&ccedil;&atilde;o, 
      o arquivo &eacute; codificado usando uma chave de sess&atilde;o, que codifica 
      (e decifra) usando uma frase-senha que lhe ser&aacute; pedida.<br>
      <br>
    </li>
    <li> Selecione a op&ccedil;&atilde;o de visualizador seguro (&quot;Secure 
      Viewer&quot;) para proteger os dados de ataques &quot;TEMPEST&quot; quando 
      da decifra&ccedil;&atilde;o. Se voc&ecirc; selecionar esta op&ccedil;&atilde;o, 
      os dados decifrados s&atilde;o mostrados em uma fonte especial para preven&ccedil;&atilde;o 
      de ataques TEMPEST que &eacute; ileg&iacute;vel para equipamentos de captura 
      de radia&ccedil;&atilde;o. Para mais informa&ccedil;&otilde;es sobre os 
      ataques TEMPEST, veja <a href="C%20-%20Phil%20Zimmermann%20sobre%20PGP.htm#vulnerabilidades">&quot;Vulnerabilidades&quot; 
      na p&aacute;gina 158</a>. 
      <p><b>NOTA</b>: 
        A op&ccedil;&atilde;o do visualizador seguro pode n&atilde;o ser compat&iacute;vel 
        com vers&otilde;es anteriores de PGP. Arquivos codificados com esta op&ccedil;&atilde;o 
        habilitada podem ser decifrados por vers&otilde;es anteriores de PGP, 
        entretanto este recurso pode ser ignorado.</p>
    </li>
    <li> Clique OK para codificar e assinar seu email. Se voc&ecirc; escolheu 
      assinar os dados codificados, a caixa de di&aacute;logo &quot;Signing Key 
      Passphrase&quot; aparece, como na <a href="#4-2">figura 4-2</a>, pedindo 
      sua frase-senha antes do email ser enviado. <br>
      <br>
      <div align="center"><a name="4-2"></a><img src="passphrase.gif" width="292" height="136"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 4-2. Caixa 
        de di&aacute;logo &quot;Signing Key Passphrase&quot;<br>
        <br>
        </b></font></div>
    </li>
    <li> Entre sua frase-senha e ent&atilde;o clique OK. 
      <p><b>ATEN&Ccedil;&Atilde;O</b>: Se voc&ecirc; n&atilde;o enviar seu email 
        imediatamente, mas ao inv&eacute;s armazen&aacute;-lo em sua Caixa de 
        Sa&iacute;da, voc&ecirc; deve ficar ciente de que quando usando alguns 
        aplicativos de email, a informa&ccedil;&atilde;o n&atilde;o &eacute; codificada 
        at&eacute; que o email seja realmente transmitido. Antes de colocar em 
        fila mensagens codificadas, voc&ecirc; deve verificar se seu aplicativo 
        realmente codifica as mensagens em sua caixa de sa&iacute;da. Se n&atilde;o 
        o fizer, voc&ecirc; pode usar PGPtray para codificar sua mensagem antes 
        de coloc&aacute;-la em fila na caixa de sa&iacute;da.</p>
    </li>
  </ol>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif"><a name="codificar_e_assinar_com_PGPtools"></a>Para 
    codificar e assinar texto usando PGPtools</font></b></p>
  <ol>
    <li> Copie o texto que voc&ecirc; quer codificar e assinar para a &Aacute;rea 
      de Transfer&ecirc;ncia.<br>
      <br>
    </li>
    <li> Arraste o texto para os bot&otilde;es &quot;Encrypt&quot; (codificar), 
      &quot;Sign&quot; (assinar), ou &quot;Encrypt and Sign&quot; (codificar e 
      assinar) na janela de PGPtools. <br>
      <br>
      <div align="center"><img src="pgptools_window.gif" width="345" height="80"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 4-3. A janela 
        de PGPtools</b></font></div>
      <br>
      A caixa de di&aacute;logo &quot;PGP Key Recipients&quot; (Destinat&aacute;rios 
      das Chaves) aparece (<a href="#4-1">figura 4-1</a>).<br>
      <br>
    </li>
    <li> Arraste as chaves p&uacute;blicas daqueles que ir&atilde;o receber uma 
      c&oacute;pia da mensagem de email codificada para a lista de Destinat&aacute;rios. 
      Voc&ecirc; tamb&eacute;m pode dar um duplo clique em qualquer uma das chaves 
      para mov&ecirc;-la de uma &aacute;rea da tela para outra. O &iacute;cone 
      de Validade indica o n&iacute;vel m&iacute;nimo de confian&ccedil;a que 
      aquela chave p&uacute;blica na lista de destinat&aacute;rios &eacute; v&aacute;lida. 
      Esta validade &eacute; baseada nas assinaturas associadas com a chave. Veja 
      o <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm">Cap&iacute;tulo 
      6, &quot;Gerenciando Chaves e Configurando Prefer&ecirc;ncias&quot;</a>, 
      para detalhes.<br>
      <br>
    </li>
    <li> Selecione a op&ccedil;&atilde;o &quot;Conventional Encrypt&quot; (codifica&ccedil;&atilde;o 
      convencional) para usar uma frase-senha comum ao inv&eacute;s da criptografia 
      por chave p&uacute;blica. Se voc&ecirc; selecionar esta op&ccedil;&atilde;o, 
      o arquivo &eacute; codificado usando uma chave de sess&atilde;o, que codifica 
      (e decifra) usando uma frase-senha que lhe ser&aacute; pedida para escolher.<br>
      <br>
    </li>
    <li> Selecione a op&ccedil;&atilde;o &quot;Secure Viewer&quot; (visualizador 
      seguro) para proteger os dados de ataques TEMPEST quando decifrando-os. 
      Se voc&ecirc; selecionar esta op&ccedil;&atilde;o, os dados decifrados s&atilde;o 
      exibidos em uma fonte especial que previne ataques TEMPEST que &eacute; 
      ileg&iacute;vel para equipamentos de captura de radia&ccedil;&atilde;o. 
      Para mais informa&ccedil;&otilde;es sobre ataques TEMPEST, veja <a href="C%20-%20Phil%20Zimmermann%20sobre%20PGP.htm#vulnerabilidades">&quot;Vulnerabilidades&quot; 
      na p&aacute;gina 158</a>.<br>
      <br>
      <b>NOTA</b>: A op&ccedil;&atilde;o &quot;Secure Viewer&quot; pode n&atilde;o 
      ser compat&iacute;vel com vers&otilde;es anteriores de PGP. Arquivos codificados 
      com esta op&ccedil;&atilde;o habilitada podem ser decifrados por vers&otilde;es 
      anteriores de PGP, entretanto este recurso pode ser ignorado.<br>
      <br>
    </li>
    <li> Clique OK para codificar e assinar sua correspond&ecirc;ncia.<br>
      <br>
      Se voc&ecirc; escolheu assinar os dados codificados, a caixa de di&aacute;logo 
      &quot;Signing Key Passphrase&quot; ir&aacute; aparecer, como mostrado na 
      <a href="#4-2">figura 4-2</a>, pedindo sua frase-senha antes de enviar a 
      correspond&ecirc;ncia<br>
      <br>
    </li>
    <li> Entre sua frase-senha e ent&atilde;o clique OK.<br>
      <br>
    </li>
    <li> Cole o texto em sua mensagem de email, ent&atilde;o envie a mensagem.</li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="5" color="#A00048" face="Arial, Helvetica, sans-serif">Codificando 
  email para grupos de destinat&aacute;rios</font></b></p>
<blockquote> 
  <p>Voc&ecirc; pode usar PGP para criar uma lista de grupos de distribui&ccedil;&atilde;o. 
    Por exemplo, se voc&ecirc; quer enviar email codificado para 10 pessoas em 
    engenharia@companhia.com, voc&ecirc; poderia criar uma lista de distribui&ccedil;&atilde;o 
    com este nome. O menu &quot;Groups&quot; em PGPkeys cont&eacute;m uma op&ccedil;&atilde;o 
    &quot;Show Groups&quot; (exibir grupos) que alterna a exibi&ccedil;&atilde;o 
    da janela de grupos em PGPkeys.</p>
  <p><b>NOTA</b>: Se voc&ecirc; pretende codificar informa&ccedil;&otilde;es para 
    todos os membros de uma lista de distribui&ccedil;&atilde;o de email, voc&ecirc; 
    deve criar um grupo PGP com o mesmo nome da lista, e incluir os mesmos membros 
    da lista de distribui&ccedil;&atilde;o de email. Por exemplo, se h&aacute; 
    uma lista staff@companhia.com configurado em seu aplicativo de email, voc&ecirc; 
    deve criar um grupo staff@companhia.com em PGP.</p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><a name="trabalhando_com_listas"></a>Trabalhando 
  com listas de distribui&ccedil;&otilde;es</font></b></p>
<blockquote> 
  <p>Use o recurso de grupos para criar listas de distribui&ccedil;&otilde;es 
    e para editar a lista de pessoas para quem voc&ecirc; deseja enviar email 
    codificado.</p>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para criar um 
    grupo (lista de distribui&ccedil;&atilde;o)</b></font></p>
  <ol>
    <li> Escolha &quot;Show Group&quot; (Exibir Grupo) no menu &quot;Groups&quot;.<br>
      <br>
    </li>
    <li>Escolha &quot;New Group&quot; (Novo Grupo) no menu &quot;Groups&quot;.<br>
      <br>
    </li>
    <li>Entre o nome para a lista de distribui&ccedil;&atilde;o. Opcionalmente, 
      entre uma descri&ccedil;&atilde;o para o grupo. Por exemplo, voc&ecirc; 
      pode nomear o grupo como &quot;todomundo@companhia.com&quot; com a descri&ccedil;&atilde;o 
      &quot;Todos os funcion&aacute;rios&quot;.<br>
      <br>
    </li>
    <li>Clique OK para criar a lista de distribui&ccedil;&atilde;o.<br>
      <br>
      A lista de grupos de distribui&ccedil;&atilde;o &eacute; salva como um grupo 
      PGP na pasta &quot;PGP Preferences&quot; e a lista &eacute; adicionada a 
      seu chaveiro.<br>
    </li>
  </ol>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para adicionar 
    membros a uma lista de distribui&ccedil;&atilde;o</font></b></p>
  <ol>
    <li> Na janela PGPkeys, selecione os usu&aacute;rios ou listas que voc&ecirc; 
      deseja adicionar &agrave; sua lista de distribui&ccedil;&atilde;o.<br>
      <br>
    </li>
    <li> Arraste os usu&aacute;rios da janela de PGPkeys para a lista de distribui&ccedil;&atilde;o 
      desejada, na janela de grupos.<br>
      <br>
      <b>NOTA</b>: Membros em uma lista de distribui&ccedil;&atilde;o podem ser 
      adicionados a outras listas de distribui&ccedil;&otilde;es.</li>
  </ol>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para remover 
    membros de uma lista de distribui&ccedil;&atilde;o</b></font></p>
  <ol>
    <li>Dentro da lista de distribui&ccedil;&atilde;o, selecione o membro a ser 
      removido.<br>
      <br>
    </li>
    <li> Pressione a tecla &quot;Delete&quot;.<br>
      <br>
      PGP pede que voc&ecirc; confirme sua escolha.<br>
    </li>
  </ol>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para remover 
    uma lista de distribui&ccedil;&atilde;o</b></font></p>
  <ol>
    <li> Selecione a lista de distribui&ccedil;&atilde;o a ser removida na janela 
      de grupos.<br>
      <br>
    </li>
    <li>Pressione a tecla &quot;Delete&quot;.</li>
  </ol>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para adicionar 
    uma lista de distribui&ccedil;&atilde;o a outra lista de distribui&ccedil;&atilde;o</font></b></p>
  <p>1. Selecione a lista de distribui&ccedil;&atilde;o que voc&ecirc; deseja 
    adicionar a outra lista.</p>
  <p>2. Arrasta a lista selecionada para a lista aonde ela ser&aacute; adicionada.</p>
</blockquote>
<p><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Enviando 
  email codificado e assinado para listas de distribui&ccedil;&atilde;o</b></font></p>
<blockquote> 
  <p>Voc&ecirc; pode enviar email codificado para grupos de destinat&aacute;rios 
    uma vez que suas listas de distribui&ccedil;&atilde;o de PGP foram criadas. 
    Veja <a href="#trabalhando_com_listas">&quot;Trabalhando com listas de distribui&ccedil;&otilde;es&quot; 
    na p&aacute;gina 61</a> para mais informa&ccedil;&otilde;es sobre cria&ccedil;&atilde;o 
    e edi&ccedil;&atilde;o de listas de distribui&ccedil;&atilde;o.</p>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para enviar 
    email codificado e assinado a uma lista de distribui&ccedil;&atilde;o</b></font></p>
  <ol>
    <li> Aderece a correspond&ecirc;ncia para sua listas de distribui&ccedil;&atilde;o 
      de correspond&ecirc;ncias.<br>
      <br>
      O nome da sua listas de distribui&ccedil;&atilde;o codificada deve corresponder 
      ao nome da listas de distribui&ccedil;&atilde;o de email.<br>
      <br>
    </li>
    <li> Use seu aplicativo de email para compor sua mensagem de email como normalmente 
      faria.<br>
      <br>
    </li>
    <li> Quando voc&ecirc; tiver terminado de compor o texto da sua mensagem de 
      email, clique (<img src="envelope_and_lock.gif" width="26" height="25" align="absmiddle">) 
      para codificar o texto da sua mensagem, ent&atilde;o clique (<img src="pen_and_paper.gif" width="26" height="25" align="absmiddle">) 
      para assinar a mensagem.<br>
      <br>
      A caixa de di&aacute;logo &quot;PGP Key Recipients&quot; surge (<a href="#4-1">figura 
      4-1</a>). Voc&ecirc; seleciona as chaves p&uacute;blicas dos destinat&aacute;rios 
      para o texto que est&aacute; codificando ou assinando. As op&ccedil;&otilde;es 
      dispon&iacute;veis est&atilde;o descritas em <a href="#para_codificar_e_assinar_com_apps_suportados">&quot;Para 
      codificar e assinar com aplicativos de email suportados&quot; na p&aacute;gina 
      57</a>.<br>
      <br>
    </li>
    <li> Envie a mensagem.</li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="decifrando_e_verificando_email"></a>Decifrando 
  e verificando email</b></font></p>
<blockquote> 
  <p>A forma mais r&aacute;pida e f&aacute;cil de decifrar e verificar email enviado 
    a voc&ecirc; &eacute; com um aplicativo suportado pelos plug-ins de email 
    de PGP. Apesar dos procedimentos variarem um pouco entre diferentes aplicativos 
    de email, quando voc&ecirc; est&aacute; usando um aplicativo de email suportado 
    pelos plug-ins, voc&ecirc; pode executar as opera&ccedil;&otilde;es de decifrar 
    e verificar clicando o &iacute;cone do envelope em sua mensagem ou na barra 
    de ferramentas do seu aplicativo. Em alguns casos voc&ecirc; talvez ir&aacute; 
    precisar selecionar Decrypt/Verify do menu em seu aplicativo de email. Al&eacute;m 
    disso, se voc&ecirc; estiver usando um aplicativo que suporta o padr&atilde;o 
    PGP/MIME, voc&ecirc; pode decifrar e verificar suas mensagens de email como 
    tamb&eacute;m quaisquer arquivos anexos clicando o &iacute;cone anexado &agrave; 
    sua mensagem.</p>
  <p>Se voc&ecirc; estiver usando um aplicativo de email que n&atilde;o &eacute; 
    suportado pelos plug-ins de PGP, voc&ecirc; pode decifrar e verificar suas 
    mensagens de email via PGPtray. Al&eacute;m disso, se seu email inclui arquivos 
    anexos codificados, voc&ecirc; deve decifr&aacute;-los separadamente usando 
    PGPtools ou PGPtray.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para decifrar 
    e verificar a partir de aplicativos de email suportados</font></b></p>
  <ol>
    <li> Abra sua mensagem de email como voc&ecirc; normalmente faria.<br>
      <br>
      Voc&ecirc; ver&aacute; um bloco de texto cifrado inintelig&iacute;vel no 
      corpo de sua mensagem de email.<br>
      <br>
    </li>
    <li> Copie o texto cifrado para a &Aacute;rea de Transfer&ecirc;ncia.<br>
      <br>
    </li>
    <li>Para decifrar e verificar a mensagem, fa&ccedil;a um dos seguintes: <br>
      <br>
      <ul>
        <li> Se voc&ecirc; est&aacute; se comunicando com outros usu&aacute;rios 
          de PGP, e eles codificaram e assinaram suas correspond&ecirc;ncias usando 
          o padr&atilde;o PGP/MIME, d&ecirc; um clique duplo no &iacute;cone do 
          envelope com cadeado (<img src="envelope_and_lock.gif" width="26" height="25" align="absmiddle">).<br>
          <br>
        </li>
        <li> Se voc&ecirc; est&aacute; recebendo email de algu&eacute;m que n&atilde;o 
          est&aacute; usando um aplicativo de email compat&iacute;vel com PGP/MIME, 
          clique o &iacute;cone do envelope aberto (<img src="envelope_aberto.gif" width="22" height="23" align="absmiddle">) 
          na barra de ferramentas do seu aplicativo, ou clique &quot;Decrypt/Verify 
          Clipboard&quot; (Decifrar/Verificar &Aacute;rea de Transfer&ecirc;ncia) 
          no menu &quot;Plugins&quot;.<br>
          <br>
          Para decifrar e verificar arquivos anexados, decifre-os separadamente 
          usando PGPtools ou PGPtray.</li>
      </ul>
      <br>
        A caixa de di&aacute;logo &quot;PGP Enter Passphrase&quot; aparece, como 
        na <a href="#4-4">figura 4-4</a>, pedindo que voc&ecirc; insira sua frase-senha.<br>
      <div align="center"><a name="4-4"></a><img src="passphrase.gif" width="292" height="136"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 
        4-4. A caixa de di&aacute;logo &quot;PGP Enter Passphrase&quot;</b></font></div><br>
    </li>
    <li> Entre sua frase-senha, ent&atilde;o clique OK.<br>
      <br>
      A mensagem &eacute; decifrada. Se ela foi assinada e voc&ecirc; possui a 
      chave p&uacute;blica do emitente, uma mensagem aparece indicando se a assinatura 
      &eacute; v&aacute;lida.<br>
      <br>
      Se a mensagem foi codificada usando a op&ccedil;&atilde;o &quot;Secure Viewer&quot; 
      (Visualizador Seguro) habilitada, uma mensagem de aviso aparece. Clique 
      OK para continuar. A mensagem decifrada aparece em uma tela segura de PGP 
      usando uma fonte especial para prevenir ataques TEMPEST.<br>
      <br>
    </li>
    <li> Voc&ecirc; pode salvar a mensagem em estado decifrado, ou pode salvar 
      a vers&atilde;o original codificada de forma que ela permane&ccedil;a segura.<br>
      <br>
      <b>NOTA</b>: Mensagens codificadas com a op&ccedil;&atilde;o Secure Viewer 
      habilitada n&atilde;o podem ser armazenadas em seu estado decifrado. </li>
  </ol>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para decifrar 
    e verificar a partir de aplicativos de email n&atilde;o suportados</font></b></p>
</blockquote>
<ol>
  <ol>
    <li> Abra sua mensagem de email como voc&ecirc; normalmente faria.<br>
      <br>
      Voc&ecirc; ver&aacute; um bloco de texto cifrado inintelig&iacute;vel no 
      corpo de sua mensagem de email.<br>
      <br>
    </li>
    <li> Em PGPtray, selecione &quot;Decrypt/Verify&quot;.<br>
      <br>
      Se a mensagem de email inclui arquivos anexos codificados, decifre-os separadamente 
      usando PGPtools ou PGPtray.<br>
      <br>
      A caixa de di&aacute;logo &quot;PGP Enter Passphrase&quot; aparece, como 
      na <a href="#4-4">figura 4-4</a>, pedindo que voc&ecirc; insira sua frase-senha.<br>
      <br>
    </li>
    <li> Entre sua frase-senha, ent&atilde;o clique OK.<br>
      <br>
      A mensagem &eacute; decifrada. Se ela foi assinada, uma mensagem aparece 
      indicando se a assinatura &eacute; v&aacute;lida.<br>
      <br>
      Se a mensagem foi codificada usando a op&ccedil;&atilde;o &quot;Secure Viewer&quot; 
      (Visualizador Seguro) habilitada, uma mensagem de aviso aparece. Clique 
      OK para continuar. A mensagem decifrada aparece em uma tela segura de PGP 
      usando uma fonte especial para prevenir ataques TEMPEST.<br>
      <br>
    </li>
    <li> Voc&ecirc; pode salvar a mensagem em estado decifrado, ou pode salvar 
      a vers&atilde;o original codificada de forma que ela permane&ccedil;a segura.<br>
      <br>
      <b>NOTA</b>: Mensagens codificadas com a op&ccedil;&atilde;o Secure Viewer 
      habilitada n&atilde;o podem ser armazenadas em seu estado decifrado.</li>
  </ol>
</ol>
</body>
</html>
