<html>
<head>
<title>Usando PGP para Armazenamento Seguro de Dados</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style>
</head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Usando 
        PGP para Armazenamento Seguro de Dados</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>5</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Este cap&iacute;tulo descreve como usar PGP para manter arquivos com seguran&ccedil;a. 
    Ele descreve como usar PGP para codificar, decifrar, assinar e verificar arquivos 
    tanto para email quanto para armazenagem segura em seu computador. Ele tamb&eacute;m 
    descreve as fun&ccedil;&otilde;es de PGP para Elimina&ccedil;&atilde;o (&quot;Wipe&quot;) 
    e Elimina&ccedil;&atilde;o de Espa&ccedil;o Livre (&quot;Free Space Wipe&quot;), 
    que apagam arquivos removendo seus conte&uacute;dos completamente de seu computador.</p>
</blockquote>
<p>&nbsp; </p>
<p><font size="6" color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="codificar_decifrar"></a>Usando 
  PGP para codificar e decifrar arquivos</b></font></p>
<blockquote> 
  <p>Voc&ecirc; pode usar PGP para codificar e assinar arquivos para uso como 
    anexos de email. Voc&ecirc; tamb&eacute;m pode usar as t&eacute;cnicas descritas 
    neste cap&iacute;tulo para codificar e assinar arquivos de forma que voc&ecirc; 
    os armazena com seguran&ccedil;a em seu computador.</p>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Usando 
  o menu de PGP do bot&atilde;o direito para codificar e assinar</font></b></p>
<blockquote> 
  <p>Use o menu de PGP do bot&atilde;o direito para enviar um arquivo codificado 
    como um anexo com sua mensagem de email, ou para codificar um arquivo para 
    proteg&ecirc;-lo em seu computador.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para codificar 
    e assinar usando o menu do bot&atilde;o direito</font></b></p>
  <ol>
    <li> No Windows Explorer, clique com o bot&atilde;o direito no arquivo ou 
      arquivos que voc&ecirc; quer codificar.<br>
      <br>
    </li>
    <li>Escolha uma das seguintes op&ccedil;&otilde;es a partir do menu de PGP 
      do bot&atilde;o direito: <br>
      <br>
      <ul>
        <li><b>Encrypt</b>. Selecione esta op&ccedil;&atilde;o para apenas codificar 
          o arquivo ou arquivos que voc&ecirc; selecionou.<br>
          <br>
        </li>
        <li><b>Sign</b>. Selecione esta op&ccedil;&atilde;o para apenas assinar 
          o arquivo ou arquivos que voc&ecirc; selecionou.<br>
          <br>
        </li>
        <li><b>Encrypt and Sign</b>. Selecione esta op&ccedil;&atilde;o para codificar 
          e assinar o arquivo ou arquivos que voc&ecirc; selecionou.</li>
      </ul>
      <br>
        A caixa de di&aacute;logo &quot;PGP Key Selection&quot; aparece, como 
        mostrado na <a href="#5-1">Figura 5-1</a>.<br><br>
      <div align="center"><a name="5-1"></a><img src="recipients2.gif" width="407" height="329"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 5-1. Caixa 
        de di&aacute;logo &quot;PGP Recipients&quot; (Destinat&aacute;rios)</b></font></div>
      <br>
      Voc&ecirc; pode selecionar as chaves p&uacute;blicas dos destinat&aacute;rios 
      para o arquivo que voc&ecirc; est&aacute; codificando ou assinando.<br>
      <br>
    </li>
    <li> Selecione as chaves p&uacute;blicas arrastando-as para a lista de destinat&aacute;rios, 
      ent&atilde;o clique OK.<br>
      <br>
      Voc&ecirc; pode escolher as seguintes op&ccedil;&otilde;es de codifica&ccedil;&atilde;o, 
      dependendo do tipo de dados que voc&ecirc; est&aacute; codificando: <br>
      <br>
      <ul>
        <li><b>Conventional Encrypt</b> (Codifica&ccedil;&atilde;o Convencional). 
          Selecione esta caixa para usar uma frase-senha comum ao inv&eacute;s 
          da criptografia por chave p&uacute;blica. O arquivo &eacute; codificado 
          usando uma chave de sess&atilde;o, que codifica (e decifra) usando uma 
          frase-senha que lhe ser&aacute; pedida para escolher.<br>
          <br>
        </li>
        <li><b>Text Output</b> (Sa&iacute;da de Texto). Quando enviando arquivos 
          como anexos com alguns aplicativos de email, voc&ecirc; talvez precise 
          selecionar a caixa &quot;Text Output&quot; para salvar o arquivo como 
          texto ASCII. Isto &agrave;s vezes &eacute; necess&aacute;rio de forma 
          a enviar arquivos bin&aacute;rios usando antigos aplicativos de email. 
          A sele&ccedil;&atilde;o desta op&ccedil;&atilde;o aumenta o tamanho 
          do arquivo codificado em cerca de 30 por cento.<br>
          <br>
        </li>
        <li><b>Wipe Original</b> (Eliminar o Original). Selecione esta caixa para 
          sobrescrever o documento original que voc&ecirc; est&aacute; codificando 
          ou assinando, de forma que suas informa&ccedil;&otilde;es sens&iacute;veis 
          n&atilde;o sejam leg&iacute;veis por qualquer um que possa acessar seu 
          disco r&iacute;gido.<br>
          <br>
        </li>
        <li><b>Secure Viewer</b> (Visualizador Seguro). Selecione esta op&ccedil;&atilde;o 
          para proteger o texto de ataques TEMPEST quando decifrando-os. Se voc&ecirc; 
          selecionar esta op&ccedil;&atilde;o, os dados s&atilde;o exibidos em 
          uma fonte especial que previne ataques TEMPEST que &eacute; ileg&iacute;vel 
          a equipamentos de captura de radia&ccedil;&atilde;o quando decifrando-os. 
          Para maiores informa&ccedil;&otilde;es sobre ataques TEMPEST, veja <a href="C%20-%20Phil%20Zimmermann%20sobre%20PGP.htm#vulnerabilidades">&quot;Vulnerabilidades&quot; 
          na p&aacute;gina 158</a>. 
          <p><b>NOTA</b>: Esta op&ccedil;&atilde;o est&aacute; somente dispon&iacute;vel 
            quando codificando texto ou arquivos texto.</p>
          <p>Se voc&ecirc; est&aacute; assinando os arquivos, lhe ser&aacute; 
            pedida sua frase-senha.</p>
          <p>Ap&oacute;s a codifica&ccedil;&atilde;o, se voc&ecirc; olhar a pasta 
            onde o arquivo original estava, voc&ecirc; encontrar&aacute; uma arquivo 
            com o nome especificado representado por um entre dois &iacute;cones:</p>
        </li>
      </ul>
    </li>
  </ol>
</blockquote>
<table width="70%" border="0" align="center" cellspacing="8">
  <tr> 
    <td>
      <div align="center"><img src="codificado_saida_texto.gif" width="39" height="42"></div>
    </td>
    <td>
      <div align="center"><img src="codificado_saida_padrao.gif" width="40" height="42"> 
      </div>
    </td>
  </tr>
  <tr> 
    <td> 
      <div align="center">codificado com sa&iacute;da de texto</div>
    </td>
    <td> 
      <p align="center">codificado com sa&iacute;da padr&atilde;o</p>
    </td>
  </tr>
</table>
<blockquote> 
  <blockquote> 
    <blockquote> 
      <p>Se voc&ecirc; est&aacute; codificando ou assinando uma pasta (diret&oacute;rio), 
        a sa&iacute;da pode estar em uma nova pasta, dependendo da op&ccedil;&atilde;o 
        que voc&ecirc; selecionou.</p>
    </blockquote>
  </blockquote>
</blockquote>
<p><b><font size="4" color="#A00048" face="Arial, Helvetica, sans-serif">Usando 
  PGPtools para codificar e assinar</font></b></p>
<blockquote> 
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para codificar 
    e assinar usando PGPtools</font></b></p>
  <ol>
    <li> Abra o programa PGPtools.<br>
      <div align="center"><br>
      <img src="pgptools_window2.gif" width="353" height="200"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 5-2. menu PGPtools</b></font></div>
      <br>
    </li>
    <li> No Windows Explorer, selecione o arquivo ou arquivos que voc&ecirc; quer 
      codificar.<br>
      <br>
      Voc&ecirc; pode selecionar v&aacute;rios arquivos, mas deve codificar e 
      assinar cada um individualmente.<br>
      <br>
    </li>
    <li>Arraste o(s) arquivo(s) para o bot&atilde;o Encrypt, Sign, ou Encrypt 
      and Sign na janela de PGPtools.<br>
      <br>
      A caixa de di&aacute;logo &quot;PGP Recipients&quot; aparece, como mostrado 
      na <a href="#5-1">Figura 5-1</a>.<br>
      <br>
    </li>
    <li>Selecione as chaves p&uacute;blicas arrastando-as para a lista de destinat&aacute;rios.<br>
      <br>
    </li>
    <li>Voc&ecirc; pode escolher as seguintes op&ccedil;&otilde;es de codifica&ccedil;&atilde;o, 
      dependendo do tipo de dados que voc&ecirc; est&aacute; codificando: <br>
      <br>
      <ul>
        <li><b>Conventional Encrypt</b> (Codifica&ccedil;&atilde;o Convencional). 
          Selecione esta caixa para usar uma frase-senha comum ao inv&eacute;s 
          da criptografia por chave p&uacute;blica. O arquivo &eacute; codificado 
          usando uma chave de sess&atilde;o, que codifica (e decifra) usando uma 
          frase-senha que lhe ser&aacute; pedida para escolher.<br>
          <br>
        </li>
        <li><b>Text Output</b> (Sa&iacute;da de Texto). Quando enviando arquivos 
          como anexos com alguns aplicativos de email, voc&ecirc; talvez precise 
          selecionar a caixa &quot;Text Output&quot; para salvar o arquivo como 
          texto ASCII. Isto &agrave;s vezes &eacute; necess&aacute;rio de forma 
          a enviar arquivos bin&aacute;rios usando antigos aplicativos de email. 
          A sele&ccedil;&atilde;o desta op&ccedil;&atilde;o aumenta o tamanho 
          do arquivo codificado em cerca de 30 por cento.<br>
          <br>
        </li>
        <li><b>Wipe Original</b> (Eliminar o Original). Selecione esta caixa para 
          sobrescrever o documento original que voc&ecirc; est&aacute; codificando 
          ou assinando, de forma que suas informa&ccedil;&otilde;es sens&iacute;veis 
          n&atilde;o sejam leg&iacute;veis por qualquer um que possa acessar seu 
          disco r&iacute;gido.<br>
          <br>
        </li>
        <li><b>Secure Viewer</b> (Visualizador Seguro). Selecione esta op&ccedil;&atilde;o 
          para proteger o texto de ataques TEMPEST quando decifrando-os. Se voc&ecirc; 
          selecionar esta op&ccedil;&atilde;o, os dados s&atilde;o exibidos em 
          uma fonte especial que previne ataques TEMPEST que &eacute; ileg&iacute;vel 
          a equipamentos de captura de radia&ccedil;&atilde;o quando decifrando-os. 
          Para maiores informa&ccedil;&otilde;es sobre ataques TEMPEST, veja <a href="C%20-%20Phil%20Zimmermann%20sobre%20PGP.htm#vulnerabilidades">&quot;Vulnerabilidades&quot; 
          na p&aacute;gina 158</a>. 
          <p><b>NOTA</b>: Esta op&ccedil;&atilde;o est&aacute; somente dispon&iacute;vel 
            quando codificando texto ou arquivos texto.</p>
        </li>
      </ul>
    </li>
    <li>Clique OK. <br>
      <br>
      Se voc&ecirc; est&aacute; assinando os arquivos, lhe ser&aacute; pedida 
      sua frase-senha. 
      <p>Ap&oacute;s a codifica&ccedil;&atilde;o, se voc&ecirc; olhar a pasta 
        onde o arquivo original estava, voc&ecirc; encontrar&aacute; uma arquivo 
        com o nome especificado representado por um entre dois &iacute;cones:</p>
    </li>
  </ol>
</blockquote>
<ol>
  <table width="70%" border="0" align="center" cellspacing="8">
    <tr> 
      <td> 
        <div align="center"><img src="codificado_saida_texto.gif" width="39" height="42"></div>
      </td>
      <td> 
        <div align="center"><img src="codificado_saida_padrao.gif" width="40" height="42"> 
        </div>
      </td>
    </tr>
    <tr> 
      <td> 
        <div align="center">codificado com sa&iacute;da de texto</div>
      </td>
      <td> 
        <p align="center">codificado com sa&iacute;da padr&atilde;o</p>
      </td>
    </tr>
  </table>
  <blockquote> 
    <p>Se voc&ecirc; est&aacute; codificando ou assinando uma pasta (diret&oacute;rio), 
      a sa&iacute;da pode estar em uma nova pasta, dependendo da op&ccedil;&atilde;o 
      que voc&ecirc; selecionou.</p>
  </blockquote>
</ol>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Usando 
  PGPtray para decifrar e verificar</font></b></p>
<blockquote> 
  <p>Se o email que voc&ecirc; receber possuir arquivos anexos, e voc&ecirc; n&atilde;o 
    estiver usando um aplicativo de email compat&iacute;vel com PGP/MIME, voc&ecirc; 
    deve decifr&aacute;-lo usando a &Aacute;rea de Transfer&ecirc;ncia de Windows.</p>
  <p><b><font color="#A00048">Para decifrar e verificar arquivos usando PGPtray</font></b></p>
  <ol>
    <li> No Windows Explorer, selecione o arquivo ou arquivos que voc&ecirc; quer 
      decifrar e verificar.<br>
      <br>
    </li>
    <li>Escolha &quot;Decrypt/Verify&quot; de PGPtray.<br>
      <br>
      A janela &quot;Enter Passphrase&quot; (Entre a Frase-Senha) aparece, como 
      mostrado na <a href="#5-3">figura 5-3</a>.<br>
      <br>
      <div align="center"><a name="5-3"></a><img src="passphrase2.gif" width="289" height="187"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 5-3. A janela &quot;Enter Passphrase&quot;</b></font></div>
      <br>
    </li>
    <li>Entre sua frase-senha e ent&atilde;o clique OK.<br>
      <br>
      O arquivo &eacute; decifrado. Se ele foi assinado, uma mensagem aparece 
      indicando se a assinatura &eacute; v&aacute;lida.<br>
      Se o arquivo texto foi codificado com a op&ccedil;&atilde;o de Visualizador 
      Seguro (&quot;Secure Viewer&quot;) habilitada, uma mensagem de aviso aparecer&aacute;. 
      Clique OK para continuar. O texto decifrado aparece em uma tela segura de 
      PGP em uma fonte especial de preven&ccedil;&atilde;o de ataques TEMPEST.<br>
      <br>
    </li>
    <li>Voc&ecirc; pode salvar a mensagem em seu estado decifrado, ou pode salvar 
      a vers&atilde;o codificada original de forma a mant&ecirc;-la segura. 
      <p><b>NOTA</b>: Mensagens codificadas com a op&ccedil;&atilde;o &quot;Secure 
        Viewer&quot; habilitada n&atilde;o podem ser salvas em seu estado decifrado. 
        Elas s&atilde;o apenas vis&iacute;veis na janela segura de PGP ap&oacute;s 
        decifradas.</p>
    </li>
  </ol>
</blockquote>
<p><b><font size="4" color="#A00048">Usando PGPtools para decifrar e verificar</font></b></p>
<blockquote> 
  <p><b><font color="#A00048">Para decifrar e verificar usando PGPtools</font></b></p>
  <ol>
    <li> No Windows Explorer, selecione o arquivo ou arquivos que voc&ecirc; quer 
      decifrar e verificar.<br>
      <br>
    </li>
    <li>Arraste o arquivo para o bot&atilde;o &quot;Decrypt/Verify&quot; na janela 
      de PGPtools (<a href="#5-2">figura 5-2</a>).<br>
      <br>
      A janela &quot;Enter Passphrase&quot; (Entre a Frase-Senha) aparece, como 
      mostrado na <a href="#5-3">figura 5-3</a>, pedindo que voc&ecirc; insira 
      sua frase-senha.<br>
      <br>
    </li>
    <li>Entre sua frase-senha e ent&atilde;o clique OK.<br>
      <br>
      Se o arquivo foi assinado, uma mensagem aparece indicando se a assinatura 
      &eacute; v&aacute;lida.<br>
      <br>
      Se o arquivo texto foi codificado com a op&ccedil;&atilde;o de Visualizador 
      Seguro (&quot;Secure Viewer&quot;) habilitada, uma mensagem de aviso aparecer&aacute;. 
      Clique OK para continuar. O texto decifrado aparece em uma tela segura de 
      PGP em uma fonte especial de preven&ccedil;&atilde;o de ataques TEMPEST.<br>
      <br>
    </li>
    <li>Voc&ecirc; pode salvar a mensagem em seu estado decifrado, ou pode salvar 
      a vers&atilde;o codificada original de forma a mant&ecirc;-la segura. 
      <p><b>NOTA</b>: Mensagens codificadas com a op&ccedil;&atilde;o &quot;Secure 
        Viewer&quot; habilitada n&atilde;o podem ser salvas em seu estado decifrado. 
        Elas s&atilde;o apenas vis&iacute;veis na janela segura de PGP ap&oacute;s 
        decifradas.</p>
    </li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<p><font face="Arial, Helvetica, sans-serif" color="#A00048" size="6"><b><a name="assinando_decifrando_arquivos_com_chave_dividida"></a>Assinando 
  e decifrando arquivos com uma chave dividida</b></font></p>
<blockquote> 
  <p>Uma vez que uma chave &eacute; dividida entre v&aacute;rios propriet&aacute;rios, 
    tentativas de assinar ou decifrar com ela ir&aacute; fazer com que PGP automaticamente 
    tente reunir a chave. H&aacute; duas formas de reunir a chave, localmente 
    e remotamente.</p>
  <p>Reunir partes da chave localmente requer a presen&ccedil;a dos propriet&aacute;rios 
    junto ao computador que far&aacute; a reuni&atilde;o da chave. Cada propriet&aacute;rio 
    deve entrar sua frase-senha para sua parte da chave.</p>
  <p>Reunir partes da chave remotamente requer que os propriet&aacute;rios remotos 
    autentiquem e decifrem suas chaves antes de envi&aacute;-las pela rede. O 
    Transport Layer Security (TLS) de PGP prov&ecirc; uma liga&ccedil;&atilde;o 
    segura para transmiss&atilde;o das partes da chave, que permitem que v&aacute;rios 
    indiv&iacute;duos em localidades distantes seguramente assinem ou decifrem 
    com suas partes da chave.</p>
  <p><b>IMPORTANTE</b>: Antes do recebimento das partes da chave atrav&eacute;s 
    da rede, voc&ecirc; deve certificar a impress&atilde;o digital da chave de 
    cada um dos propriet&aacute;rios e assinar suas chaves p&uacute;blicas para 
    ter certeza de que suas chaves de autentica&ccedil;&atilde;o s&atilde;o leg&iacute;timas. 
    Para aprender como verificar um par de chaves, veja <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#verificando_com_impressao_digital">&quot;Verificando 
    com uma impress&atilde;o digital&quot; na p&aacute;gina 53</a>.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para assinar 
    ou decifrar arquivos com uma chave dividida</font></b></p>
  <ol>
    <li> Contate cada um dos propriet&aacute;rios da chave dividida. Para reunir 
      partes da chave localmente, os propriet&aacute;rios devem estar presentes.<br>
      <br>
      Para obter as partes da chave atrav&eacute;s da rede, certifique-se de que 
      os propriet&aacute;rios remotos est&atilde;o preparados para enviar suas 
      partes da chave. Os propriet&aacute;rios remotos devem ter:<br>
      <br>
    </li>
    <ul>
      <li>suas partes da chave e senha<br>
        <br>
      </li>
      <li>uma chave p&uacute;blica (para autentica&ccedil;&atilde;o no computador 
        que est&aacute; obtendo as partes da chave)<br>
        <br>
      </li>
      <li>uma conex&atilde;o de rede<br>
        <br>
      </li>
      <li>o endere&ccedil;o IP ou Nome de Dom&iacute;nio do computador que est&aacute; 
        obtendo as partes da chave<br>
        <br>
      </li>
    </ul>
    <li> No computador que est&aacute; unindo as partes, use o Windows Explorer 
      para selecionar o(s) arquivo(s) que voc&ecirc; quer assinar ou decifrar 
      com a chave dividida.<br>
      <br>
    </li>
    <li> Clique com o bot&atilde;o direito no(s) arquivo(s) e selecione &quot;Sign&quot; 
      (Assinar) ou &quot;Decrypt&quot; (Decifrar) no menu de PGP. A caixa de di&aacute;logo 
      de PGP &quot;Enter Passphrase for Selected Key&quot; (Entre Frase-Senha 
      para a Chave Selecionada) aparece com a chave dividida selecionada.<br>
      <br>
    </li>
    <li> Clique OK para reconstituir a chave selecionada.<br>
      <br>
      A caixa de di&aacute;logo &quot;Key Share Collection&quot; aparece, como 
      mostrado na <a href="#5-4">figura 5-4</a>.<br>
      <br>
      <div align="center"><a name="5-4"></a><img src="share_collection.gif" width="349" height="379"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 5-4. A caixa 
        de di&aacute;logo &quot;Key Share Collection&quot; </b></font></div>
      <br>
    </li>
    <li> Se voc&ecirc; est&aacute; obtendo as partes da chave localmente, clique 
      &quot;Select Share File&quot; e ent&atilde;o localize os arquivos das partes 
      associados &agrave; chave dividida. Os arquivos das partes podem ser obtidos 
      de um disco r&iacute;gido, disquete, ou drive montado. Siga ao passo 6.<br>
      <br>
      Se voc&ecirc; est&aacute; obtendo as partes da chave atrav&eacute;s da rede, 
      clique &quot;Start Network&quot;. A caixa de di&aacute;logo &quot;Passphrase&quot; 
      aparece. Na caixa &quot;Signing Key&quot;, selecione o par de chaves que 
      voc&ecirc; quer usar para autentica&ccedil;&atilde;o ao sistema remoto e 
      entre sua frase-senha. Clique OK para preparar o computador para receber 
      as partes da chave.<br>
      <br>
      O status da transa&ccedil;&atilde;o &eacute; exibido na caixa &quot;Network 
      Shares&quot;. Quando o status muda para &quot;Listening&quot; (Escutando), 
      o programa PGP est&aacute; pronto para receber as partes da chave.<br>
      <br>
      Neste momento, os propriet&aacute;rios devem enviar suas partes da chave. 
      Para aprender como enviar partes da chave para o computador que ir&aacute; 
      uni-las, veja <a href="#enviar_parte_chave_via_rede">&quot;Enviando sua 
      parte da chave atrav&eacute;s da rede&quot; na p&aacute;gina 75</a>.<br>
      Quando uma chave &eacute; recebida, a caixa de di&aacute;logo &quot;Remote 
      Authentication&quot; (Autentica&ccedil;&atilde;o Remota) aparece, como mostrado 
      na <a href="#5-5">figura 5-5</a>.<br>
      <br>
      <div align="center"><a name="5-5"></a><img src="remote_authentication.gif" width="409" height="296"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 
      5-5. A caixa de di&aacute;logo &quot;Remote Authentication&quot;</b></font></div>
      <br>
      Se voc&ecirc; n&atilde;o assinou a chave que est&aacute; sendo usada para 
      autenticar o sistema remoto, a chave ser&aacute; considerada inv&aacute;lida. 
      Apesar de voc&ecirc; poder reunir a chave dividida com uma chave de autentica&ccedil;&atilde;o 
      inv&aacute;lida, isto n&atilde;o &eacute; recomendado. Voc&ecirc; deve verificar 
      a &quot;impress&atilde;o digital&quot; de cada propriet&aacute;rio, e assinar 
      suas chaves p&uacute;blicas para certificar-se de que a chave de autentica&ccedil;&atilde;o 
      &eacute; leg&iacute;tima.<br>
      <br>
      Clique &quot;Confirm&quot; para aceitar o arquivo da parte.<br>
      <br>
    </li>
    <li>Continue obtendo partes da chave at&eacute; que o valor para &quot;Total 
      Shares Collected&quot; seja igual ao valor para &quot;Total Shares Needed&quot; 
      na janela &quot;Key Shares Collection&quot;.<br>
      <br>
    </li>
    <li>Clique OK.<br>
      <br>
      O arquivo &eacute; assinado ou decifrado com a chave dividida.<br>
    </li>
  </ol>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="enviar_parte_chave_via_rede"></a>Para 
    enviar sua parte da chave atrav&eacute;s da rede</b></font></p>
  <ol>
    <li>Quando voc&ecirc; &eacute; contactado pela pessoa que est&aacute; unindo 
      a chave dividida, certifique-se de ter os seguintes itens:<br>
      <br>
      <ul>
        <li>o arquivo com suas parte da chave e senha<br>
          <br>
        </li>
        <li>um par de chaves (para autentica&ccedil;&atilde;o no computador que 
          est&aacute; obtendo as partes da chave)<br>
          <br>
        </li>
        <li>uma conex&atilde;o de rede<br>
          <br>
        </li>
        <li>o endere&ccedil;o IP ou Nome de Dom&iacute;nio do computador que est&aacute; 
          obtendo as partes da chave<br>
          <br>
        </li>
      </ul>
    </li>
    <li>Selecione &quot;Send Key Shares&quot; (Enviar Parte da Chave) no menu 
      &quot;File&quot; de PGPkeys.<br>
      <br>
      A caixa de di&aacute;logo &quot;Select Share File&quot; aparece.<br>
      <br>
    </li>
    <li> Localize sua parte da chave e clique &quot;Open&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Enter Passphrase&quot; aparece.<br>
      <br>
    </li>
    <li>Entre sua frase-senha e ent&atilde;o clique OK.<br>
      <br>
      A caixa de di&aacute;logo &quot;Send Key Shares&quot; aparece, como mostrado 
      na <a href="#5-6">figura 5-6</a>.<br>
      <br>
      <div align="center"><a name="5-6"></a><img src="share_send_keys.gif" width="369" height="262"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 
      5-6. A caixa de di&aacute;logo &quot;Send Key Shares&quot;</b></font></div>
      <br>
    </li>
    <li>Entre o endere&ccedil;o IP ou Nome de Dom&iacute;nio do computador que 
      est&aacute; fazendo a uni&atilde;o das chaves na caixa de texto &quot;Remote 
      Address&quot;, ent&atilde;o clique &quot;Send Shares&quot;.<br>
      <br>
      O status da transa&ccedil;&atilde;o &eacute; exibido na caixa &quot;Network 
      Shares&quot;. Quando o status muda para &quot;Connected&quot; (Conectado), 
      lhe &eacute; pedido para autenticar-se ao computador que est&aacute; fazendo 
      a uni&atilde;o.<br>
      <br>
      A caixa de di&aacute;logo &quot;Remote Authentication&quot; (Autentica&ccedil;&atilde;o 
      Remota) aparece pedindo que voc&ecirc; confirme que o computador remoto 
      &eacute; aquele para quem voc&ecirc; quer enviar sua parte da chave.<br>
      <br>
    </li>
    <li>Clique &quot;Confirm&quot; para completar a transa&ccedil;&atilde;o.<br>
      <br>
      Ap&oacute;s o computador remoto receber sua parte da chave e confirmar a 
      transa&ccedil;&atilde;o, uma mensagem aparece dizendo que as partes foram 
      enviadas com sucesso.<br>
      <br>
    </li>
    <li>Clique OK.<br>
      <br>
    </li>
    <li>Clique &quot;Done&quot; na janela &quot;Key Shares&quot; quando voc&ecirc; 
      tiver completado o envio da sua parte da chave.</li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><b><a name="usando_PGPWipe_para_apagar_arquivos"></a>Usando 
  PGP Wipe para apagar arquivos</b></font></p>
<blockquote> 
  <p>O item &quot;Wipe&quot; (Eliminar) em PGPtools apaga arquivos e seus conte&uacute;dos. 
    O recurso de Elimina&ccedil;&atilde;o &eacute; uma forma segura de permanentemente 
    remover um arquivo e seu conte&uacute;do do disco r&iacute;gido de seu computador. 
    Quando voc&ecirc; apaga um arquivo normalmente, colocando-o na Lixeira, o 
    nome do arquivo &eacute; removido do diret&oacute;rio do arquivo, mas os dados 
    do arquivo permanecem no disco. &quot;Wipe&quot; remove todos os tra&ccedil;os 
    dos dados de um arquivo de forma que ningu&eacute;m possa usar uma ferramenta 
    de software para recuperar o arquivo.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para apagar 
    permanentemente um arquivo usando o menu do bot&atilde;o direito</font></b></p>
  <ol>
    <li> No Windows Explorer, selecione o arquivo ou arquivos que voc&ecirc; deseja 
      eliminar.<br>
      <br>
      Para parar a elimina&ccedil;&atilde;o do arquivo antes da tarefa estar completa, 
      clique &quot;Cancel&quot;.<br>
      <br>
      <b>NOTA</b>: Clicando &quot;Cancel&quot; durante a elimina&ccedil;&atilde;o 
      do arquivo pode deixar restos do arquivo para tr&aacute;s.<br>
      <br>
    </li>
    <li>Clique no arquivo com o bot&atilde;o direito e ent&atilde;o escolha &quot;Wipe&quot; 
      a partir do menu. Uma caixa de di&aacute;logo de confirma&ccedil;&atilde;o 
      aparece.<br>
      <br>
    </li>
    <li>Clique OK para apagar permanentemente o arquivo.</li>
  </ol>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para apagar 
    permanentemente um arquivo usando PGPtools</font></b></p>
  <ol>
    <li> No Windows Explorer, selecione o arquivo ou arquivos que voc&ecirc; deseja 
      eliminar.<br>
      <br>
    </li>
    <li>Arraste o arquivo no bot&atilde;o &quot;Wipe&quot; (<img src="bt_wipe.gif" width="28" height="29" align="absmiddle">) 
      na janela de PGPtools.<br>
      <br>
      Uma caixa de di&aacute;logo de confirma&ccedil;&atilde;o aparece.<br>
      <br>
    </li>
    <li>Clique OK para apagar permanentemente o arquivo.<br>
      <br>
      Para parar a elimina&ccedil;&atilde;o do arquivo antes da tarefa estar completa, 
      clique &quot;Cancel&quot;.<b><br>
      <br>
      NOTA</b>: Clicando &quot;Cancel&quot; durante a elimina&ccedil;&atilde;o 
      do arquivo pode deixar restos do arquivo para tr&aacute;s.</li>
  </ol>
  <p> Mesmo em sistemas com mem&oacute;ria virtual, PGP corretamente escreve sobre 
    todo o conte&uacute;do do arquivo. Vale a pena notar que alguns aplicativos 
    salvam o arquivo antes de codific&aacute;-los e podem deixar fragmentos do 
    arquivo em seu disco, em locais onde eles n&atilde;o s&atilde;o mais considerados 
    parte do arquivo. Para maiores informa&ccedil;&otilde;es, veja <a href="C%20-%20Phil%20Zimmermann%20sobre%20PGP.htm#memoria_virtual">&quot;Arquivos 
    de troca ou mem&oacute;ria virtual&quot; na p&aacute;gina 161</a>. Voc&ecirc; 
    pode usar o recurso de PGP &quot;Freespace Wipe&quot; (Eliminar Espa&ccedil;o 
    Livre) para eliminar todo o espa&ccedil;o livre em seu disco para solucionar 
    este problema. Veja a pr&oacute;xima se&ccedil;&atilde;o para informa&ccedil;&otilde;es 
    sobre o Freespace Wipe. Tamb&eacute;m, esteja ciente de que muitos programas 
    automaticamente salvam arquivos em progresso, portanto pode haver c&oacute;pias 
    <i>backup</i> do arquivo que voc&ecirc; est&aacute; querendo apagar.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="free_space_wiper"></a>Usando 
  PGP Free Space Wiper para limpar espa&ccedil;o livre em seus discos</font></b></p>
<blockquote> 
  <p>Conforme voc&ecirc; cria e apaga arquivos em seu computador, os dados contidos 
    nestes arquivos permanecem no drive. PGPtools pode ser usado para eliminar 
    com seguran&ccedil;a os dados em um arquivo antes dele ser apagado para negar 
    a possibilidade deles em algum momento serem recuperados.</p>
  <p>Muitos programas criam arquivos tempor&aacute;rios enquanto voc&ecirc; edita 
    o conte&uacute;do de documentos. Estes arquivos s&atilde;o apagados quando 
    voc&ecirc; fecha os documentos, mas os dados do documento s&atilde;o deixados 
    jogados em lugares do seu disco. Para ajudar reduzir a chance de que os dados 
    de seus documentos possam mais tarde serem recuperados, a Network Associates 
    recomenda que voc&ecirc; elimine com seguran&ccedil;a o espa&ccedil;o livre 
    em seus drives como tamb&eacute;m apague com seguran&ccedil;a documentos sens&iacute;veis.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para eliminar 
    espa&ccedil;o livre de seus discos</font></b></p>
  <p><b>ATEN&Ccedil;&Atilde;O</b>: Antes de executar o PGP Free Space Wiper, compartilhamento 
    de arquivos deve ser desligado e todos os arquivos no volume ou disco que 
    voc&ecirc; deseja eliminar devem ser fechados.</p>
  <ol>
    <li>Abra o programa PGPtools.<br>
      <br>
    </li>
    <li>Clique o bot&atilde;o &quot;Wipe Free Space&quot; (<img src="bt_wipe_freespace.gif" width="42" height="32" align="absmiddle">) 
      na janela de PGPtools.<br>
      <br>
      A tela de boas vindas do &quot;PGP Free Space Wiper&quot; aparece.<br>
      <br>
    </li>
    <li>Leia as informa&ccedil;&otilde;es cuidadosamente, ent&atilde;o clique 
      &quot;Next&quot; para avan&ccedil;ar &agrave; pr&oacute;xima caixa de di&aacute;logo.<br>
      <br>
      O &quot;PGP Free Space Wiper&quot; pede-lhe para selecionar o volume que 
      voc&ecirc; deseja eliminar e o n&uacute;mero de passos a serem executados.<br>
      <br>
    </li>
    <li>Na caixa &quot;Volume&quot;, selecione o disco ou volume que voc&ecirc; 
      quer que PGP elimine.<br>
      <br>
      Ent&atilde;o, selecione o n&uacute;mero de passos que voc&ecirc; quer que 
      PGP execute. Os n&iacute;veis recomendados s&atilde;o:<br>
      <br>
      <ul>
        <li> 3 passos para uso pessoal.<br>
          <br>
        </li>
        <li>10 passos para uso comercial.<br>
          <br>
        </li>
        <li>18 passos para uso militar.<br>
          <br>
        </li>
        <li>26 passos para m&aacute;xima seguran&ccedil;a.</li>
      </ul>
      <p><b><br>
        NOTA</b>: Companhias comerciais de recupera&ccedil;&atilde;o de dados 
        s&atilde;o conhecidas por recuperar dados que foram sobrescritos at&eacute; 
        9 vezes. PGP usa padr&otilde;es altamente sofisticados durante cada elimina&ccedil;&atilde;o 
        para certificar de que seus dados sens&iacute;veis n&atilde;o possam ser 
        recuperados.</p>
    </li>
    <li>Clique &quot;Next&quot; para continuar.<br>
      <br>
      A caixa de di&aacute;logo &quot;Perform Wipe&quot; (Executar Elimina&ccedil;&atilde;o) 
      aparece, como mostrado na <a href="#5-7">figura 5-7</a>, e exibe informa&ccedil;&otilde;es 
      estat&iacute;sticas sobre o drive ou volume que voc&ecirc; selecionou.<br>
      <br>
      <div align="center"><a name="5-7"></a><img src="freespace_wipe_perform_wipe.gif" width="407" height="279"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 
      5-7. Elimina&ccedil;&atilde;o de Espa&ccedil;o Livre (caixa de di&aacute;logo 
      &quot;Perform Wipe&quot;)</b></font></div>
      <br>
    </li>
    <li> Clique o bot&atilde;o &quot;Begin Wipe&quot; para iniciar a elimina&ccedil;&atilde;o 
      do espa&ccedil;o livre em seu disco ou volume.<br>
      <br>
      O &quot;PGP Free Space Wiper&quot; procura e elimina fragmentos que sobraram 
      de seu disco ou volume.<br>
      <br>
    </li>
    <li>Quando a sess&atilde;o de elimina&ccedil;&atilde;o terminar, clique &quot;Finish&quot;.</li>
  </ol>
</blockquote>
</body>
</html>
