<html>
<head>
<title>Gerenciando Chaves e Configurando Prefer&ecirc;ncias</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style>
</head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Gerenciando 
        Chaves e Configurando Prefer&ecirc;ncias</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>6</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Este cap&iacute;tulo explica como examinar e gerenciar as chaves armazenadas 
    em seus chaveiros. Ele tamb&eacute;m descreve como configurar suas prefer&ecirc;ncias 
    para servir seu ambiente de computa&ccedil;&atilde;o particular.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="gerenciando_chaves"></a>Gerenciando 
  suas chaves</font></b></p>
<blockquote> 
  <p>As chaves que voc&ecirc; cria, como as que obt&eacute;m de outros, s&atilde;o 
    armazenadas em chaveiros, que s&atilde;o essencialmente arquivos armazenados 
    em seu disco r&iacute;gido ou em um disquete. Normalmente suas chaves privadas 
    s&atilde;o armazenadas em um arquivo chamado secring.skr e suas chaves p&uacute;blicas 
    s&atilde;o armazenadas em outro arquivo chamado pubring.pkr. Estes arquivos 
    est&atilde;o geralmente localizados na pasta &quot;PGP Keyrings&quot;.</p>
  <p><b>NOTA</b>: Como resultado de sua chave privada ser codificada automaticamente 
    e sua frase-senha estar segura, n&atilde;o h&aacute; perigo em deixar seus 
    chaveiros em seu computador. Entretanto, se voc&ecirc; n&atilde;o est&aacute; 
    confort&aacute;vel armazenando suas chaves nos locais padr&atilde;o, voc&ecirc; 
    pode escolher um nome de arquivo ou local diferentes. Para detalhes, veja 
    <a href="#configurando_preferencias">&quot;Configurando suas prefer&ecirc;ncias&quot;</a> 
    mais &agrave; frente neste cap&iacute;tulo.</p>
  <p>Ocasionalmente, voc&ecirc; pode querer examinar ou alterar os atributos associados 
    &agrave; suas chaves. Por exemplo, quando voc&ecirc; obt&eacute;m a chave 
    p&uacute;blica de algu&eacute;m, voc&ecirc; pode querer identificar seu tipo 
    (RSA ou Diffie-Hellman/DSS), checar sua impress&atilde;o digital, ou determinar 
    sua validade baseada em qualquer assinatura digital inclu&iacute;da com a 
    chave. Voc&ecirc; pode tamb&eacute;m querer assinar a chave p&uacute;blica 
    de algu&eacute;m para indicar que voc&ecirc; acredita que ela seja v&aacute;lida, 
    associar um n&iacute;vel de seguran&ccedil;a ao propriet&aacute;rio da chave, 
    ou alterar a frase-senha da sua chave privada. Voc&ecirc; pode at&eacute; 
    querer procurar pela chave de algu&eacute;m em um servidor de chaves. Voc&ecirc; 
    executada todas essas fun&ccedil;&otilde;es de gerenciamento de chaves atrav&eacute;s 
    da janela de PGPkeys.</p>
</blockquote>
<p><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><b>A janela 
  de PGPkeys</b></font></p>
<blockquote> 
  <p>Para abrir o programa PGPkeys, clique Iniciar --&gt; Programas --&gt; PGP 
    --&gt; PGPkeys, ou clique o &iacute;cone de PGPtray na sua bandeja de sistema 
    (&quot;system tray&quot;) e ent&atilde;o clique &quot;Launch PGPkeys&quot;. 
    A janela de PGPkeys (<a href="#6-1">figura 6-1</a>) exibe as chaves que voc&ecirc; 
    criou para voc&ecirc; mesmo, como tamb&eacute;m quaisquer chaves p&uacute;blicas 
    que voc&ecirc; adicionou ao seu chaveiro p&uacute;blico.</p>
  <div align="center"><a name="6-1"></a><img src="pgpkeys_window.gif" width="473" height="317"><br>
    <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 6-1. A janela 
    de PGPkeys</b></font></div>
  <p>Um &iacute;cone de uma chave e usu&aacute;rio (<img src="graykey_user.gif" width="27" height="26" align="absmiddle">) 
    representa os pares de chave privada e p&uacute;blica que voc&ecirc; criou 
    para voc&ecirc; mesmo, e chaves simples (<img src="graykey.gif" width="29" height="21" align="absmiddle">) 
    representam as chaves p&uacute;blicas que voc&ecirc; obteve de outros. Se 
    voc&ecirc; tem mais de um tipo de chave, voc&ecirc; notar&aacute; que chaves 
    do tipo RSA s&atilde;o prateadas e chaves Diffie-Hellman/DSS s&atilde;o douradas.</p>
  <p>Clicando no sinal &quot;+&quot; do lado esquerdo do &iacute;cone da chave, 
    voc&ecirc; pode expandir as entradas para exibir o ID do usu&aacute;rio (&quot;user 
    ID&quot;) e endere&ccedil;o de email do propriet&aacute;rio da chave, como 
    representado pelos &iacute;cones de envelope (<img src="envelope.gif" width="30" height="24" align="absmiddle">). 
    Clicando o sinal + pr&oacute;ximo do &iacute;cone do envelope, voc&ecirc; 
    pode ver as assinaturas de quaisquer usu&aacute;rios que certificaram o ID 
    do usu&aacute;rio. Se voc&ecirc; n&atilde;o quer expandir cada chave individualmente, 
    simplesmente selecione as chaves de interesse e escolha &quot;Expand Selection&quot; 
    (Expandir Sele&ccedil;&atilde;o) atrav&eacute;s do menu &quot;Edit&quot;.</p>
</blockquote>
<p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Defini&ccedil;&atilde;o 
  dos atributos de PGPkeys</font></b></p>
<blockquote> 
  <p>Alguns dos atributos associados com chaves podem ser mostradas na janela 
    principal de PGPkeys. Voc&ecirc; pode escolher que atributos deseja tornar 
    vis&iacute;veis selecionando-os no menu &quot;View&quot;. Para cada item selecionado 
    no menu &quot;View&quot;, PGPkeys exibe uma coluna na janela principal. Se 
    voc&ecirc; quiser alterar a ordem destas colunas, clique e arraste o cabe&ccedil;alho 
    da coluna que deseja mover.</p>
</blockquote>
<table width="90%" border="0" cellspacing="25" align="center">
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">Keys 
      (Chaves)</font></b></td>
    <td width="80%"><font size="2" face="Arial, Helvetica, sans-serif">Exibe uma 
      representa&ccedil;&atilde;o ic&ocirc;nica da chave juntamente com o nome 
      do usu&aacute;rio e o endere&ccedil;o de email do propriet&aacute;rio, e 
      os nomes dos assinantes da chave.</font></td>
  </tr>
  <tr> 
    <td width="20%"><b><font face="Arial, Helvetica, sans-serif" size="2">Validity 
      (Validade)</font></b></td>
    <td width="80%"> 
      <p><font size="2" face="Arial, Helvetica, sans-serif">Indica o n&iacute;vel 
        de confian&ccedil;a que esta chave realmente pertence ao usu&aacute;rio 
        alegado. A validade &eacute; baseada em quem assinou a chave e o quanto 
        voc&ecirc; confia no(s) assinante(s) para certificar a autenticidade de 
        uma chave. As chaves p&uacute;blicas que voc&ecirc; mesmo assina possuem 
        o maior n&iacute;vel poss&iacute;vel de validade, baseado na suposi&ccedil;&atilde;o 
        que voc&ecirc; somente assina a chave de algu&eacute;m se voc&ecirc; est&aacute; 
        totalmente convencido de que ela &eacute; v&aacute;lida. A validade de 
        quaisquer outras chaves, que voc&ecirc; mesmo n&atilde;o assinou, depende 
        do n&iacute;vel de confian&ccedil;a que voc&ecirc; deu a quaisquer outros 
        usu&aacute;rios que assinaram a chave. Se n&atilde;o h&aacute; assinaturas 
        associadas &agrave; chave, ela n&atilde;o &eacute; considerada v&aacute;lida, 
        e uma mensagem indicando este fato aparece sempre que voc&ecirc; codificar 
        para aquela chave.</font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif">Validade &eacute; 
        indicada tanto por um c&iacute;rculo quanto por uma barra, dependendo 
        da configura&ccedil;&atilde;o que voc&ecirc; fez em &quot;Advanced Preferences&quot; 
        (Prefer&ecirc;ncias Avan&ccedil;adas), em &quot;Display marginal validity 
        level&quot; (Exibir n&iacute;vel de validade marginal). Veja <a href="#config_preferencias_avancadas">&quot;Para 
        configurar prefer&ecirc;ncias avan&ccedil;adas&quot;</a> mais tarde neste 
        cap&iacute;tulo. Se configurada, a validade aparece como:</font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif"><img src="bar_empty.gif" width="64" height="23" align="absmiddle">, 
        uma barra vazia para chaves inv&aacute;lidas<br>
        <img src="bar_half.gif" width="66" height="17" align="absmiddle">, uma 
        barra cheia pela metade para chaves marginalmente v&aacute;lidas<br>
        <img src="bar_full.gif" width="64" height="17" align="absmiddle">, uma 
        barra cheia para chaves v&aacute;lidas que voc&ecirc; n&atilde;o possui<br>
        <img src="bar_striped.gif" width="64" height="15" align="absmiddle">, 
        uma barra com faixas para chaves v&aacute;lidas que voc&ecirc; possui</font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif">Se n&atilde;o configurada, 
        ent&atilde;o a validade aparece como:</font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif"><img src="gray_circle.gif" width="27" height="25" align="absmiddle">, 
        um c&iacute;rculo cinza para chaves inv&aacute;lidas e chaves marginalmente 
        v&aacute;lidas se a Prefer&ecirc;ncia Avan&ccedil;ada &quot;Treat marginally 
        valid keys as invalid&quot; (Tratar chaves marginalmente v&aacute;lidas 
        como inv&aacute;lidas) estiver configurada<br>
        <img src="green_circle.gif" width="25" height="28" align="absmiddle">, 
        um c&iacute;rculo verde para chaves v&aacute;lidas que voc&ecirc; n&atilde;o 
        possui</font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif">Em um ambiente corporativo, 
        seu gerente de seguran&ccedil;a pode assinar as chaves dos usu&aacute;rios 
        com a Chave de Assinatura Corporativa. Chaves assinadas com a Chave de 
        Assinatura Corporativa s&atilde;o geralmente assumidas serem completamente 
        v&aacute;lidas. Veja o <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm">Cap&iacute;tulo 
        3, &quot;Criando e Trocando Chaves&quot;</a>, para mais informa&ccedil;&otilde;es.</font></p>
    </td>
  </tr>
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">Size 
      (Tamanho)</font></b></td>
    <td width="80%"><font size="2" face="Arial, Helvetica, sans-serif">Mostra 
      o n&uacute;mero de bits usados para construir a chave. Geralmente, quanto 
      maior a chave, menos chances ela tem de ser comprometida. Entretanto, chaves 
      maiores requerem um pouco mais de tempo para codificar e assinar dados que 
      chaves menores. Quando voc&ecirc; cria uma chave Diffie-Hellman/DSS, h&aacute; 
      um n&uacute;mero para a por&ccedil;&atilde;o Diffie-Hellman e outro n&uacute;mero 
      para a por&ccedil;&atilde;o DSS. A por&ccedil;&atilde;o DSS &eacute; usada 
      para assinar, e a por&ccedil;&atilde;o Diffie-Hellman para codificar.</font></td>
  </tr>
  <tr> 
    <td width="20%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Description 
      (Descri&ccedil;&atilde;o) </b></font></td>
    <td width="80%"><font face="Arial, Helvetica, sans-serif" size="2">Descreve 
      o tipo de informa&ccedil;&atilde;o exibida na coluna &quot;Keys&quot; (Chaves): 
      tipo de chave, tipo de ID, ou tipo de assinatura.</font></td>
  </tr>
  <tr> 
    <td width="20%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Additional 
      Decryption Key (Chave de Decifra&ccedil;&atilde;o Adicional)</b></font></td>
    <td width="80%"><font face="Arial, Helvetica, sans-serif" size="2">Exibe se 
      a chave possui uma Chave de Decifra&ccedil;&atilde;o Adicional (&quot;Additional 
      Decryption Key&quot;) associada.</font></td>
  </tr>
  <tr> 
    <td width="20%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Key 
      ID (ID da Chave)</b></font></td>
    <td width="80%"><font face="Arial, Helvetica, sans-serif" size="2">Um n&uacute;mero 
      identificador &uacute;nico associado com cada chave. O n&uacute;mero de 
      identifica&ccedil;&atilde;o &eacute; &uacute;til para distinguir duas chaves 
      que compartilham o mesmo nome de usu&aacute;rio e endere&ccedil;o de email.</font></td>
  </tr>
  <tr> 
    <td width="20%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Trust 
      (Confian&ccedil;a) </b></font></td>
    <td width="80%"> 
      <p><font face="Arial, Helvetica, sans-serif" size="2">Indica o n&iacute;vel 
        de confian&ccedil;a que voc&ecirc; deu ao propriet&aacute;rio da chave, 
        para servir como apresentador para chaves p&uacute;blicas de outros. Esta 
        confian&ccedil;a fica em jogo quando voc&ecirc; est&aacute; incapacitado 
        de verificar a validade da chave p&uacute;blica de algu&eacute;m por voc&ecirc; 
        mesmo, e ao inv&eacute;s acredita no julgamento de outros usu&aacute;rios 
        que assinaram a chave. Quando voc&ecirc; cria um par de chaves, elas s&atilde;o 
        consideradas implicitamente confi&aacute;veis, como mostrado pelas faixas 
        nas barras de validade e confian&ccedil;a, ou por um &iacute;cone de um 
        ponto verde e usu&aacute;rio. </font></p>
      <p><font face="Arial, Helvetica, sans-serif" size="2">Quando voc&ecirc; 
        recebe uma chave p&uacute;blica que foi assinada por outra das chaves 
        do usu&aacute;rio em seu chaveiro p&uacute;blico, o n&iacute;vel de autenticidade 
        &eacute; baseado na confian&ccedil;a que voc&ecirc; deu ao assinante daquela 
        chave. Voc&ecirc; associa um n&iacute;vel de confian&ccedil;a, podendo 
        ser Trusted (Confiada), Marginal, ou Untrusted (N&atilde;o Confiada), 
        na caixa de di&aacute;logo &quot;Key Properties&quot; (Propriedades da 
        Chave).</font></p>
    </td>
  </tr>
  <tr> 
    <td width="20%"><font face="Arial, Helvetica, sans-serif" size="2"><b>Expiration 
      (Expira&ccedil;&atilde;o) </b></font></td>
    <td width="80%"><font face="Arial, Helvetica, sans-serif" size="2">Mostra 
      a data que a chave ir&aacute; expirar. A maioria das chaves &eacute; configurada 
      para &quot;Never&quot; (Nunca); entretanto, pode haver casos quando o propriet&aacute;rio 
      de uma chave quer que ela seja usada por apenas um per&iacute;odo fixo de 
      tempo.</font></td>
  </tr>
  <tr> 
    <td width="20%"><font face="Arial, Helvetica, sans-serif" size="2"><b>Creation 
      (Cria&ccedil;&atilde;o) </b></font></td>
    <td width="80%"><font face="Arial, Helvetica, sans-serif" size="2">Mostra 
      a data da cria&ccedil;&atilde;o original da chave. Voc&ecirc; &agrave;s 
      vezes pode fazer uma suposi&ccedil;&atilde;o sobre a validade de uma chave 
      baseado em quanto tempo ela tem estado em circula&ccedil;&atilde;o. Se a 
      chave tem sido usada por algum tempo, &eacute; menos prov&aacute;vel que 
      algu&eacute;m ir&aacute; tentar troc&aacute;-la, porque pode haver muitas 
      outras c&oacute;pias em circula&ccedil;&atilde;o. Nunca confie em datas 
      de cria&ccedil;&atilde;o como &uacute;nica indica&ccedil;&atilde;o de validade.</font></td>
  </tr>
</table>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="examinando_propriedades"></a>Examinando 
  as propriedades de uma chave</font></b></p>
<blockquote> 
  <p>Al&eacute;m dos atributos gerais mostrados na janela de PGPkeys, voc&ecirc; 
    pode tamb&eacute;m examinar e alterar outras propriedades de chaves e subchaves. 
    Para acessar as Propriedades para uma chave em particular, selecione a chave 
    desejada e ent&atilde;o escolha &quot;Properties&quot; do menu &quot;Keys&quot;.</p>
  <div align="center"><img src="pgpkeys_general.gif" width="330" height="359"><br>
    <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 6-2. P&aacute;gina 
    de propriedades de PGPkeys (caixa de di&aacute;logo Propriedades Gerais, ou 
    &quot;General properties&quot;)</b></font></div>
</blockquote>
<p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Janela de propriedades 
  gerais da chave</font></b></p>
<table width="90%" border="0" cellspacing="25" align="center">
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Key 
      ID (Identificador da Chave)</b></font></td>
    <td width="71%"><font face="Arial, Helvetica, sans-serif" size="2">Um n&uacute;mero 
      identificador &uacute;nico associado com cada chave. Este n&uacute;mero 
      de identifica&ccedil;&atilde;o &eacute; &uacute;til para distinguir duas 
      chaves que compartilham o mesmo nome de usu&aacute;rio e endere&ccedil;o 
      de email.</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Key 
      Type (Tipo da Chave)</b></font></td>
    <td width="71%"><font face="Arial, Helvetica, sans-serif" size="2">O tipo 
      de chave, RSA ou Diffie-Hellman/DSS.</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Key 
      Size (Tamanho da Chave)</b></font></td>
    <td width="71%"><font face="Arial, Helvetica, sans-serif" size="2">O tamanho 
      da chave</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Created 
      (Criada) </b></font></td>
    <td width="71%"><font face="Arial, Helvetica, sans-serif" size="2">A data 
      quando a chave foi criada</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Expires 
      (Expira) </b></font></td>
    <td width="71%"><font face="Arial, Helvetica, sans-serif" size="2">A data 
      quando a chave expirar. Propriet&aacute;rios especificam esta data quando 
      eles criam suas chaves, e o valor &eacute; geralmente configurado em &quot;Never&quot; 
      (Nunca). Entretanto, algumas chaves s&atilde;o configuradas para expirar 
      em uma data particular se o propriet&aacute;rio quer que elas sejam usadas 
      por um per&iacute;odo limitado de tempo.</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Cipher 
      (Cifra) </b></font></td>
    <td width="71%"><font face="Arial, Helvetica, sans-serif" size="2">CAST, Triple 
      DES, ou IDEA. Este &eacute; o algoritmo &quot;preferido&quot; de codifica&ccedil;&atilde;o, 
      pelo qual o propriet&aacute;rio da chave requer que voc&ecirc; codifique 
      para sua chave p&uacute;blica. Se este algoritmo estiver permitido em suas 
      prefer&ecirc;ncias Avan&ccedil;adas, ele ser&aacute; usado sempre que codificando 
      para esta chave.</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Join 
      Key (Chave de Jun&ccedil;&atilde;o)</b></font></td>
    <td width="71%"><font size="2" face="Arial, Helvetica, sans-serif">Abre a 
      caixa de di&aacute;logo &quot;Key Share Collection&quot;. Apenas dispon&iacute;vel 
      para chaves divididas. Veja <a href="5%20-%20Usando%20PGP%20para%20Armazenamento%20Seguro%20de%20Dados.htm#assinando_decifrando_arquivos_com_chave_dividida">&quot;Assinando 
      e Decifrando arquivos com uma chave dividida&quot; na p&aacute;gina 73</a> 
      para informa&ccedil;&otilde;es sobre reunir chaves divididas.</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Enabled 
      (Habilitada) </b></font></td>
    <td width="71%"><font size="2" face="Arial, Helvetica, sans-serif">Indica 
      se a chave est&aacute; atualmente habilitada. Quando uma chave est&aacute; 
      desabilitada, ela fica &quot;escurecida&quot; na janela de PGPkeys e n&atilde;o 
      est&aacute; dispon&iacute;vel para executar quaisquer fun&ccedil;&otilde;es 
      PGP exceto Decifrar e Verificar. Entretanto, a chave permanece em seu chaveiro 
      e voc&ecirc; pode habilit&aacute;-la novamente a qualquer momento. Para 
      habilitar ou desabilitar uma chave, marque ou desmarque a caixa &quot;Enabled&quot; 
      (a caixa n&atilde;o &eacute; vis&iacute;vel para chaves implicitamente confi&aacute;veis). 
      Este recurso &eacute; &uacute;til para prevenir que chaves usadas raramente 
      &quot;encham&quot; a caixa de di&aacute;logo &quot;Key Selection&quot; (Sele&ccedil;&atilde;o 
      de Chave) quando voc&ecirc; est&aacute; enviando email codificado.</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Change 
      Passphrase (Alterar Frase-Senha)</b></font></td>
    <td width="71%"> 
      <p><font size="2" face="Arial, Helvetica, sans-serif">Altera a frase-senha 
        de uma chave privada. Se voc&ecirc; alguma vez pensar que sua frase-senha 
        n&atilde;o &eacute; mais um segredo, clique este bot&atilde;o para inserir 
        uma nova frase-senha.</font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif">&Eacute; uma boa id&eacute;ia 
        alterar sua frase-senha a cada 6 meses mais ou menos. Para instru&ccedil;&otilde;es 
        sobre altera&ccedil;&atilde;o de frases-senha, veja &quot;Alterando sua 
        frase-senha&quot;, mais tarde neste cap&iacute;tulo.</font></p>
    </td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Fingerprint 
      (Impress&atilde;o Digital)</b></font></td>
    <td width="71%"><font size="2" face="Arial, Helvetica, sans-serif">Um n&uacute;mero 
      de identifica&ccedil;&atilde;o &uacute;nico que &eacute; gerado quando a 
      chave &eacute; criada. Esta &eacute; a forma prim&aacute;ria pela qual voc&ecirc; 
      pode checar pela autenticidade de uma chave. A melhor forma de checar uma 
      impress&atilde;o digital &eacute; pedir ao propriet&aacute;rio que ele a 
      leia para voc&ecirc; pelo telefone de forma que voc&ecirc; possa compar&aacute;-la 
      com a impress&atilde;o digital exibida para sua c&oacute;pia da chave p&uacute;blica 
      da pessoa.</font></td>
  </tr>
  <tr> 
    <td width="29%"><font size="2" face="Arial, Helvetica, sans-serif"><b>Trust 
      Model (Modelo de Confian&ccedil;a)</b></font></td>
    <td width="71%"><font size="2" face="Arial, Helvetica, sans-serif">Indica 
      a validade de uma chave baseado na certifica&ccedil;&atilde;o e no n&iacute;vel 
      de seguran&ccedil;a que voc&ecirc; tem no propriet&aacute;rio para garantir 
      a autenticidade da chave p&uacute;blica de algu&eacute;m. Voc&ecirc; configura 
      o n&iacute;vel de confian&ccedil;a deslizando a barra para o n&iacute;vel 
      apropriado: Trusted (Confi&aacute;vel), Marginal, ou Untrusted (N&atilde;o 
      Confi&aacute;vel). A barra estar&aacute; desabilitada para chaves revogadas, 
      expiradas, e implicitamente confiadas.</font></td>
  </tr>
</table>
<p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Janela de propriedades 
  de subchaves</font></b></p>
<table width="90%" border="0" cellspacing="25" align="center">
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">Valid 
      From (V&aacute;lido a partir de)</font></b></td>
    <td width="80%"><font size="2" face="Arial, Helvetica, sans-serif">A data 
      quando a subchave torna-se ativa.</font></td>
  </tr>
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">Expires 
      (Expira) </font></b></td>
    <td width="80%"><font size="2" face="Arial, Helvetica, sans-serif">A data 
      quando a subchave expira. Propriet&aacute;rios especificam esta data quando 
      eles criam suas subchaves. Subchaves s&atilde;o geralmente ativas por um 
      per&iacute;odo limitado de tempo.</font></td>
  </tr>
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">Key 
      Size (Tamanho da Chave)</font></b></td>
    <td width="80%"><font size="2" face="Arial, Helvetica, sans-serif">O tamanho 
      da subchave.</font></td>
  </tr>
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">New 
      (Nova) </font></b></td>
    <td width="80%"><font size="2" face="Arial, Helvetica, sans-serif">Cria uma 
      nova subchave. Para informa&ccedil;&otilde;es sobre cria&ccedil;&atilde;o 
      de uma nova subchave, veja <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#criando_novas_subchaves">&quot;Criando 
      novas subchaves&quot; na p&aacute;gina 41</a>.</font></td>
  </tr>
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">Revoke 
      (Revogar) </font></b></td>
    <td width="80%"><font size="2" face="Arial, Helvetica, sans-serif">Revoga 
      a subchave de criptografia atualmente selecionada. Ap&oacute;s voc&ecirc; 
      revogar a subchave e redistribuir sua chave, outros n&atilde;o estar&atilde;o 
      mais capacitados de codificar dados para esta subchave.</font></td>
  </tr>
  <tr> 
    <td width="20%"><b><font size="2" face="Arial, Helvetica, sans-serif">Remove 
      (Remover) </font></b></td>
    <td width="80%"> 
      <p><font size="2" face="Arial, Helvetica, sans-serif">Permanentemente remove 
        a subchave de codifica&ccedil;&atilde;o atualmente selecionada. Este procedimento 
        n&atilde;o pode ser desfeito. Quaisquer dados que forem codificados para 
        a subchave selecionada n&atilde;o poder&atilde;o mais ser decifradas.</font></p>
      <p><font size="2" face="Arial, Helvetica, sans-serif"><b>DICA</b>: Use a 
        op&ccedil;&atilde;o &quot;Revoke&quot; (descrita acima) se voc&ecirc; 
        quer desabilitar a subchave e atualize o servidor de chaves. Uma vez que 
        uma subchave tenha sido enviada ao servidor, ela n&atilde;o pode ser removida.</font></p>
    </td>
  </tr>
</table>
<p>&nbsp;</p>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Especificando 
  um par de chaves padr&atilde;o</font></b></p>
<blockquote> 
  <p>Quando codificando mensagens ou arquivos, PGP lhe d&aacute; a op&ccedil;&atilde;o 
    de adicionalmente codificar para um par de chaves que voc&ecirc; especifica 
    como seu par de chaves padr&atilde;o. Quando voc&ecirc; assina uma mensagem 
    ou a chave p&uacute;blica de algu&eacute;m, PGP ir&aacute; usar este par de 
    chaves por padr&atilde;o. Seu par de chaves padr&atilde;o &eacute; exibido 
    em negrito para distingui-las de suas outras chaves. Se voc&ecirc; possui 
    apenas um par de chaves em seu chaveiro, ele &eacute; automaticamente designado 
    como seu par de chaves padr&atilde;o. Se voc&ecirc; possui mais de um par 
    de chaves, voc&ecirc; pode querer designar especificamente um par como seu 
    par padr&atilde;o.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para especificar 
    seu par de chaves padr&atilde;o</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li> Selecione o par de chaves que voc&ecirc; quer designar como seu par padr&atilde;o.<br>
      <br>
    </li>
    <li> Escolha &quot;Set Default&quot; (Configurar como Padr&atilde;o) do menu 
      &quot;Keys&quot;.<br>
      <br>
      O par de chaves selecionado &eacute; exibido em negrito, indicando que ele 
      agora foi designado como seu par de chaves padr&atilde;o.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="adicionando_novo_nome_ou_endereco_para_um_par_de_chaves"></a>Adicionando 
  um novo nome de usu&aacute;rio ou endere&ccedil;o para um par de chaves</font></b></p>
<blockquote> 
  <p>Voc&ecirc; pode ter mais de um nome de usu&aacute;rio ou endere&ccedil;o 
    de email para o qual quer usar o mesmo par de chaves. Ap&oacute;s criar um 
    novo par de chaves, voc&ecirc; pode adicionar nomes alternativos e endere&ccedil;os 
    &agrave;s chaves. Voc&ecirc; pode adicionar um novo nome ou endere&ccedil;o 
    de email apenas se voc&ecirc; possuir tanto a chave privada quanto a p&uacute;blica.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para adicionar 
    um novo nome de usu&aacute;rio ou endere&ccedil;o a uma chave existente</font></b></p>
  <ol>
    <li>Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione o par de chaves para o qual voc&ecirc; quer adicionar outro 
      nome de usu&aacute;rio ou endere&ccedil;o.<br>
      <br>
    </li>
    <li>Escolha &quot;Add/Name&quot; (Adicionar/Nome) no menu &quot;Keys&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;New User Name&quot; (Novo Nome de Usu&aacute;rio) 
      aparece (<a href="#6-3">figura 6-3</a>).<br>
      <br>
      <div align="center"> <a name="6-3"></a><img src="new_user_name.gif" width="294" height="157"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 6-3. A caixa 
        de di&aacute;logo &quot;New User Name&quot;</b></font></div>
      <br>
    </li>
    <li>Entre o novo nome e endere&ccedil;o de email nos campos apropriados, e 
      ent&atilde;o clique OK.<br>
      <br>
      A caixa de di&aacute;logo &quot;Enter Passphrase&quot; &eacute; aberta.<br>
      <br>
    </li>
    <li>Entre sua frase-senha, ent&atilde;o clique OK.<br>
      <br>
      O novo nome &eacute; adicionado ao fim da lista de nomes de usu&aacute;rios 
      associados com a chave. Se voc&ecirc; quer configurar o novo nome de usu&aacute;rio 
      e endere&ccedil;o como identificadores prim&aacute;rios para sua chave, 
      selecione o nome e endere&ccedil;o e ent&atilde;o escolha &quot;Set as Primary 
      Name&quot; (Configurar como Nome Prim&aacute;rio) no menu &quot;Keys&quot;.</li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="verificando_chave_publica_de_alguem"></a>Verificando 
  a chave p&uacute;blica de algu&eacute;m</font></b></p>
<blockquote> 
  <p>No passado era dif&iacute;cil saber com certeza se uma chave pertencia a 
    uma pessoa em particular, a n&atilde;o ser que a pessoa fisicamente entregasse 
    a chave para voc&ecirc; em um disquete. Trocar chaves desta maneira n&atilde;o 
    &eacute; usualmente pr&aacute;tico, especialmente para usu&aacute;rios que 
    est&atilde;o localizados a muitos quil&ocirc;metros de dist&acirc;ncia.</p>
  <p>H&aacute; v&aacute;rias formas de se checar a impress&atilde;o digital de 
    uma chave, mas a mais segura &eacute; chamar a pessoa e pedir a ela que leia 
    a impress&atilde;o digital para voc&ecirc; pelo telefone. A n&atilde;o ser 
    que a pessoa seja alvo de um ataque, &eacute; muito dif&iacute;cil que algu&eacute;m 
    fosse capaz de interceptar esta chamada aleat&oacute;ria e imitar a pessoa 
    que voc&ecirc; espera ouvir do outro lado. Voc&ecirc; tamb&eacute;m pode comparar 
    a impress&atilde;o digital ou fotografia em sua c&oacute;pia da chave p&uacute;blica 
    de algu&eacute;m com a impress&atilde;o digital ou fotografia na chave original 
    em um servidor p&uacute;blico.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para checar 
    uma chave p&uacute;blica com a impress&atilde;o digital da chave</font></b></p>
  <ol>
    <li>Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione a chave p&uacute;blica que voc&ecirc; deseja verificar.<br>
      <br>
    </li>
    <li>Escolha &quot;Properties&quot; (Propriedades) do menu &quot;Keys&quot; 
      ou clique (<img src="properties.gif" width="35" height="34" align="absmiddle">) 
      para abrir a janela de Propriedades.<br>
      <br>
      A janela de propriedades se abre, como mostrado na <a href="#6-4">figura 
      6-4</a>.<br>
      <br>
      <div align="center"><a name="6-4"></a><img src="pgpkeys_general.gif" width="330" height="359"><br>
        <font face="Arial, Helvetica, sans-serif" size="2"><b>Figura 6-4. Janela 
        de Propriedades</b></font></div>
      <br>
    </li>
    <li> Use os caracteres exibidos na caixa de texto &quot;Fingerprint&quot; 
      para comparar com a impress&atilde;o digital original.</li>
  </ol>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><a name="assinando_chave_publica_de_alguem"></a>Assinando 
  a chave p&uacute;blica de algu&eacute;m</font></b></p>
<blockquote> 
  <p>Quando voc&ecirc; cria um conjunto de chaves, as chaves s&atilde;o automaticamente 
    assinadas usando sua chave p&uacute;blica. Da mesma forma, uma vez que voc&ecirc; 
    est&aacute; certo de que uma chave pertence &agrave; pessoa correta, voc&ecirc; 
    pode assinar a chave p&uacute;blica desta pessoa, indicando que voc&ecirc; 
    est&aacute; certo de que ela &eacute; uma chave v&aacute;lida. Quando voc&ecirc; 
    assina a chave p&uacute;blica de algu&eacute;m, um &iacute;cone associado 
    com seu nome de usu&aacute;rio &eacute; exibido para aquela chave.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para assinar 
    a chave p&uacute;blica de algu&eacute;m</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione a chave p&uacute;blica que voc&ecirc; quer assinar.<br>
      <br>
    </li>
    <li>Escolha &quot;Sign&quot; no menu &quot;Keys&quot; ou clique para abrir 
      a janela &quot;Sign Keys&quot;.<br>
      <br>
      A janela &quot;Sign Keys&quot; aparece (<a href="#6-5">figura 6-5</a>) com 
      a chave p&uacute;blica e a impress&atilde;o digital exibida em uma caixa 
      de texto.<br>
      <br>
      <div align="center"><a name="6-5"></a><img src="key_sign_fewer.gif" width="500" height="216"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 6-5. Janela 
        &quot;Sign Keys&quot; (menos op&ccedil;&otilde;es)</b></font></div>
      <br>
    </li>
    <li>Clique a caixa &quot;Allow signature to be Exported...&quot; (Permitir 
      que a assinatura seja exportada), para permitir que sua assinatura seja 
      exportada com esta chave.<br>
      <br>
      Uma assinatura export&aacute;vel &eacute; aquela pode ser enviada aos servidores 
      e viajar com a chave sempre que ela &eacute; exportada, como arrastando-a 
      para uma mensagem de email. A caixa &quot;Allow signature to be Exported...&quot; 
      &eacute; uma forma r&aacute;pida de indicar que voc&ecirc; quer exportar 
      sua assinatura.<br>
      <br>
      Ou<br>
      <br>
      Clique o bot&atilde;o &quot;More Choices&quot; (Mais Op&ccedil;&otilde;es) 
      para configurar op&ccedil;&otilde;es, como tipo de assinatura e expira&ccedil;&atilde;o 
      da assinatura (<a href="#6-6">Figura 6-6</a>).<br>
      <br>
      <div align="center"><a name="6-6"></a><img src="key_sign_more.gif" width="442" height="351"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 6-6. Janela 
        &quot;Sign Keys&quot; (mais op&ccedil;&otilde;es)</b></font></div>
      <br>
      Escolha um tipo de assinatura com a qual assinar a chave p&uacute;blica. 
      Suas op&ccedil;&otilde;es s&atilde;o: <br>
      <br>
      <ul>
        <li><b>N&atilde;o export&aacute;vel</b>. Use esta assinatura quando voc&ecirc; 
          acredita que a chave &eacute; v&aacute;lida mas n&atilde;o quer que 
          outros baseiem-se em sua certifica&ccedil;&atilde;o. Este tipo de assinatura 
          n&atilde;o pode ser enviado com a chave associada para um servidor de 
          chaves, ou exportada de qualquer forma.<br>
          <br>
        </li>
        <li><b>Export&aacute;vel</b>. Use assinaturas export&aacute;veis em situa&ccedil;&otilde;es 
          onde sua assinatura &eacute; enviada com a chave para um servidor de 
          chaves, de forma que outros possam basear-se em sua assinatura e confiar 
          em suas chaves como resultado. Isto &eacute; equivalente a marcar a 
          caixa &quot;Allow signature to be exported...&quot; no menu &quot;Sign 
          Keys&quot;.<br>
          <br>
        </li>
        <li><b>Meta-Apresentador</b>. Certifica que esta chave e quaisquer chaves 
          assinadas por esta chave com uma Assertiva de Validade de um Apresentador 
          Confi&aacute;vel s&atilde;o apresentadores completamente confi&aacute;veis 
          para voc&ecirc;. Este tipo de assinatura n&atilde;o &eacute; export&aacute;vel.<br>
          <br>
        </li>
        <li><b>Apresentador Confi&aacute;vel</b>. Use esta assinatura em situa&ccedil;&otilde;es 
          onde voc&ecirc; certifica que esta chave &eacute; v&aacute;lida, e que 
          o propriet&aacute;rio da chave deve ser completamente confiado para 
          certificar outras chaves. Este tipo de assinatura &eacute; export&aacute;vel. 
          Voc&ecirc; pode restringir as capacidades de valida&ccedil;&atilde;o 
          do apresentador confi&aacute;vel para um dom&iacute;nio particular de 
          email.<br>
          <br>
        </li>
      </ul>
    </li>
    <li> Clique o bot&atilde;o &quot;Sign&quot; (Assinar).<br>
      <br>
      A janela de &quot;Passphrase&quot; aparece.<br>
      <br>
    </li>
    <li>Insira sua frase-senha, ent&atilde;o clique OK.<br>
      <br>
      Um &iacute;cone associado com seu nome de usu&aacute;rio agora &eacute; 
      inclu&iacute;do com a chave p&uacute;blica que voc&ecirc; acaba de assinar.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Concedendo 
  confian&ccedil;a a valida&ccedil;&atilde;o de chaves</font></b></p>
<blockquote> 
  <p>Al&eacute;m de certificar que uma chave pertence a algu&eacute;m, voc&ecirc; 
    pode associar um n&iacute;vel de confian&ccedil;a ao usu&aacute;rio das chaves 
    indicando o quanto voc&ecirc; confia neles para agir como um apresentador 
    para outros cujas chaves voc&ecirc; pode obter no futuro. Isto significa que 
    se voc&ecirc; alguma vez obter uma chave de algu&eacute;m que foi assinada 
    por uma pessoa para quem voc&ecirc; designou como confi&aacute;vel, a chave 
    &eacute; considerada v&aacute;lida mesmo que voc&ecirc; mesmo n&atilde;o tenha 
    feito a checagem.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para conceder 
    confian&ccedil;a a uma chave</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Na janela PGPkeys, selecione a chave para qual voc&ecirc; quer alterar 
      o n&iacute;vel de seguran&ccedil;a.<br>
      <br>
      <b>NOTA</b>: Voc&ecirc; deve assinar a chave antes de configurar o n&iacute;vel 
      de confian&ccedil;a para ela. Se voc&ecirc; n&atilde;o assinou a chave ainda, 
      veja <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#assinando_chave_publica">&quot;Assinando 
      a chave p&uacute;blica&quot; na p&aacute;gina 53</a> para instru&ccedil;&otilde;es.<br>
      <br>
    </li>
    <li>Escolha &quot;Properties&quot; (Propriedades) do menu &quot;Keys&quot; 
      ou clique (<img src="properties.gif" width="35" height="34" align="absmiddle">) 
      para abrir a janela de Propriedades, como mostrado na <a href="#6-4">figura 
      6-4</a>.<br>
      <br>
    </li>
    <li>Use a barra deslizante &quot;Trust Level&quot; (N&iacute;vel de Confian&ccedil;a) 
      para escolher o n&iacute;vel apropriado de seguran&ccedil;a para o par de 
      chaves.<br>
      <br>
      <div align="center"><img src="trust_model.gif" width="332" height="69"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 6-7. Caixa 
        de di&aacute;logo &quot;Trust Level&quot;</b></font></div>
      <br>
    </li>
    <li>Feche a caixa de di&aacute;logo para aceitar a nova configura&ccedil;&atilde;o.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Desabilitando 
  e habilitando chaves</font></b></p>
<blockquote> 
  <p>&Agrave;s vezes voc&ecirc; pode querer temporariamente desabilitar uma chave. 
    A habilidade de desabilitar chaves &eacute; &uacute;til quando voc&ecirc; 
    quer manter uma chave p&uacute;blica para uso futuro, mas n&atilde;o quer 
    que elas &quot;encham&quot; sua lista de destinat&aacute;rios a cada vez que 
    voc&ecirc; envia email.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para desabilitar 
    uma chave</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Na janela de PGPkeys, selecione a chave que voc&ecirc; deseja desabilitar. 
      <br>
      <br>
    </li>
    <li>Selecione &quot;Disable&quot; (Desabilitar) no menu &quot;Keys&quot;. 
      <br>
      <br>
      A chave &eacute; escurecida e est&aacute; temporariamente desabilitada para 
      uso.</li>
  </ol>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para habilitar 
    uma chave</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione a chave que voc&ecirc; deseja habilitar. <br>
      <br>
    </li>
    <li>Selecione &quot;Enable&quot; (Habilitar) no menu &quot;Keys&quot;. <br>
      <br>
      A chave torna-se vis&iacute;vel e pode ser usada como antes.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Apagando 
  uma chave, assinatura, ou ID de usu&aacute;rio</font></b></p>
<blockquote> 
  <p>Em algum momento voc&ecirc; pode querer remover uma chave, uma assinatura, 
    ou um ID de usu&aacute;rio associado com uma chave em particular.</p>
  <p>NOTA: Quando voc&ecirc; apaga uma chave, uma assinatura, ou um ID de usu&aacute;rio 
    de uma chave, ela &eacute; removida e n&atilde;o &eacute; recuper&aacute;vel. 
    Assinaturas e IDs de usu&aacute;rio podem ser re-adicionadas a uma chave, 
    e uma chave p&uacute;blica importada pode ser re-importada para seu chaveiro. 
    Entretanto, uma chave privada que exista apenas em seu chaveiro n&atilde;o 
    pode ser recriada, e todas as mensagens codificadas para as c&oacute;pias 
    de sua respectiva chave p&uacute;blica n&atilde;o poder&atilde;o mais ser 
    decifradas.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para apagar 
    uma chave, uma assinatura, ou um ID de usu&aacute;rio</font></b></p>
  <ol>
    <li>Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione a chave, assinatura, ou ID de usu&aacute;rio que voc&ecirc; 
      deseja apagar.<br>
      <br>
    </li>
    <li>Escolha &quot;Delete&quot; do menu &quot;Edit&quot; ou clique (<img src="delete_key.gif" width="39" height="35" align="absmiddle">) 
      na barra de ferramentas de PGPkeys.<br>
      <br>
      A caixa de di&aacute;logo &quot;Confirmation&quot; (Confirma&ccedil;&atilde;o) 
      aparece.<br>
      <br>
    </li>
    <li>Clique o bot&atilde;o OK.</li>
  </ol>
</blockquote>
<p><b><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif">Alterando 
  sua Frase-Senha</font></b></p>
<blockquote> 
  <p>&Eacute; uma boa pr&aacute;tica alterar sua frase-senha em intervalos regulares, 
    talvez a cada tr&ecirc;s meses. Mais importante, voc&ecirc; deve alterar sua 
    frase-senha no momento que crer que ela foi comprometida, por exemplo, por 
    algu&eacute;m olhando por sobre seus ombros enquanto voc&ecirc; a digitou.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para alterar 
    sua frase-senha</font></b></p>
  <ol>
    <li>Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione sua chave listada na janela de PGPkeys.<br>
      <br>
    </li>
    <li>Escolha &quot;Properties&quot; do menu &quot;Keys&quot; ou clique (<img src="properties.gif" width="35" height="34" align="absmiddle">) 
      para abrir a caixa de di&aacute;logo &quot;Properties&quot; (Propriedades).<br>
      <br>
      A caixa de di&aacute;logo &quot;Properties&quot; aparece (veja <a href="#6-4">figura 
      6-4</a>).<br>
      <br>
    </li>
    <li>Clique &quot;Change Passphrase&quot; (Alterar Frase-Senha).<br>
      <br>
      A caixa de di&aacute;logo &quot;Passphrase&quot; aparece.<br>
      <br>
      <b>NOTA</b>: Se voc&ecirc; quer alterar a frase-senha para uma chave dividida, 
      voc&ecirc; deve primeiro reunir as partes da chave. Clique &quot;Join&quot; 
      (Juntar) para obter as partes da chave. Veja <a href="5%20-%20Usando%20PGP%20para%20Armazenamento%20Seguro%20de%20Dados.htm#assinando_decifrando_arquivos_com_chave_dividida">&quot;Assinando 
      e decifrando arquivos com uma chave dividida&quot; na p&aacute;gina 73</a> 
      para informa&ccedil;&otilde;es sobre obten&ccedil;&atilde;o de partes de 
      chaves.<br>
      <br>
    </li>
    <li>Entre sua frase-senha atual no espa&ccedil;o provido, ent&atilde;o clique 
      OK.<br>
      <br>
      A caixa de di&aacute;logo &quot;Change Passphrase&quot; aparece.<br>
      <br>
    </li>
    <li>Insira sua nova frase-senha na primeira caixa de texto. Pressione a tecla 
      &quot;Tab&quot; para avan&ccedil;ar &agrave; pr&oacute;xima caixa de texto 
      e confirmar sua entrada inserindo sua nova frase-senha novamente.<br>
      <br>
    </li>
    <li>Clique OK.</li>
  </ol>
  <p><b>ATEN&Ccedil;&Atilde;O</b>: Se voc&ecirc; est&aacute; alterando sua frase-senha 
    porque sente que sua frase-senha foi comprometida, voc&ecirc; deve eliminar 
    todos os chaveiros de <i>backup</i> e eliminar seu espa&ccedil;o livre.</p>
</blockquote>
<p><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Importando 
  e Exportando Chaves</b></font></p>
<blockquote> 
  <p>Apesar de voc&ecirc; freq&uuml;entemente distribuir sua chave p&uacute;blica 
    e obter as chaves p&uacute;blicas de outros cortando e colando o texto puro 
    de um servidor de chaves p&uacute;blico ou corporativo, voc&ecirc; tamb&eacute;m 
    pode trocar chaves importando-as e exportando-as como arquivos texto separados. 
    Por exemplo, algu&eacute;m poderia entregar-lhe um disco contendo sua chave 
    p&uacute;blica, ou voc&ecirc; poderia tornar sua chave p&uacute;blica dispon&iacute;vel 
    em um servidor FTP.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para importar 
    uma chave de um arquivo</font></b></p>
  <ol>
    <li>Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li>Escolha &quot;Import&quot; (Importar) no menu &quot;Keys&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Import&quot; aparece.<br>
      <br>
    </li>
    <li>Selecione o arquivo que cont&eacute;m a chave que voc&ecirc; quer importar, 
      ent&atilde;o clique &quot;Open&quot; (Abrir).<br>
      <br>
      A caixa de di&aacute;logo &quot;Import Selection&quot; (Importar Sele&ccedil;&atilde;o) 
      &eacute; aberta.<br>
      <br>
    </li>
    <li>Selecione a(s) chave(s) que voc&ecirc; deseja importar para seu chaveiro, 
      ent&atilde;o clique o bot&atilde;o &quot;Import&quot;.<br>
      <br>
    </li>
    <li>A(s) chave(s) importada(s) aparece(m) na janela de PGPkeys, onde voc&ecirc; 
      pode us&aacute;-la(s) para codificar dados ou para verificar a assinatura 
      digital de algu&eacute;m.</li>
  </ol>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para adicionar 
    uma chave de uma mensagem de email</font></b></p>
  <p>Se um colega enviar-lhe uma mensagem de email com sua chave dentro (como 
    um bloco de texto) voc&ecirc; pode adicion&aacute;-la a seu chaveiro.</p>
  <ol>
    <li>Enquanto a janela da mensagem de email est&aacute; aberta, abra a janela 
      de PGPkeys.<br>
      <br>
    </li>
    <li>Coloque as duas janelas lado a lado de forma que voc&ecirc; possa ver 
      parte da janela de PGPkeys atr&aacute;s da janela da mensagem.<br>
      <br>
    </li>
    <li>Selecione o texto da chave, incluindo o texto &quot;BEGIN PGP PUBLIC KEY 
      BLOCK&quot; e &quot;END PGP PUBLIC KEY BLOCK&quot;, e arraste o texto na 
      janela de PGPkeys.<br>
      <br>
      A caixa de di&aacute;logo &quot;Import Selection&quot; (Importar Sele&ccedil;&atilde;o) 
      &eacute; aberta.<br>
      <br>
    </li>
    <li>Selecione a(s) chave(s) que voc&ecirc; deseja importar para seu chaveiro, 
      ent&atilde;o clique o bot&atilde;o &quot;Import&quot;.<br>
      <br>
    </li>
    <li>A(s) chave(s) importada(s) aparece(m) na janela de PGPkeys, onde voc&ecirc; 
      pode us&aacute;-la(s) para codificar dados ou para verificar a assinatura 
      digital de algu&eacute;m.</li>
  </ol>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para exportar 
    uma chave para um arquivo</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione a chave que voc&ecirc; quer exportar para um arquivo.<br>
      <br>
    </li>
    <li>Escolha &quot;Export&quot; (Exportar) no menu &quot;Keys&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Export&quot; aparece.<br>
      <br>
    </li>
    <li>Insira o nome do arquivo ou navegue ao arquivo para onde voc&ecirc; quer 
      que a chave seja exportada, e clique &quot;Save&quot;.<br>
      <br>
      A chave exportada &eacute; salva no arquivo com o nome dado na pasta especificada.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Revogando 
  uma chave</font></b></p>
<blockquote> 
  <p>Se alguma vez acontecer de voc&ecirc; n&atilde;o mais confiar em seu par 
    pessoal de chaves, voc&ecirc; pode emitir uma revoga&ccedil;&atilde;o para 
    o mundo dizendo para pararem de usar sua chave p&uacute;blica. A melhor forma 
    de circular uma chave revogada &eacute; coloc&aacute;-la em um servidor de 
    chaves p&uacute;blicas .</p>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para revogar 
    uma chave</b></font></p>
  <ol>
    <li> Abra o programa PGPkeys.<br>
      <br>
    </li>
    <li>Selecione o par de chaves que voc&ecirc; quer revogar.<br>
      <br>
    </li>
    <li>Escolha &quot;Revoke&quot; no menu &quot;Keys&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Revocation Confirmation&quot; (Confirma&ccedil;&atilde;o 
      de Revoga&ccedil;&atilde;o) aparece.<br>
      <br>
    </li>
    <li>Clique OK para confirmar seu intuito de revogar a chave selecionada.<br>
      <br>
      A caixa de di&aacute;logo &quot;Enter Passphrase&quot; aparece.<br>
      <br>
    </li>
    <li>Insira sua frase-senha, ent&atilde;o clique OK.<br>
      <br>
      Quando voc&ecirc; revoga uma chave, ela &eacute; cruzada com uma linha vermelha 
      para indicar que ela n&atilde;o &eacute; mais v&aacute;lida.<br>
      <br>
    </li>
    <li>Envie a chave revogada ao servidor de forma que todos saber&atilde;o que 
      n&atilde;o devem mais usar sua chave antiga.<br>
      <br>
      &Eacute; poss&iacute;vel que voc&ecirc; se esque&ccedil;a sua frase-senha 
      algum dia ou perca sua chave privada. Em qualquer desses casos, voc&ecirc; 
      nunca mais poder&aacute; usar sua chave novamente, e voc&ecirc; n&atilde;o 
      ter&aacute; como revogar sua chave antiga quando criar uma nova chave. Para 
      se prevenir contra esta possibilidade, voc&ecirc; pode apontar uma outra 
      pessoa como revogador da chave em seu chaveiro p&uacute;blico, para revogar 
      sua chave. Esta pessoa que voc&ecirc; designar poder&aacute; revogar sua 
      chave DH/DSS, envi&aacute;-la ao servidor e ser&aacute; como se voc&ecirc; 
      a tivesse revogado voc&ecirc; mesmo.</li>
  </ol>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048"><a name="para_apontar_um_revogador_designado"></a>Para 
    apontar um revogador designado</font></b></p>
  <ol>
    <li>Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li>Selecione o par de chaves para o qual voc&ecirc; quer designar um revogador.<br>
      <br>
    </li>
    <li>Selecione &quot;Add/Revoker&quot; (Adicionar/Revogador) do menu &quot;Keys&quot;.<br>
      <br>
      Uma caixa de di&aacute;logo &eacute; aberta e mostra uma lista de chaves.<br>
      <br>
    </li>
    <li>Selecione a(s) chave(s) na lista de &quot;User ID&quot; que voc&ecirc; 
      quer apontar como um revogador designado.<br>
      <br>
    </li>
    <li>Clique OK.<br>
      <br>
      Uma caixa de di&aacute;logo de confirma&ccedil;&atilde;o aparece.<br>
      <br>
    </li>
    <li>Clique OK para continuar.<br>
      <br>
      A caixa de di&aacute;logo &quot;Passphrase&quot; aparece.<br>
      <br>
    </li>
    <li>Insira sua frase-senha, ent&atilde;o clique OK.<br>
      <br>
    </li>
    <li>A(s) chave(s) selecionada(s) agora est&aacute;(&atilde;o) autorizada(s) 
      a revogar sua chave. Para um gerenciamento efetivo de chaves, distribua 
      uma c&oacute;pia atual de sua chave para o(s) revogador(es) ou envie sua 
      chave para o servidor. Veja <a href="3%20-%20Criando%20e%20Trocando%20Chaves.htm#distribuindo_chave_publica">&quot;Distribuindo 
      sua chave p&uacute;blica&quot; na p&aacute;gina 46</a> para instru&ccedil;&otilde;es.</li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<p><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><b><a name="configurando_preferencias"></a>Configurando 
  suas prefer&ecirc;ncias</b></font></p>
<blockquote> 
  <p>PGP &eacute; configurado para acomodar as necessidades da maioria dos usu&aacute;rios, 
    mas voc&ecirc; tem a op&ccedil;&atilde;o de ajustar algumas das configura&ccedil;&otilde;es 
    para adequ&aacute;-las a seu ambiente particular de computa&ccedil;&atilde;o. 
    Voc&ecirc; especifica estas configura&ccedil;&otilde;es atrav&eacute;s da 
    caixa de di&aacute;logo &quot;Preferences&quot; (Prefer&ecirc;ncias) do menu 
    &quot;Edit&quot; de PGPkeys.</p>
  <p> <font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para configurar 
    prefer&ecirc;ncias gerais</b></font></p>
  <ol>
    <li>Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li> No menu &quot;Edit&quot; de PGPkeys, escolha &quot;Preferences&quot;.<br>
      <br>
      O menu &quot;Preferences&quot; se abre com a aba &quot;General&quot; (Geral) 
      aparecendo (<a href="#6-8">figura 6-8</a>).<br>
      <br>
      <div align="center"> <a name="6-8"></a><img src="preferences_general.gif" width="297" height="273"><br>
        <font face="Arial, Helvetica, sans-serif" size="2"><b>Figura 6-8. Caixa 
        de di&aacute;logo &quot;Preferences&quot; (aba General)</b></font></div>
      <br>
    </li>
    <li> Selecione as configura&ccedil;&otilde;es gerais de codifica&ccedil;&atilde;o 
      na aba &quot;General&quot;. Suas op&ccedil;&otilde;es s&atilde;o: <br>
      <br>
      <ul>
        <li><b>Always Encrypt to Default Key</b> (Sempre Codificar para a Chave 
          Padr&atilde;o). Quando esta configura&ccedil;&atilde;o est&aacute; habilitada, 
          todas as mensagens de email e arquivos anexados que voc&ecirc; codificar 
          com a chave p&uacute;blica de um destinat&aacute;rio tamb&eacute;m ser&atilde;o 
          codificadas para voc&ecirc;, usando sua chave p&uacute;blica padr&atilde;o. 
          &Eacute; &uacute;til deixar esta configura&ccedil;&atilde;o habilitada, 
          para que voc&ecirc; tenha a op&ccedil;&atilde;o de decifrar os conte&uacute;dos 
          de quaisquer emails ou arquivos que voc&ecirc; codificou anteriormente.<br>
          <br>
        </li>
        <li><b>Faster Key Generation</b> (Gera&ccedil;&atilde;o Mais R&aacute;pida 
          de Chave). Quando esta configura&ccedil;&atilde;o est&aacute; habilitada, 
          &eacute; necess&aacute;rio menos tempo para gerar um novo par de chaves 
          Diffie-Hellman/DSS. Este processo &eacute; acelerado usando um conjunto 
          previamente calculado de n&uacute;meros primos, ao inv&eacute;s de passar 
          pelo demorado processo de cri&aacute;-los a partir do zero a cada vez 
          que uma nova chave &eacute; gerada. Entretanto, lembre-se de que a gera&ccedil;&atilde;o 
          mais r&aacute;pida de chaves est&aacute; implementada apenas para as 
          op&ccedil;&otilde;es de tamanhos fixos e pr&eacute;-definidos de chaves 
          acima de 1024 e abaixo de 4096 quando se cria uma chave, e n&atilde;o 
          &eacute; &uacute;til se voc&ecirc; entrar outro valor qualquer. Apesar 
          de ser dif&iacute;cil para qualquer um quebrar sua chave baseado no 
          conhecimento desses n&uacute;meros primos pr&eacute;-preparados, algumas 
          pessoas podem querer gastar este tempo extra para criar um par de chaves 
          com n&iacute;vel m&aacute;ximo de seguran&ccedil;a..<br>
          <br>
          A cren&ccedil;a geral da comunidade criptogr&aacute;fica &eacute; que 
          usar n&uacute;meros primos pr&eacute;-preparados n&atilde;o prov&ecirc; 
          diminui&ccedil;&atilde;o de seguran&ccedil;a para algoritmos Diffie-Hellman/DSS. 
          Se este recurso o deixa desconfort&aacute;vel, voc&ecirc; pode desabilit&aacute;-lo. 
          Para maiores informa&ccedil;&otilde;es, leia o FAQ localizado no website 
          da Network Associates.<br>
          <br>
        </li>
        <li><b>Cache Decryption Passphrases for...</b> (Guardar Frases-Senhas 
          de Decifra&ccedil;&atilde;o por...) Quando esta configura&ccedil;&atilde;o 
          est&aacute; habilitada, sua frase-senha de decifra&ccedil;&atilde;o 
          &eacute; automaticamente armazenada na mem&oacute;ria de seu computador. 
          Especifique a freq&uuml;&ecirc;ncia (em horas: minutos: segundos) na 
          qual voc&ecirc; deseja salvar sua frase-senha. O valor padr&atilde;o 
          &eacute; 2 minutos.<br>
          <br>
        </li>
        <li><b>Cache Signing Passphrases for...</b> (Guardar Frases-Senhas de 
          Assinatura por...) Quando esta configura&ccedil;&atilde;o est&aacute; 
          habilitada, sua frase-senha de assinatura &eacute; automaticamente armazenada 
          na mem&oacute;ria de seu computador. Especifique a freq&uuml;&ecirc;ncia 
          (em horas: minutos: segundos) na qual voc&ecirc; deseja salvar sua frase-senha 
          de assinatura. O valor padr&atilde;o &eacute; 2 minutos.<br>
          <br>
        </li>
        <li><b>Comment Block</b> (Bloco de Coment&aacute;rio). Voc&ecirc; pode 
          adicionar um texto de coment&aacute;rio nesta &aacute;rea. O texto sempre 
          ser&aacute; inclu&iacute;do em mensagens e arquivos que voc&ecirc; codificar 
          ou assinar.<br>
          <br>
        </li>
        <li><b>Warn Before Wiping Files</b> (Avisar Antes de Eliminar Arquivos). 
          Quando esta configura&ccedil;&atilde;o est&aacute; habilitada, uma caixa 
          de di&aacute;logo aparece antes de voc&ecirc; eliminar um arquivo, para 
          lhe dar uma &uacute;ltima chance de mudar de id&eacute;ia antes que 
          PGP sobrescreva seguramente o conte&uacute;do do arquivo e apague-o 
          de seu computador.<br>
          <br>
        </li>
      </ul>
    </li>
    <li> Clique OK para salvar suas altera&ccedil;&otilde;es e retornar ao menu 
      PGPkeys, ou escolha outra aba para continuar a configurar suas prefer&ecirc;ncias 
      de PGP.</li>
  </ol>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para configurar 
    prefer&ecirc;ncias de arquivos</font></b></p>
  <p>Use a aba &quot;Files&quot; (Arquivos) para especificar a localiza&ccedil;&atilde;o 
    dos chaveiros utilizados para armazenar suas chaves privadas e p&uacute;blicas.</p>
  <ol>
    <li>Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li> Selecione &quot;Preferences&quot; no menu &quot;Edit&quot; de PGPkeys, 
      ent&atilde;o escolha a aba &quot;Files&quot;.<br>
      <br>
      O menu &quot;Preferences&quot; se abre com a aba &quot;Files&quot; (Arquivos) 
      aparecendo (<a href="#6-9">figura 6-9</a>).<br>
      <br>
      <div align="center"> <a name="6-9"></a><img src="preferences_files.gif" width="298" height="272"><br>
        <font face="Arial, Helvetica, sans-serif" size="2"><b>Figura 6-9. Caixa 
        de di&aacute;logo &quot;Preferences&quot; (aba Files)</b></font></div>
      <br>
    </li>
    <li>Use os bot&otilde;es listados na aba &quot;Arquivos&quot; para configurar 
      os locais apropriados para seus chaveiros p&uacute;blicos e privados, e/ou 
      o arquivo de inicializa&ccedil;&atilde;o de n&uacute;meros aleat&oacute;rios: 
      <br>
      <br>
      <ul>
        <li><b>Public Keyring File</b> (Arquivo do Chaveiro P&uacute;blico). Exibe 
          o local atual e o nome do arquivo onde PGP espera encontrar o arquivo 
          de seu chaveiro p&uacute;blico. Se voc&ecirc; pretende armazenar suas 
          chaves p&uacute;blicas em um arquivo com um nome diferente, ou em algum 
          outro local, voc&ecirc; especifica esta informa&ccedil;&atilde;o aqui. 
          O local que voc&ecirc; especificar tamb&eacute;m ser&aacute; usado para 
          armazenar todos os <i>backups</i> autom&aacute;ticos de seu chaveiro 
          p&uacute;blico.<br>
          <br>
        </li>
        <li><b>Private Keyring File</b> (Arquivo do Chaveiro Privado). Exibe o 
          local atual e o nome do arquivo onde PGP espera encontrar o arquivo 
          de seu chaveiro privado. Se voc&ecirc; pretende armazenar suas chaves 
          privadas em um arquivo com um nome diferente, ou em algum outro local, 
          voc&ecirc; especifica esta informa&ccedil;&atilde;o aqui. Alguns usu&aacute;rios 
          gostam de manter suas chaves privadas em um disquetes, que eles ent&atilde;o 
          inserem como uma chave &quot;real&quot; sempre que precisam assinar 
          ou decifrar arquivos. O local que voc&ecirc; especificar tamb&eacute;m 
          ser&aacute; usado para armazenar todos os <i>backups</i> autom&aacute;ticos 
          de seu chaveiro privado. <br>
          <br>
        </li>
        <li><b>Set Random Seed Location</b> (Configurar Localiza&ccedil;&atilde;o 
          do Arquivo de Inicializa&ccedil;&atilde;o de N&uacute;meros Aleat&oacute;rios). 
          Exibe a localiza&ccedil;&atilde;o do arquivos de inicializa&ccedil;&atilde;o 
          de n&uacute;meros aleat&oacute;rios. Alguns usu&aacute;rios podem desejar 
          manter seu arquivo de inicializa&ccedil;&atilde;o de n&uacute;meros 
          aleat&oacute;rios em um local seguro para prevenir-se de altera&ccedil;&otilde;es. 
          J&aacute; que este m&eacute;todo de ataque &eacute; bastante dif&iacute;cil, 
          e j&aacute; foi antecipado por PGP, mover o arquivo de inicializa&ccedil;&atilde;o 
          de n&uacute;meros aleat&oacute;rios de seu local padr&atilde;o &eacute; 
          de pouca vantagem.<br>
          <br>
        </li>
      </ul>
    </li>
    <li>Clique OK para salvar suas altera&ccedil;&otilde;es e retornar ao menu 
      PGPkeys, ou escolha outra aba para continuar a configurar suas prefer&ecirc;ncias 
      de PGP.</li>
  </ol>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para configurar 
    prefer&ecirc;ncias de email</b></font></p>
  <p>Use a aba &quot;Email&quot; para especificar as prefer&ecirc;ncias que afetam 
    a forma que as fun&ccedil;&otilde;es de PGP s&atilde;o implementadas para 
    seu aplicativo particular de email. Lembre-se de que nem todas as sele&ccedil;&otilde;es 
    podem se aplicar a seu programa particular de email.</p>
  <ol>
    <li>Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li>Selecione &quot;Preferences&quot; no menu &quot;Edit&quot; de PGPkeys, 
      e clique a aba &quot;Email&quot;.<br>
      <br>
      O menu &quot;Preferences&quot; abre-se, com a aba &quot;Email&quot; aparecendo 
      (<a href="#6-10">Figura 6-10</a>).<br>
      <br>
      <div align="center"> <a name="6-10"></a><img src="preferences_email.gif" width="296" height="270"><br>
        <font face="Arial, Helvetica, sans-serif" size="2"><b>Figura 6-10. Caixa 
        de di&aacute;logo &quot;Preferences&quot; (aba Email) </b></font></div>
      <br>
    </li>
    <li>Selecione suas prefer&ecirc;ncias de codifica&ccedil;&atilde;o de email 
      na aba &quot;Email&quot;. Suas op&ccedil;&otilde;es s&atilde;o: <br>
      <br>
      <ul>
        <li><b>Use PGP/MIME when sending mail</b> (Usar PGP/MIME quando enviando 
          correspond&ecirc;ncia). Se voc&ecirc; estiver usando Eudora e habilitar 
          esta configura&ccedil;&atilde;o, todas as suas mensagens de email e 
          arquivos anexados ser&atilde;o automaticamente codificados para os destinat&aacute;rios 
          especificados. Esta configura&ccedil;&atilde;o n&atilde;o tem efeito 
          em outras codifica&ccedil;&otilde;es que voc&ecirc; fizer atrav&eacute;s 
          da &Aacute;rea de Transfer&ecirc;ncia ou com o Windows Explorer e n&atilde;o 
          deve ser usada se voc&ecirc; planeja enviar email para destinat&aacute;rios 
          cujo aplicativo de email n&atilde;o suporte o padr&atilde;o PGP/MIME. 
          Usando Eudora, anexos sempre ser&atilde;o codificados seja qual for 
          esta configura&ccedil;&atilde;o, mas se o destinat&aacute;rio n&atilde;o 
          possuir PGP/MIME, o processo de decifra&ccedil;&atilde;o ser&aacute; 
          mais manual.<br>
          <br>
        </li>
        <li><b>Encrypt new messages by default</b> (Codificar novas mensagens 
          por padr&atilde;o). Se voc&ecirc; habilitar esta configura&ccedil;&atilde;o, 
          todas as suas mensagens de email e anexos de arquivos s&atilde;o automaticamente 
          codificadas. Alguns aplicativos de email n&atilde;o suportam este recurso.<br>
          <br>
        </li>
        <li><b>Sign new messages by default</b> (Assinar novas mensagens por padr&atilde;o). 
          Se voc&ecirc; habilitar esta configura&ccedil;&atilde;o, todas as suas 
          mensagens de email e anexos de arquivos s&atilde;o automaticamente assinadas. 
          Alguns aplicativos de email n&atilde;o suportam este recurso. Este recurso 
          n&atilde;o tem efeito em outras assinaturas que voc&ecirc; adicionar 
          atrav&eacute;s da &Aacute;rea de Transfer&ecirc;ncia ou com o Windows 
          Explorer.<br>
          <br>
        </li>
        <li><b>Automatically decrypt/verify when opening messages</b> (Automaticamente 
          decifrar/verificar quando abrindo mensagens). Se voc&ecirc; habilitar 
          esta configura&ccedil;&atilde;o, todas as suas mensagens de email e 
          anexos de arquivos que est&atilde;o codificados e/ou assinados s&atilde;o 
          automaticamente decifrados e verificados. Alguns aplicativos de email 
          n&atilde;o suportam este recurso.<br>
          <br>
        </li>
        <li><b>Word wrap clear-signed messages at column [ ]</b> (Quebrar linha 
          em mensagens de texto na coluna []). Esta configura&ccedil;&atilde;o 
          especifica o n&uacute;mero da coluna onde um sinal &quot;carriage return&quot; 
          &eacute; usado para quebrar o texto em sua assinatura digital para a 
          pr&oacute;xima linha. Este recurso &eacute; necess&aacute;rio porque 
          nem todos os aplicativos manipulam a quebra de linha da mesma forma, 
          o que poderia fazer com que as linhas em sua mensagem assinada digitalmente 
          fossem quebradas de uma forma que n&atilde;o poderiam ser facilmente 
          lidas. A configura&ccedil;&atilde;o padr&atilde;o &eacute; 70, o que 
          previne problemas com a maioria dos aplicativos.<br>
          <br>
          <b>ATEN&Ccedil;&Atilde;O</b>: Se voc&ecirc; alterar a configura&ccedil;&atilde;o 
          de quebra de linha em PGP, certifique-se de que ela &eacute; menor que 
          a configura&ccedil;&atilde;o de quebra de linha em seu aplicativo de 
          email. Se voc&ecirc; a configurar para um tamanho igual ou maior, sinais 
          de &quot;carriage return&quot; podem ser adicionados e invalidar sua 
          assinatura PGP.<br>
          <br>
        </li>
      </ul>
    </li>
    <li>Clique OK para salvar suas altera&ccedil;&otilde;es e retornar ao menu 
      PGPkeys, ou escolha outra aba para continuar a configurar suas prefer&ecirc;ncias 
      de PGP. </li>
  </ol>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b>Para configurar 
    prefer&ecirc;ncias de servidores</b></font></p>
  <p>Use a aba &quot;Server&quot; (Servidor) para especificar configura&ccedil;&otilde;es 
    para os servidores de chaves p&uacute;blicas que voc&ecirc; est&aacute; usando 
    para enviar e obter chaves p&uacute;blicas, com os quais voc&ecirc; automaticamente 
    sincroniza chaves.</p>
  <ol>
    <li>Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li>Selecione &quot;Preferences&quot; no menu &quot;Edit&quot; de PGPkeys, 
      ent&atilde;o escolha a aba &quot;Server&quot;.<br>
      <br>
    </li>
    <li>O menu &quot;Preferences&quot; se abre com a aba &quot;Server&quot; (Servidor) 
      aparecendo (<a href="#6-11">figura 6-11</a>).<br>
      <br>
      <div align="center"><a name="6-11"></a><img src="preferences_servers.gif" width="299" height="273"><br>
        <font face="Arial, Helvetica, sans-serif" size="2"><b>Figura 6-11. Caixa 
        de di&aacute;logo &quot;Preferences&quot; (aba Server)</b></font></div>
      <br>
      A coluna &quot;Domain&quot; (Dom&iacute;nio) lista o dom&iacute;nio Internet 
      (algo como &quot;companhia.com&quot;) do(s) servidor(es) dispon&iacute;vel(is). 
      Quando enviando chaves a um servidor, PGP tenta encontrar o dom&iacute;nio 
      da chave nesta lista, e assim encontrar a entrada apropriada no servidor. 
      Se o dom&iacute;nio n&atilde;o for encontrado, um servidor para o primeiro 
      servidor de dom&iacute;nio mundial que serve todas as chaves ser&aacute; 
      usado, e outros servidores de dom&iacute;nio mundial a seguir na lista poder&atilde;o 
      ser procurados se a primeira procura n&atilde;o for bem sucedida.<br>
      <br>
    </li>
    <li>Para configurar suas prefer&ecirc;ncias de servidores, use estes bot&otilde;es:<br>
      <br>
      <ul>
        <li><b>New</b> (Novo). Adiciona um novo servidor &agrave; sua lista.<br>
          <br>
        </li>
        <li><b>Remove</b> (Remover). Remove o servidor atualmente selecionado 
          de sua lista.<br>
          <br>
        </li>
        <li><b>Edit</b> (Editar). Permite que voc&ecirc; edite informa&ccedil;&otilde;es 
          do servidor para o servidor atualmente selecionado.<br>
          <br>
        </li>
        <li><b>Set root server</b> (Especificar servidor raiz). Identifica o servidor 
          raiz que &eacute; usado para opera&ccedil;&otilde;es espec&iacute;ficas 
          de corpora&ccedil;&otilde;es, como atualizar listas de grupos, enviar 
          listas de grupos, atualizar apresentadores etc. Em configura&ccedil;&otilde;es 
          corporativas, seu gerente de seguran&ccedil;a j&aacute; ter&aacute; 
          configurado isto.<br>
          <br>
        </li>
      </ul>
    </li>
    <li>Na &aacute;rea &quot;Synchronize with server upon:&quot; (Sincronizar 
      com o servidor quando:), selecione as op&ccedil;&otilde;es para usar quando 
      sincronizando seu chaveiro privado com seu(s) servidor(es) de chaves. Suas 
      op&ccedil;&otilde;es s&atilde;o: <br>
      <br>
      <ul>
        <li><b>Encrypting to unknown keys</b> (Codificando para chaves desconhecidas). 
          Selecione esta op&ccedil;&atilde;o para fazer com que PGP automaticamente 
          procure destinat&aacute;rios desconhecidos no servidor, para localizar 
          usu&aacute;rios que n&atilde;o est&atilde;o em seu chaveiro quando codificado 
          email.<br>
          <br>
        </li>
        <li><b>Adding names/photos/revokers</b> (Adicionando nomes/fotos/revogadores). 
          Selecione esta op&ccedil;&atilde;o para fazer com que chaves para as 
          quais voc&ecirc; adicionou nomes, fotografias, ou revogadores sejam 
          primeiro atualizadas a partir do servidor e ent&atilde;o suas altera&ccedil;&otilde;es 
          enviadas ao servidor ap&oacute;s completar a atualiza&ccedil;&atilde;o. 
          Atualizar a chave antes certifica que, por exemplo, a chave n&atilde;o 
          foi revogada desde a &uacute;ltima vez que voc&ecirc; a atualizou.<br>
          <br>
        </li>
        <li><b>Signing keys</b> (Assinando chaves). Selecione esta op&ccedil;&atilde;o 
          para fazer com que chaves para as quais voc&ecirc; est&aacute; adicionando 
          sua assinatura sejam primeiro atualizadas a partir do servidor e ent&atilde;o 
          suas altera&ccedil;&otilde;es enviadas ao servidor ap&oacute;s completar 
          a atualiza&ccedil;&atilde;o.<br>
          <br>
        </li>
        <li><b>Revocations</b> (Revoga&ccedil;&otilde;es). Selecione esta op&ccedil;&atilde;o 
          para fazer com que chaves que voc&ecirc; est&aacute; revogando sejam 
          primeiro atualizadas a partir do servidor e ent&atilde;o suas altera&ccedil;&otilde;es 
          enviadas ao servidor ap&oacute;s completar a atualiza&ccedil;&atilde;o. 
          <br>
          <br>
        </li>
        <li><b>Verification</b> (Verifica&ccedil;&atilde;o). Selecione esta op&ccedil;&atilde;o 
          para fazer com que PGP automaticamente procure e importe a partir do 
          servidor de chaves quando verificando um email ou arquivo assinado para 
          o qual voc&ecirc; n&atilde;o possui a chave p&uacute;blica do emitente.<br>
          <br>
        </li>
      </ul>
    </li>
    <li>Clique OK para salvar suas altera&ccedil;&otilde;es e retornar ao menu 
      PGPkeys, ou escolha outra aba para continuar a configurar suas prefer&ecirc;ncias 
      de PGP.</li>
  </ol>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif" size="2"><b>Para 
    adicionar um servidor de chaves &agrave; lista de servidores</b></font></p>
  <ol>
    <li> Abra a janela de prefer&ecirc;ncias (&quot;Preferences&quot;). ent&atilde;o 
      clique a aba &quot;Servers&quot;.<br>
      <br>
    </li>
    <li>Clique o bot&atilde;o &quot;New&quot; (Novo).<br>
      <br>
      A caixa de di&aacute;logo &quot;Add New Server&quot; (Adicionar Novo Servidor) 
      aparece, como mostrado na <a href="#6-12">figura 6-12</a>.<br>
      <br>
      <div align="center"><a name="6-12"></a><img src="server_add_new.gif" width="287" height="253"><br>
        <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 6-12. Caixa 
        de di&aacute;logo &quot;Add New Server&quot;</b></font></div>
      <br>
    </li>
    <li>Na caixa &quot;Protocol&quot; (Protocolo), selecione um protocolo para 
      usar para acessar o servidor. Suas op&ccedil;&otilde;es s&atilde;o LDAP, 
      LDAPS, e HTTP.<br>
      <br>
    </li>
    <li>Na caixa &quot;Server Name&quot; (Nome do Servidor), entre o nome de dom&iacute;nio 
      ou endere&ccedil;o IP do servidor. Por exemplo, servidor.companhia.com ou 
      123.445.67.<br>
      <br>
    </li>
    <li>Digite o n&uacute;mero da porta do servidor na caixa &quot;Port&quot; 
      (Porta). Por exemplo, 11371 &eacute; usada por servidores de certifica&ccedil;&atilde;o 
      HTTP antigos, 389 &eacute; comumente usada para servidores de certifica&ccedil;&atilde;o 
      LDAP usados comumente.<br>
      <br>
    </li>
    <li>A caixa &quot;Server Key&quot; (Chave do Servidor) &eacute; usada por 
      servidores LDAPS. A chave do servidor &eacute; usada pelo servidor para 
      autenticar uma conex&atilde;o (informa&ccedil;&otilde;es sobre chaves n&atilde;o 
      s&atilde;o exibidas at&eacute; que voc&ecirc; se conecte ao servidor).<br>
      <br>
    </li>
    <li>Selecione a op&ccedil;&atilde;o &quot;Any Domain&quot; (Qualquer Dom&iacute;nio) 
      para permitir que PGP envie chaves a partir de qualquer dom&iacute;nio para 
      este servidor de chaves. Esta op&ccedil;&atilde;o est&aacute; habilitada 
      por padr&atilde;o.<br>
      <br>
      Se voc&ecirc; quer que PGP envie apenas chaves de um dom&iacute;nio espec&iacute;fico 
      para este servidor de chaves, selecione a op&ccedil;&atilde;o abaixo de 
      &quot;Any Domain&quot;. Ent&atilde;o, insira o nome do dom&iacute;nio no 
      espa&ccedil;o fornecido. Por exemplo, se voc&ecirc; especificar o dom&iacute;nio 
      companhia.com, apenas aquelas chaves cujo endere&ccedil;o de email terminem 
      com companhia.com ser&atilde;o enviados para este servidor.<br>
      <br>
    </li>
    <li>Selecione a caixa &quot;List in Search Window&quot; (Listar na Janela 
      de Pesquisa) se voc&ecirc; quer que este servidor de chaves seja listado 
      na janela de pesquisa de PGPkeys.</li>
  </ol>
  <p><font color="#A00048" face="Arial, Helvetica, sans-serif"><b><a name="config_preferencias_avancadas"></a>Para 
    configurar prefer&ecirc;ncias avan&ccedil;adas</b></font></p>
  <p>Use a aba &quot;Advanced&quot; para exibir a aba onde voc&ecirc; selecione 
    algoritmos de criptografia de chaves e op&ccedil;&otilde;es de confian&ccedil;a 
    para chaves.</p>
  <p> PGP d&aacute; a voc&ecirc; a op&ccedil;&atilde;o de selecionar e/ou alterar 
    algoritmos de criptografia de chaves. Voc&ecirc; pode selecionar o algoritmo 
    de criptografia para suas chaves PGP: CAST (o padr&atilde;o), IDEA, ou Triple-DES. 
    Se voc&ecirc; deseja usar IDEA ou Triple-DES, voc&ecirc; deve fazer a sele&ccedil;&atilde;o 
    antes de gerar suas chaves. CAST &eacute; um novo algoritmo no qual PGP e 
    outros cript&oacute;grafos possuem uma confian&ccedil;a muito alta, e Triple-DES 
    &eacute; um algoritmo do governo dos EUA que tem suportado o teste do tempo. 
    IDEA &eacute; o algoritmo usado por todas as chaves RSA geradas por PGP. Para 
    maiores informa&ccedil;&otilde;es sobre estes algoritmos, veja <a href="C%20-%20Phil%20Zimmermann%20sobre%20PGP.htm#algoritmos_simetricos_PGP">&quot;Os 
    algoritmos sim&eacute;tricos de PGP&quot; na p&aacute;gina 143</a>.</p>
  <p>A escolha para &quot;Preferred Algorithm&quot; (Algoritmo Preferido) afeta 
    o seguinte:</p>
  <ul>
    <li>Quando usando &quot;codifica&ccedil;&atilde;o convencional&quot;, a cifra 
      preferida &eacute; usada para codificar.<br>
      <br>
    </li>
    <li>Quando criando uma chave, a cifra preferida &eacute; gravada como parte 
      da chave de forma que outras pessoas ir&atilde;o usar este algoritmo quando 
      codificando para voc&ecirc;.</li>
  </ul>
  <p>A escolha para &quot;Allowed Algorithm&quot; (Algoritmos Permitidos) afeta 
    o seguinte:</p>
  <ul>
    <li>Quando criando uma chave, as cifras permitidas s&atilde;o gravadas como 
      parte da chave de forma que outras pessoas ir&atilde;o usar um destes algoritmos 
      quando codificando para voc&ecirc;, se o algoritmo preferido n&atilde;o 
      estiver dispon&iacute;vel para eles.<br>
      <br>
      <b>NOTA</b>: Codifica&ccedil;&atilde;o para uma chave p&uacute;blica ir&aacute; 
      falhar se nenhum dos algoritmos preferidos (&quot;Preferred Algorithm&quot;) 
      ou nenhum dos algoritmos dispon&iacute;veis (&quot;Allowed Algorithms&quot;) 
      estiverem dispon&iacute;veis para a pessoa que est&aacute; codificando a 
      mensagem.<br>
      <br>
      <b>ATEN&Ccedil;&Atilde;O</b>: Use as caixas para CAST, IDEA, e Triple-DES 
      apenas se voc&ecirc; subitamente decidiu que um algoritmo em particular 
      n&atilde;o &eacute; seguro. Por exemplo, se voc&ecirc; ficar sabendo que 
      Triple-DES foi quebrado, voc&ecirc; pode deselecionar aquela caixa e todas 
      as novas chaves que voc&ecirc; gerar ter&atilde;o um registro que indicar&aacute; 
      que Triple-DES n&atilde;o deve ser usado quando codificando para voc&ecirc;.</li>
  </ul>
  <p>PGP lhe d&aacute; a op&ccedil;&atilde;o de selecionar e/ou alterar como a 
    confian&ccedil;a de uma chave &eacute; exibida, e se voc&ecirc; deseja ou 
    n&atilde;o ser avisando quando voc&ecirc; codificar uma mensagem para uma 
    chave p&uacute;blica que possui uma Chave Adicional de Decodifica&ccedil;&atilde;o 
    (ADK, &quot;Additional 
    Decryption Key&quot;) associada. Na se&ccedil;&atilde;o &quot;Trust Model&quot; 
    (Modelo de Confian&ccedil;a), escolha uma das op&ccedil;&otilde;es:</p>
  <ul>
    <li><b>Display marginal validity level</b> (Exibir n&iacute;vel de validade 
      marginal). Use esta caixa para especificar se chaves marginalmente v&aacute;lidas 
      devem ser exibidas como tal, ou simplesmente exibir a validade como &quot;on&quot; 
      (ativada) ou &quot;off&quot; (desativada). Validades marginais aparecem 
      como &iacute;cones de barras possuindo diferentes padr&otilde;es de sombra. 
      Validade ativada/desativada aparece como &iacute;cones de c&iacute;rculos; 
      verde para v&aacute;lidas, cinza para inv&aacute;lidas (a chave n&atilde;o 
      foi validada, ela n&atilde;o foi assinada nem por um apresentador confi&aacute;vel 
      nem por voc&ecirc;).<br>
      <br>
    </li>
    <li><b>Treat marginally valid keys as invalid</b> (Tratar chaves marginalmente 
      v&aacute;lidas como inv&aacute;lidas). Use esta caixa para especificar se 
      deve-se tratar todas as chaves marginalmente v&aacute;lidas como inv&aacute;lidas. 
      A sele&ccedil;&atilde;o desta op&ccedil;&atilde;o causa a caixa de di&aacute;logo 
      &quot;Key Selection&quot; (Sele&ccedil;&atilde;o de Chaves) surgir sempre 
      que voc&ecirc; codificar para chaves marginalmente v&aacute;lidas.<br>
      <br>
    </li>
    <li><b>Warn when encrypting to an ADK</b> (Avisar quando codificando para 
      uma ADK). Use esta caixa para especificar se voc&ecirc; quer que PGP emita 
      um aviso sempre que uma chave com a qual se codificar&aacute; possui uma 
      Chave Adicional de Decodifica&ccedil;&atilde;o (ADK, &quot;Additional Decryption 
      Key&quot;) associada.<br>
      <br>
    </li>
    <li><b>Export format</b> (Formato de Exporta&ccedil;&atilde;o). <br>
      <br>
      <ul>
        <li><b>Compatible</b> (Compat&iacute;vel): Exporta chaves em um formato 
          compat&iacute;vel com vers&otilde;es anteriores de PGP.<br>
          <br>
        </li>
        <li><b>Complete</b> (Completa): Exporta para o novo formato de chaves, 
          que inclui IDs fotogr&aacute;ficos.</li>
      </ul>
    </li>
  </ul>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="procurando_chaves"></a>Procurando 
  por uma chave</font></b></p>
<blockquote> 
  <p>Voc&ecirc; pode procurar por chaves em chaveiros locais e servidores remotos 
    de chaves.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para procurar 
    pela chave de um usu&aacute;rio</font></b></p>
  <ol>
    <li> Abra o programa PGPkeys. <br>
      <br>
    </li>
    <li>Escolha &quot;Search&quot; (Procurar) a partir do menu &quot;Server&quot; 
      ou clique o bot&atilde;o &quot;Search&quot; (<img src="key_search.gif" width="37" height="35" align="absmiddle">) 
      no menu de PGPkeys.<br>
      <br>
      A janela de procura de PGPkeys aparece.<br>
      <br>
    </li>
    <li>Escolha o servidor que voc&ecirc; deseja pesquisar atrav&eacute;s do menu 
      &quot;Search for Keys On&quot; (Procurar por Chaves Em).<br>
      <br>
    </li>
    <li>Especifique seu crit&eacute;rio de procura:<br>
      <br>
      O padr&atilde;o &eacute; ID de usu&aacute;rio (&quot;User ID&quot;), mas 
      voc&ecirc; pode clicar as setas para selecionar &quot;Key ID&quot; (ID da 
      Chave), &quot;Key Status&quot; (Status da Chave), &quot;Key Type&quot; (Tipo 
      de Chave), &quot;Key Size&quot; (Tamanho da Chave), &quot;Creation Date&quot; 
      (Data de Cria&ccedil;&atilde;o), ou &quot;Expiration Date&quot; (Data de 
      Expira&ccedil;&atilde;o). Por exemplo, voc&ecirc; poderia procura por todas 
      as chaves com o ID de usu&aacute;rio de Fred.<br>
      <br>
    </li>
    <li>Especifique a condi&ccedil;&atilde;o pela qual voc&ecirc; est&aacute; 
      procurando.<br>
      <br>
      Voc&ecirc; pode usar qualquer uma das seguintes condi&ccedil;&otilde;es: 
      <br>
      <br>
      <ul>
        <li> Contains (Cont&eacute;m)<br>
          <br>
        </li>
        <li> Does Not Contain (N&atilde;o Cont&eacute;m)<br>
          <br>
        </li>
        <li>Is (&Eacute;)<br>
          <br>
        </li>
        <li>Is Not (N&atilde;o &Eacute;)<br>
          <br>
        </li>
        <li>Is Signed By (&Eacute; Assinado Por)<br>
          <br>
        </li>
        <li> Is Not Signed By (N&atilde;o &Eacute; Assinado Por)<br>
          <br>
        </li>
        <li> Is At Least (&Eacute; Ao Menos) (para datas de cria&ccedil;&atilde;o 
          ou expira&ccedil;&atilde;o)<br>
          <br>
        </li>
        <li> Is At Most (&Eacute; No M&aacute;ximo) (para datas de cria&ccedil;&atilde;o 
          ou expira&ccedil;&atilde;o)<br>
          <br>
        </li>
      </ul>
    </li>
    <li>Entre o valor pelo qual voc&ecirc; quer pesquisar.<br>
      <br>
    </li>
    <li>Clique &quot;More Choices&quot; (Mais Op&ccedil;&otilde;es) para adicionar 
      crit&eacute;rios adicionais para sua pesquisa; por exemplo, IDs de chaves 
      com o nome Fred criados em ou antes de 6 de outubro de 1997.<br>
      <br>
    </li>
    <li>Para iniciar a pesquisa, clique &quot;Search&quot;.<br>
      <br>
      Uma barra de progresso exibe que a procura est&aacute; sendo feita.<br>
      <br>
      <b>NOTA</b>: Para cancelar uma procura em progresso, clique &quot;Stop Search&quot; 
      (Parar Procura).<br>
      <br>
      Os resultados da procura aparecem na janela.<br>
      <br>
    </li>
    <li>Para importar as chaves, arraste-as para a janela principal de PGPkeys.<br>
      <br>
    </li>
    <li>Clique &quot;Clear Search&quot; (Limpar Procura) para limpar seus crit&eacute;rios 
      de pesquisa.</li>
  </ol>
</blockquote>
</body>
</html>
