<html>
<head>
<title>PGPdisk</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style></head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>PGPdisk</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>7</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Este cap&iacute;tulo descreve PGPdisk, seus recursos, e prov&ecirc; instru&ccedil;&otilde;es 
    sobre como us&aacute;-lo.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="o_que_e"></a>O 
  que &eacute; PGPdisk?</font></b></p>
<blockquote> 
  <p>PGPdisk &eacute; um aplicativo de criptografia simples de usar, que permite 
    que voc&ecirc; configure uma &aacute;rea de espa&ccedil;o em disco para armazenar 
    seus dados sens&iacute;veis. Este espa&ccedil;o reservado &eacute; usado para 
    criar um arquivo chamado &quot;volume PGPdisk&quot;. Apesar de ser um &uacute;nico 
    arquivo, um volume PGPdisk age de forma muito similar a um disco r&iacute;gido 
    em que ele prov&ecirc; espa&ccedil;o de armazenamento para seus arquivos e 
    aplicativos. Voc&ecirc; pode pensar nele como um disquete ou um disco r&iacute;gido 
    externo. Para usar os aplicativos e arquivos armazenados no volume, voc&ecirc; 
    o &quot;monta&quot;, ou o torna acess&iacute;vel a voc&ecirc;. Quando um volume 
    PGPdisk &eacute; montado, voc&ecirc; pode us&aacute;-lo como usaria qualquer 
    outro disco. Voc&ecirc; pode instalar aplicativos no volume ou mover ou salvar 
    seus arquivos neste volume. Quando o volume &eacute; desmontado ele fica inacess&iacute;vel 
    para qualquer um que n&atilde;o conhe&ccedil;a sua frase-senha secreta, que 
    &eacute; uma vers&atilde;o maior de uma senha. Mesmo um volume montado &eacute; 
    protegido: a n&atilde;o ser que um arquivo ou aplicativo esteja em uso, ele 
    &eacute; armazenado em formato codificado. Se seu computador travar enquanto 
    um volume estiver montado, o conte&uacute;do do volume permanece codificado.</p>
  <p><b>NOTA</b>: Produtos PGP encorajam voc&ecirc; a usar uma frase inteira ou 
    uma longa seq&uuml;&ecirc;ncia de caracteres para proteger dados sens&iacute;veis. 
    Tais &quot;frases-senha&quot; s&atilde;o geralmente mais seguras que as tradicionais 
    senhas de 6 a 10 caracteres.</p>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><b><a name="recursos"></a>Recursos 
  de PGPdisk </b></font></p>
<blockquote> 
  <p>O programa PGPdisk:</p>
  <ul>
    <li>Permite que voc&ecirc; crie volumes seguros de dados codificados que funcionam 
      como quaisquer outros volumes com os quais voc&ecirc; est&aacute; acostumado 
      a usar para armazenar seus arquivos.<br>
      <br>
    </li>
    <li>Prov&ecirc; codifica&ccedil;&atilde;o r&aacute;pida e segura de seus dados 
      com impacto m&iacute;nimo na quantidade de tempo que leva para acessar seus 
      programas e arquivos.<br>
      <br>
    </li>
    <li>Usa um algoritmo de criptografia forte, de n&iacute;vel militar, conhecido 
      como CAST, que possui uma s&oacute;lida reputa&ccedil;&atilde;o por sua 
      habilidade de resistir a acesso n&atilde;o autorizado.<br>
      <br>
    </li>
    <li>Armazena o conte&uacute;do de cada volume seguro em um arquivo codificado, 
      que pode ter seu <i>backup</i> facilmente realizado e trocado com colegas.</li>
  </ul>
</blockquote>
<p><b><font face="Arial, Helvetica, sans-serif" size="4" color="#A00048">Por que 
  usar PGPdisk?</font></b></p>
<blockquote> 
  <p>Enquanto outros produtos oferecem a voc&ecirc; a habilidade de restringir 
    acesso &agrave; arquivos em disco atrav&eacute;s de atributos de permiss&atilde;o 
    e prote&ccedil;&atilde;o de senhas simples, estas formas de seguran&ccedil;a 
    podem ser facilmente ser quebradas por algu&eacute;m que estejam realmente 
    intencionados a examinar seus dados. Apenas codificando seus dados voc&ecirc; 
    pode ter a certeza de que mesmo com as mais sofisticadas tecnologias de hoje, 
    &eacute; quase imposs&iacute;vel para qualquer pessoa decifrar o conte&uacute;do 
    de seus arquivos.</p>
  <p>Aqui est&atilde;o algumas raz&otilde;es para usar PGPdisk para dar seguran&ccedil;a 
    ao conte&uacute;do de seus arquivos:</p>
  <ul>
    <li> Para proteger informa&ccedil;&otilde;es financeiras, m&eacute;dicas ou 
      pessoais sens&iacute;veis que voc&ecirc; simplesmente n&atilde;o quer que 
      outros tenham acesso. Isto &eacute; particularmente importante no ambiente 
      de redes de hoje, onde informa&ccedil;&otilde;es em seu computador pessoal 
      est&atilde;o expostos para o mundo enquanto voc&ecirc; est&aacute; surfando 
      na rede.<br>
      <br>
    </li>
    <li>Para configurar &aacute;reas pessoais de trabalho em uma m&aacute;quina 
      compartilhada, onde a cada usu&aacute;rio &eacute; garantido um acesso exclusivo 
      a seus pr&oacute;prios programas e arquivos. Cada usu&aacute;rio pode montar 
      seus pr&oacute;prios volumes enquanto usando a m&aacute;quina, e ter a certeza 
      de que ningu&eacute;m mais pode acessar os arquivos uma vez que os volumes 
      forem desmontados.<br>
      <br>
    </li>
    <li>Para criar volumes de materiais que s&atilde;o acess&iacute;veis apenas 
      a membros designados de um determinado grupo de trabalho. Um volume pode 
      ser montado quando membros do time querem trabalhar em um determinado projeto 
      e podem ser desmontados e armazenados em seu formato criptografado quando 
      tiverem terminado.<br>
      <br>
    </li>
    <li>Para prevenir de que algu&eacute;m obtenha acesso a informa&ccedil;&otilde;es 
      propriet&aacute;rias armazenadas em um computador &quot;notebook&quot;. 
      Em geral, se voc&ecirc; perder seu notebook (ou algu&eacute;m roub&aacute;-lo), 
      todas as suas informa&ccedil;&otilde;es pessoais (incluindo acesso e senhas 
      para servi&ccedil;os on-line, contatos comerciais e pessoais, registros 
      financeiros etc), est&atilde;o sujeitos a uso indevido por aqueles que tenham 
      intento criminoso e podem acabar lhe custando mais do que o pre&ccedil;o 
      do notebook perdido.<br>
      <br>
    </li>
    <li>Para dar seguran&ccedil;a a conte&uacute;do de m&iacute;dias externas, 
      como disquetes e cartuchos de armazenagem. A habilidade de criptografar 
      m&iacute;dias externas prov&ecirc; um n&iacute;vel adicional de seguran&ccedil;a 
      para armazenagem e troca de informa&ccedil;&otilde;es sens&iacute;veis.</li>
  </ul>
  <p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Iniciando 
    o programa PGPdisk</font></b></p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para iniciar 
    PGPdisk</font></b></p>
  <ol>
    <li> Selecione Iniciar --&gt; Programas --&gt; PGP --&gt; PGPdisk.<br>
      <br>
      Isto abre a barra de ferramentas de PGPdisk como mostrado na <a href="#7-1">figura 
      7-1</a>.<br>
      <br>
      <div align="center"><a name="7-1"></a><img src="pgpdisk_toolbar.gif" width="312" height="129"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 
      7-1. A barra de ferramentas de PGPdisk</b></font></div></li>
  </ol>
  <p>A barra de ferramentas de PGPdisk prov&ecirc; uma forma conveniente de criar 
    e montar volumes. Aqui est&aacute; uma breve descri&ccedil;&atilde;o de cada 
    bot&atilde;o:</p>
</blockquote>
<table width="90%" border="0" cellspacing="25" align="center">
  <tr> 
    <td width="18%"><b>New</b> (Novo)</td>
    <td width="82%">Exibe o assistente de PGPdisk, que guia voc&ecirc; atrav&eacute;s 
      do processo de cria&ccedil;&atilde;o de um novo volume PGPdisk.</td>
  </tr>
  <tr> 
    <td width="18%"><b>Mount </b>(Montar)</td>
    <td width="82%"> Monta o volume PGPdisk especificado, desde que a frase-senha 
      correta tenha sido inserida.</td>
  </tr>
  <tr> 
    <td width="18%"><b>Unmount </b>(Desmontar)</td>
    <td width="82%"> Desmonta o volume PGPdisk especificado.</td>
  </tr>
  <tr> 
    <td width="18%"><b>Preferences </b>(Prefer&ecirc;ncias)</td>
    <td width="82%"> Especifica como voc&ecirc; prefere desmontar seus volumes.</td>
  </tr>
</table>
<p>&nbsp;</p>
<p><b><font color="#A00048" size="6" face="Arial, Helvetica, sans-serif"><a name="trabalhando_com_volumes"></a>Trabalhando 
  com volumes PGPdisk </font></b></p>
<p>Esta se&ccedil;&atilde;o explica como criar, montar e desmontar volumes PGPdisk 
  e como especificar as prefer&ecirc;ncias que protegem o conte&uacute;do dos 
  volumes, desmontando-os sob certas circunst&acirc;ncias.</p>
<p><b>NOTA</b>: Voc&ecirc; pode executar a maioria das opera&ccedil;&otilde;es 
  de PGPdisk clicando com o bot&atilde;o direito sobre o &iacute;cone do arquivo 
  do volume PGPdisk.</p>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Criando 
  um novo volume PGPdisk</font></b></p>
<blockquote> 
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para criar um 
    novo volume PGPdisk</font></b></p>
  <ol>
    <li> Inicie PGPdisk. A barra de ferramentas de PGPdisk aparece.<br>
      <br>
    </li>
    <li>Clique &quot;New&quot; (Novo). O Assistente de PGPdisk aparece em sua 
      tela. Leia as instru&ccedil;&otilde;es introdut&oacute;rias.<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot;.<br>
      <br>
    </li>
    <li>Especifique o nome e local do novo volume.<br>
      <br>
    </li>
    <li>Clique &quot;Save&quot;.<br>
      <br>
    </li>
    <li>Insira a quantidade de espa&ccedil;o que voc&ecirc; deseja reservar para 
      o novo volume (campo &quot;PGPdisk Size&quot;). Use n&uacute;meros inteiros, 
      sem casas decimais. Voc&ecirc; pode usar as setas para aumentar ou diminuir 
      o n&uacute;mero exibido neste campo. <br>
      <br>
      A quantidade de espa&ccedil;o livre em disco para o drive selecionado &eacute; 
      mostrada acima do campo &quot;Size&quot;.<br>
      <br>
    </li>
    <li>Clique o bot&atilde;o apropriado para selecionar kilobytes, megabytes, 
      ou gigabytes.<br>
      <br>
      Dependendo da quantidade de espa&ccedil;o em disco, voc&ecirc; pode criar 
      um volume de qualquer tamanho entre 100 kilobytes e 2 gigabytes.<br>
      <br>
    </li>
    <li>Selecione a letra do drive onde voc&ecirc; deseja montar seu volume PGPdisk 
      (campo &quot;PGPdisk Drive Letter&quot;). Voc&ecirc; pode usar a seta para 
      exibir e selecionar uma letra de drive diferente.<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot;.<br>
      <br>
    </li>
    <li>Insira a cadeia de letras e caracteres que servir&atilde;o como sua frase-senha 
      para acessar o novo volume (tamb&eacute;m chamada de &quot;frase-senha mestra 
      do volume&quot;). Para confirmar sua entrada, pressione &quot;Tab&quot; 
      para avan&ccedil;ar ao pr&oacute;ximo campo de texto, ent&atilde;o insira 
      a mesma frase-senha novamente. O tamanho m&iacute;nimo para uma frase-senha 
      &eacute; de 8 caracteres.<br>
      <br>
      Normalmente, como n&iacute;vel adicional de seguran&ccedil;a, os caracteres 
      que voc&ecirc; insere para a frase-senha n&atilde;o s&atilde;o mostrados 
      na tela. Entretanto, se voc&ecirc; est&aacute; certo de que ningu&eacute;m 
      est&aacute; olhando (fisicamente ou pela rede) e voc&ecirc; quer ver os 
      caracteres de sua frase-senha enquanto os digita, clique na caixa &quot;Hide 
      Typing&quot; (Esconder Digita&ccedil;&atilde;o).<br>
      <br>
      <b>NOTA</b>: Sua seguran&ccedil;a &eacute; apenas t&atilde;o boa quanto 
      sua frase-senha. Sua frase-senha deve conter mais de uma palavra, junto 
      com espa&ccedil;os, n&uacute;meros, e outros caracteres imprim&iacute;veis. 
      A frase-senha &eacute; sens&iacute;vel a caso (difere mai&uacute;sculas 
      de min&uacute;sculas). A senha m&iacute;nima permitida &eacute; de 8 caracteres. 
      Escolha algo com o qual voc&ecirc; est&aacute; bem familiar e que voc&ecirc; 
      j&aacute; tenha armazenado em sua mem&oacute;ria de longo prazo. Escolher 
      uma frase-senha no calor do momento &eacute; algo que pode resultar em esquec&ecirc;-la 
      completamente. &Eacute; vital que voc&ecirc; <i>n&atilde;o se esque&ccedil;a 
      de sua frase-senha ou voc&ecirc; ir&aacute; perder seus dados!</i> Para 
      maiores informa&ccedil;&otilde;es, veja <a href="#qualidade_frase_senha">&quot;Qualidade 
      da frase-senha&quot; na p&aacute;gina 126</a>.<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot;.<br>
      <br>
    </li>
    <li>Mova seu mouse de forma aleat&oacute;ria dentro da janela do Assistente 
      e/ou digite caracteres em seu teclado at&eacute; que a barra de progresso 
      mostrada na caixa de di&aacute;logo esteja completamente preenchida.<br>
      <br>
      Seus movimentos do mouse e sua digita&ccedil;&atilde;o s&atilde;o usadas 
      para gerar n&uacute;meros aleat&oacute;rios usados pelo PGPdisk como parte 
      do processo de codifica&ccedil;&atilde;o (mistura dos dados).<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot;. Uma barra de progresso indica quanto do volume 
      PGPdisk j&aacute; foi inicializado.<br>
      <br>
    </li>
    <li>Clique &quot;Next&quot; para montar seu PGPdisk.<br>
      <br>
    </li>
    <li>Clique &quot;Finish&quot;. A janela de formata&ccedil;&atilde;o aparece 
      em sua tela.<br>
      <br>
    </li>
    <li>Insira um r&oacute;tulo (label) para o novo volume (este r&oacute;tulo 
      identifica o volume em Windows Explorer).<br>
      <br>
    </li>
    <li>Clique &quot;Start&quot;. Uma caixa de di&aacute;logo de aviso aparece.<br>
      <br>
    </li>
    <li>Clique OK (n&atilde;o h&aacute; dados no novo disco). O sistema lhe informa 
      que a formata&ccedil;&atilde;o est&aacute; completa.<br>
      <br>
    </li>
    <li>Clique &quot;Close&quot; na janela de formata&ccedil;&atilde;o.<br>
      <br>
      Seu volume PGPdisk aparece em uma janela do Explorer.<br>
      <br>
      Um &iacute;cone representando seu volume aparece no local especificado. 
      D&ecirc; um clique duplo no &iacute;cone para abrir o volume.</li>
  </ol>
  <p>Um &iacute;cone representando seu volume codificado aparece no local que 
    voc&ecirc; especificou, como mostrado abaixo.</p>
</blockquote>
<table width="66%" border="0" cellspacing="25" align="center">
  <tr> 
    <td width="48%" height="48"> 
      <div align="center"><img src="pgpdisk_montado.gif" width="96" height="62"></div>
    </td>
    <td width="52%" height="48"> 
      <div align="center"><img src="pgpdisk_codificado.gif" width="93" height="62"></div>
    </td>
  </tr>
  <tr> 
    <td width="48%"> 
      <div align="center"><b>Volume PGPdisk montado</b></div>
    </td>
    <td width="52%"> 
      <p align="center"><b>Volume PGPdisk codificado</b></p>
    </td>
  </tr>
</table>
<p> <font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><b>Alterando 
  uma frase-senha</b></font></p>
<blockquote> 
  <p>Voc&ecirc; pode alterar a frase-senha mestra ou alternativa para um arquivo 
    PGPdisk.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para alterar 
    sua frase-senha</font></b></p>
  <ol>
    <li> Certifique-se de que o arquivo PGPdisk n&atilde;o est&aacute; montado. 
      Voc&ecirc; n&atilde;o pode alterar uma frase-senha se o arquivo PGPdisk 
      estiver montado.<br>
      <br>
    </li>
    <li>Selecione &quot;Change Passphrase&quot; (Alterar Frase-Senha) no menu 
      &quot;File&quot;.<br>
      <br>
    </li>
    <li>Selecione o arquivo PGPdisk de interesse.<br>
      <br>
    </li>
    <li>Insira a frase-senha atual, como mostrado na <a href="#7-2">figura 7-2</a>.<br>
      <br>
      <div align="center"><a name="7-2"></a><img src="passphrase_pgpdisk.gif" width="247" height="129"><br>
      <font face="Arial, Helvetica, sans-serif" size="2"><b>Figura 
      7-2. Caixa de di&aacute;logo &quot;Passphrase&quot;</b></font></div>
      <br>
      Clique OK. A janela &quot;New Passphrase&quot; (Nova Frase-Senha) aparece.<br>
      <br>
    </li>
    <li>Insira a s&eacute;rie de palavras ou caracteres que servir&atilde;o como 
      sua nova frase-senha para acessar o novo volume (tamb&eacute;m chamada de 
      &quot;frase-senha mestra do volume&quot;). Para confirmar sua entrada, pressione 
      a tecla &quot;Tab&quot; para avan&ccedil;ar &agrave; pr&oacute;xima caixa 
      de texto, ent&atilde;o insira a mesma frase-senha novamente. O tamanho m&iacute;nimo 
      para uma frase-senha &eacute; de 8 caracteres.<br>
      <br>
    </li>
    <li>Clique OK.<br>
      <br>
      A caixa de di&aacute;logo &quot;New Passphrase&quot; &eacute; fechada.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Adicionado 
  frases-senhas alternativas</font></b></p>
<blockquote> 
  <p>Uma vez que voc&ecirc; inseriu a frase-senha mestra (aquela usada para criar 
    o disco inicialmente), voc&ecirc; pode adicionar at&eacute; sete outras frases-senhas 
    alternativas, que podem ser usadas para montar o volume. Voc&ecirc; pode querer 
    fazer isso se voc&ecirc; usa a mesma frase-senha mestra regularmente, e deseja 
    fazer com que o volume fique dispon&iacute;vel para mais algu&eacute;m com 
    a frase-senha &uacute;nica destas pessoas. Apenas uma pessoa que conhe&ccedil;a 
    a frase-senha mestra pode adicionar frases-senhas alternativas.</p>
  <p> Qualquer usu&aacute;rio que conhe&ccedil;a uma frase-senha pode alter&aacute;-la, 
    mas voc&ecirc; sempre poder&aacute; acessar o conte&uacute;do do volume se 
    isso seja necess&aacute;rio. Voc&ecirc; tamb&eacute;m tem a op&ccedil;&atilde;o 
    de associar um status &quot;apenas para leitura&quot; para o volume, o que 
    permite &agrave;s pessoas ler os arquivos, mas previne-os de alterar os arquivos 
    de qualquer forma.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para adicionar 
    frases-senhas alternativas</font></b></p>
  <ol>
    <li>Certifique-se de que o volume PGPdisk n&atilde;o est&aacute; montado. 
      Voc&ecirc; n&atilde;o pode alterar uma frase-senha enquanto o volume PGPdisk 
      estiver montado.<br>
      <br>
    </li>
    <li>Selecione &quot;Add Passphrase&quot; (Adicionar Frase-Senha) no menu &quot;File&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Passphrase&quot; aparece, pedindo que voc&ecirc; 
      insira a frase-senha mestra do volume. Se voc&ecirc; possuir v&aacute;rios 
      volumes PGPdisk em sua m&aacute;quina, voc&ecirc; precisa selecionar um 
      volume.<br>
      <br>
    </li>
    <li>Insira a frase-senha mestra e clique OK.<br>
      <br>
      A caixa de di&aacute;logo &quot;New Passphrase&quot; aparece, como mostrado 
      na <a href="#7-3">figura 7-3</a>.<br>
      <br>
      <div align="center"><a name="7-3"></a><img src="passphrase_new.gif" width="325" height="338"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 
      7-3. A caixa de di&aacute;logo &quot;New Passphrase&quot;</b></font></div>
      <br>
    </li>
    <li>Insira uma frase-senha alternativa para o volume mostrado e ent&atilde;o 
      pressione a tecla &quot;Tab&quot;. Insira a frase-senha novamente para confirm&aacute;-la. 
      <br>
      <br>
      Neste ponto, voc&ecirc; tamb&eacute;m tem a op&ccedil;&atilde;o de marcar 
      a caixa &quot;Read-only passphrase&quot; (Frase-senha apenas para leitura) 
      para indicar que voc&ecirc; quer que todo o conte&uacute;do do volume seja 
      designado como &quot;apenas para leitura&quot;.<br>
      <br>
    </li>
    <li> Clique OK.<br>
      <br>
      Uma vez que voc&ecirc; criou uma frase-senha alternativa, voc&ecirc; (ou 
      qualquer um que a conhe&ccedil;a) pode remover a frase-senha escolhendo 
      o comando &quot;Remove Passphrase&quot; (Remover Frase-Senha) no menu &quot;File&quot;. 
      Frases-senhas mestras n&atilde;o podem ser removidas (para maiores informa&ccedil;&otilde;es, 
      veja <a href="#removendo_frase_senha">&quot;Removendo uma frase-senha&quot;</a>, 
      abaixo).</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="removendo_frase_senha"></a>Removendo 
  uma frase-senha</font></b></p>
<blockquote> 
  <p>Remover uma frase-senha &eacute; similar a adicionar ou alterar uma frase-senha. 
    Voc&ecirc; n&atilde;o pode remover uma frase-senha mestra.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para remover 
    uma frase-senha</font></b></p>
  <ol>
    <li>Certifique-se de que o volume PGPdisk n&atilde;o est&aacute; montado. 
      Voc&ecirc; n&atilde;o pode alterar uma frase-senha enquanto o volume PGPdisk 
      estiver montado.<br>
      <br>
    </li>
    <li>Selecione &quot;Remove Passphrase&quot; (Remover Frase-Senha) no menu 
      &quot;File&quot;.<br>
      <br>
      Uma caixa de di&aacute;logo aparece, pedindo que voc&ecirc; insira a frase-senha 
      a ser removida.<br>
      <br>
    </li>
    <li>Insira a frase-senha e ent&atilde;o clique OK.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Removendo 
  todas as frases-senhas alternativas</font></b></p>
<blockquote> 
  <p>Voc&ecirc; tamb&eacute;m pode remover todas as frases-senhas alternativas 
    de uma vez. Isto poderia ser &uacute;til se outros usu&aacute;rios possuem 
    frases-senhas alternativas para um volume PGPdisk, e voc&ecirc; n&atilde;o 
    quer mais que eles acessem o volume.</p>
  <p><b><font color="#A00048" face="Arial, Helvetica, sans-serif">Para remover 
    todas as frases-senhas alternativas</font></b></p>
  <ol>
    <li>Certifique-se de que o volume PGPdisk n&atilde;o est&aacute; montado. 
      Voc&ecirc; n&atilde;o pode alterar uma frase-senha enquanto o volume PGPdisk 
      estiver montado.<br>
      <br>
    </li>
    <li>Aperte e segure a tecla &quot;Shift&quot; e selecione &quot;Remove Alternate 
      Passphrases&quot; (Remover Frases-Senhas Alternativas) no menu &quot;File&quot;.<br>
      <br>
      Uma caixa de di&aacute;logo aparece, pedindo que voc&ecirc; confirme que 
      deseja remover todas as frases-senhas alternativas.<br>
      <br>
    </li>
    <li>Clique &quot;Yes&quot; (Sim).<br>
      <br>
      Uma caixa de di&aacute;logo aparece, dizendo a voc&ecirc; que a remo&ccedil;&atilde;o 
      de todas as frases-senhas alternativas foi bem sucedida.</li>
  </ol>
</blockquote>
<p><font color="#A00048" size="4" face="Arial, Helvetica, sans-serif"><b>Adicionar/Remover 
  Chaves P&uacute;blicas</b></font></p>
<blockquote> 
  <p>Voc&ecirc; pode adicionar e remover chaves p&uacute;blicas para um arquivo 
    PGPdisk. Este recurso permite que voc&ecirc; e outros que conhe&ccedil;am 
    a frase-senha para aquelas chaves usem as mesmas para montar o volume.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para adicionar 
    uma chave p&uacute;blica em seu volume PGPdisk</font></b></p>
  <ol>
    <li> Certifique-se de que o volume PGPdisk n&atilde;o est&aacute; montado. 
      Voc&ecirc; n&atilde;o pode alterar uma frase-senha enquanto o volume PGPdisk 
      estiver montado.<br>
      <br>
    </li>
    <li>Selecione &quot;Add/Remove Public Keys&quot; (Adicionar/Remover Chaves 
      P&uacute;blicas) do menu &quot;File&quot;.<br>
      <br>
    </li>
    <li>Selecione o PGPdisk da barra de ferramentas &quot;Select PGPdisk&quot;.<br>
      <br>
      &Eacute; pedido que voc&ecirc; insira a frase-senha mestra.<br>
      <br>
      A janela de di&aacute;logo &quot;Recipient Selection&quot; (Sele&ccedil;&atilde;o 
      de Destinat&aacute;rio) aparece.<br>
      <br>
    </li>
    <li>Arraste a chave ou chaves da parte superior na janela para a parte inferior.<br>
      <br>
    </li>
    <li>Clique OK.</li>
  </ol>
</blockquote>
<blockquote> 
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para remover 
    uma chave p&uacute;blica de seu volume PGPdisk</font></b></p>
  <ol>
    <li> Certifique-se de que o volume PGPdisk n&atilde;o est&aacute; montado. 
      Voc&ecirc; n&atilde;o pode alterar uma frase-senha enquanto o volume PGPdisk 
      estiver montado.<br>
      <br>
    </li>
    <li>Selecione &quot;Add/Remove Public Keys&quot; (Adicionar/Remover Chaves 
      P&uacute;blicas) do menu &quot;File&quot;.<br>
      <br>
    </li>
    <li>Selecione o PGPdisk da barra de ferramentas &quot;Select PGPdisk&quot;.<br>
      <br>
      &Eacute; pedido que voc&ecirc; insira a frase-senha mestra.<br>
      <br>
      A janela de di&aacute;logo &quot;Key Selection&quot; (Sele&ccedil;&atilde;o 
      de Chave) aparece, como mostrado na <a href="#7-4">figura 7-4</a>.<br>
      <br>
      <div align="center"><a name="7-4"></a><img src="recipients.gif" width="420" height="307"><br>
      <font size="2" face="Arial, Helvetica, sans-serif"><b>Figura 
      7-4. A caixa de di&aacute;logo &quot;Key Selection&quot;</b></font></div>
      <br>
    </li>
    <li>Arraste a chave ou chaves da parte inferior na janela para a parte superior.<br>
      <br>
    </li>
    <li>Clique OK.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="montando_volume_pgpdisk"></a>Montando 
  um volume PGPdisk</font></b></p>
<blockquote> 
  <p>Quando voc&ecirc; cria um novo volume, o programa PGPdisk automaticamente 
    o monta de forma que voc&ecirc; pode come&ccedil;ar a us&aacute;-lo para armazenar 
    seus arquivos. Quando voc&ecirc; est&aacute; pronto para dar seguran&ccedil;a 
    ao conte&uacute;do do volume, voc&ecirc; deve desmont&aacute;-lo. Uma vez 
    que um volume &eacute; desmontado, seu conte&uacute;do permanece seguro em 
    um arquivo codificado, onde est&aacute; inacess&iacute;vel at&eacute; que 
    o volume seja montado novamente.</p>
  <p>H&aacute; quatro formas de montar um volume.</p>
  <ul>
    <li>D&ecirc; um clique duplo no &iacute;cone do volume.<br>
      <br>
    </li>
    <li>Arraste o &iacute;cone do volume para o &iacute;cone de PGPdisk na pasta 
      de PGP 6.0.<br>
      <br>
    </li>
    <li>Arraste o &iacute;cone do volume para o bot&atilde;o &quot;Mount&quot; 
      (Montar) na barra de ferramentas de PGPdisk.<br>
      <br>
    </li>
    <li>Clique com o bot&atilde;o direito no &iacute;cone do volume. Selecione 
      PGPdisk --&gt; Mount PGPdisk.<br>
      <br>
    </li>
    <li>Use o bot&atilde;o &quot;Mount&quot; na barra de ferramentas de PGPdisk.</li>
  </ul>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para montar 
    um volume usando o bot&atilde;o &quot;Mount&quot;</font></b></p>
  <ol>
    <li> Inicie PGPdisk.<br>
      <br>
      A barra de ferramentas de PGPdisk aparece.<br>
      <br>
    </li>
    <li>Clique &quot;Mount&quot; ou use a op&ccedil;&atilde;o &quot;Mount PGPdisk&quot; 
      (Montar PGPdisk) no menu &quot;File&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Mount PGPdisk&quot; aparece.<br>
      <br>
    </li>
    <li>Localize e selecione o volume codificado que voc&ecirc; deseja montar, 
      ent&atilde;o clique &quot;Open&quot;.<br>
      <br>
      &Eacute; pedido que voc&ecirc; insira a frase-senha para o volume selecionado.<br>
      <br>
    </li>
    <li>Insira a frase-senha e clique OK. Se voc&ecirc; n&atilde;o quer modificar 
      os arquivos no volume, clique a caixa &quot;read-only&quot; (apenas para 
      leitura). Se voc&ecirc; inseriu a frase-senha correta, o volume &eacute; 
      montado e os dados no arquivo codificado estar&atilde;o acess&iacute;veis. 
      O volume aparece na &aacute;rvore de pastas do Windows Explorer.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Usando 
  um volume PGPdisk montado</font></b></p>
<blockquote> 
  <p>Voc&ecirc; pode criar, mover, e apagar arquivos e pastas em um volume PGPdisk 
    exatamente como faria com qualquer outro volume. Similarmente, qualquer um 
    que tiver acesso ao volume (na mesma m&aacute;quina ou talvez atrav&eacute;s 
    da rede) tamb&eacute;m pode acessar os dados armazenados no volume. Os dados 
    no arquivo codificado associado com o volume s&oacute; estar&atilde;o inacess&iacute;veis 
    quando voc&ecirc; desmontar o volume.</p>
  <p><b>ATEN&Ccedil;&Atilde;O</b>: Apesar do arquivo codificado associado a cada 
    volume estar a salvo de curiosos, ele ainda pode ser apagado. Se uma pessoa 
    n&atilde;o autorizada pode acessar seus dados, ele ou ela poderiam potencialmente 
    apagar o arquivo codificado no qual o volume est&aacute; baseado. &Eacute; 
    uma boa id&eacute;ia manter uma c&oacute;pia <i>backup</i> do arquivo codificado.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Desmontando 
  um volume PGPdisk</font></b></p>
<blockquote> 
  <p>Ap&oacute;s acessar um determinado volume e voc&ecirc; desejar trancar seu 
    conte&uacute;do, voc&ecirc; precisa desmontar o volume. Voc&ecirc; n&atilde;o 
    pode desmontar um volume que possua arquivos abertos.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para desmontar 
    um volume PGPdisk</font></b></p>
  <ol>
    <li> Feche todos os arquivos no volume PGPdisk que voc&ecirc; deseja desmontar.<br>
      <br>
    </li>
    <li>Selecione &quot;Unmount PGPdisk&quot; (Desmontar PGPdisk) no menu &quot;File&quot; 
      de PGPdisk.</li>
  </ol>
  <p>Outras formas de desmontar um volume PGPdisk incluem:</p>
  <ul>
    <li>Clique &quot;Unmount&quot; (Desmontar) na barra de ferramentas de PGPdisk 
      <br>
      <br>
    </li>
    <li>Clique com o bot&atilde;o direito na letra do drive na janela do Explorer<br>
      <br>
    </li>
    <li>Clique com o bot&atilde;o direito no arquivo do volume</li>
  </ul>
  <p>Uma vez que um volume &eacute; desmontado, seu conte&uacute;do &eacute; travado 
    no arquivo codificado associado com o volume. O conte&uacute;do do volume 
    &eacute; armazenado no arquivo codificado e seu conte&uacute;do permanece 
    inacess&iacute;vel at&eacute; que o volume seja novamente montado. Pode ajudar 
    visualizar volumes PGPdisk como uma janela que prov&ecirc; uma vis&atilde;o 
    dos dados no arquivo codificado. O conte&uacute;do de um arquivo de volume 
    PGPdisk s&oacute; se torna dispon&iacute;vel quando o arquivo &eacute; montado 
    como um volume, por algu&eacute;m que conhe&ccedil;a uma frase-senha v&aacute;lida.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Especificando 
  Prefer&ecirc;ncias</font></b></p>
<blockquote> 
  <p>O bot&atilde;o &quot;Preferences&quot; na barra de ferramentas de PGPdisk 
    permite que voc&ecirc; especifique como voc&ecirc; prefere desmontar e criar 
    seus volumes.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para especificar 
    prefer&ecirc;ncias</font></b></p>
  <ol>
    <li> Clique &quot;Preferences&quot; na barra de ferramentas de PGPdisk ou 
      selecione &quot;Preferences&quot; a partir do menu &quot;File&quot;.<br>
      <br>
      A caixa de di&aacute;logo &quot;Preferences&quot; aparece.<br>
      <br>
    </li>
    <li>Selecione as op&ccedil;&otilde;es desejadas clicando as caixas e abas 
      apropriadas. </li>
  </ol>
  <p><b><font face="Arial, Helvetica, sans-serif" size="2" color="#A00048">Aba 
    &quot;Auto Unmount&quot; (Auto Desmontar)</font></b></p>
</blockquote>
<ul>
  <li><b>Auto unmount after [15] minutes of inactivity</b> (Auto desmontar ap&oacute;s 
    [15] minutos de inatividade). Quando selecionada, esta op&ccedil;&atilde;o 
    faz com que PGPdisk automaticamente desmonte quaisquer volumes PGPdisk montados 
    quando seu computador estiver inativo pelo n&uacute;mero de minutos na caixa. 
    Voc&ecirc; pode configurar este valor entre 1 a 999 minutos. 
    <p><b>NOTA</b>: PGPdisk n&atilde;o pode desmontar um volume PGPdisk automaticamente 
      se qualquer dos arquivos no volume estiver aberto.</p>
    <p>&#149;<b> Auto unmount on computer sleep</b> (Auto desmontar quando computador 
      estiver em estado de espera). Quando selecionada, esta op&ccedil;&atilde;o 
      faz com que PGPdisk automaticamente desmonte quaisquer volumes PGPdisk montados 
      quando seu computador estiver em modo de Espera (nem todos os modelos de 
      computador possuem um modo de espera).</p>
    <p>A op&ccedil;&atilde;o <b>Prevent sleep if any PGPdisks could not be unmounted</b> 
      (evitar modo de espera se quaisquer PGPdisks n&atilde;o puderem ser desmontados) 
      certifica-se de que seu computador n&atilde;o entrar&aacute; em estado de 
      espera caso um volume PGPdisk n&atilde;o possa ser desmontado.</p>
    <p><b>NOTA</b>: Estas duas op&ccedil;&otilde;es (&quot;Auto unmount on computer 
      sleep&quot; e &quot;Prevent sleep if any PGPdisks could not be unmounted&quot;) 
      est&atilde;o desabilitadas em sistemas NT .</p>
  </li>
  <li> <b>Enable Unmount HotKey</b> (Habilitar Tecla de Atalho para Desmontagem). 
    Quando voc&ecirc; insere uma combina&ccedil;&atilde;o de teclas na caixa de 
    texto e marcar esta op&ccedil;&atilde;o, voc&ecirc; cria e habilita um atalho 
    via teclado que permite que voc&ecirc; desmonte todos os volumes PGPdisks 
    no sistema com um simples toque. 
    <p> Clique OK quando tiver terminado de especificar suas prefer&ecirc;ncias.</p>
    <p><b>NOTA</b>: As configura&ccedil;&otilde;es para auto desmontar s&atilde;o 
      &uacute;teis se voc&ecirc; precisa deixar seu computador por um per&iacute;odo 
      de tempo. Voc&ecirc; deve ajustar o tempo destas configura&ccedil;&otilde;es 
      de acordo com qu&atilde;o seguro seu sistema &eacute; de acesso f&iacute;sico 
      n&atilde;o autorizado. Voc&ecirc; pode configurar todas estas prefer&ecirc;ncias 
      ao mesmo tempo.</p>
  </li>
</ul>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="mantendo_volumes"></a>Mantendo 
  Volumes PGPdisk</font></b></p>
<blockquote>
  <p>Esta se&ccedil;&atilde;o descreve como automaticamente montar volumes PGPdisk 
    quando voc&ecirc; iniciar seu sistema, e como fazer <i>backups</i> e trocar 
    os dados nestes volumes com outros.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Montando 
  arquivos PGPdisk em um servidor remoto</font></b></p>
<blockquote> 
  <p>Voc&ecirc; pode colocar volumes PGPdisk em qualquer tipo de servidor (NT, 
    95, 98 ou UNIX) e permitir que eles sejam montados por qualquer um com uma 
    m&aacute;quina Windows 95.</p>
  <p><b>NOTA</b>: A primeira pessoa a montar o volume localmente possui acesso 
    para leitura e escrita ao volume. Ningu&eacute;m mais poder&aacute; acess&aacute;-lo 
    nesse momento. Se voc&ecirc; quer que outros acessem arquivos que est&atilde;o 
    no volume, voc&ecirc; deve montar o volume em modo apenas para leitura. Todos 
    os usu&aacute;rios do volume ter&atilde;o, ent&atilde;o, acesso apenas para 
    leitura.</p>
  <p>Se o volume estiver armazenado em um servidor Windows 95, voc&ecirc; tamb&eacute;m 
    pode montar o volume remotamente no servidor, e permitir que as pessoas compartilhem 
    o volume montado. Entretanto, esta a&ccedil;&atilde;o n&atilde;o prov&ecirc; 
    seguran&ccedil;a alguma aos arquivos no volume.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Montando 
  automaticamente volumes PGPdisk</font></b></p>
<blockquote>
  <p>Se voc&ecirc; quiser, voc&ecirc; pode automaticamente montar volume PGPdisk 
    quando voc&ecirc; inicia pela primeira vez seu sistema.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para montar 
    automaticamente volumes PGPdisk</font></b></p>
  <ol>
    <li> Crie um atalho para um dos arquivos PGPdisk que voc&ecirc; deseja montar 
      quando iniciar seu computador.<br>
      <br>
    </li>
    <li>Coloque o(s) atalhos(s) na pasta WinNT --&gt; Profiles --&gt; {Nome do 
      usu&aacute;rio atual} --&gt; Menu Iniciar --&gt; Programas (em sistemas 
      WindowsNT) ou em Windows --&gt; Menu Iniciar --&gt; Programas (em sistemas 
      Windows 95/98).</li>
  </ol>
  <p>Uma vez que voc&ecirc; colou os atalhos nesta pasta, os volumes PGPdisk s&atilde;o 
    montados sempre que voc&ecirc; inicia seu computador. &Eacute; pedido a voc&ecirc; 
    para entrar a frase-senha para cada volume PGPdisk quando ele &eacute; montado.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Realizando 
  <i>backups</i> de volumes PGPdisk</font></b></p>
<blockquote>
  <p>Voc&ecirc; pode desejar realizar <i>backups</i> do conte&uacute;do de seu 
    PGPdisk para salvaguardar suas informa&ccedil;&otilde;es de corrup&ccedil;&otilde;es 
    do sistema ou falhas de disco. Enquanto &eacute; poss&iacute;vel realizar 
    o <i>backup</i> de todo o conte&uacute;do de um volume PGPdisk montado, como 
    voc&ecirc; faria com qualquer volume, esta n&atilde;o &eacute; provavelmente 
    uma boa id&eacute;ia porque o conte&uacute;do n&atilde;o est&aacute; codificado 
    e assim estaria acess&iacute;vel a qualquer um que pudesse restaurar o <i>backup</i>. 
    Ao inv&eacute;s de realizar o <i>backup</i> do conte&uacute;do do volume PGPdisk 
    montado, voc&ecirc; deve fazer um <i>backup</i> do volume PGPdisk codificado.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para efetuar 
    <i>backup</i> de volumes PGPdisk</font></b></p>
  <ol>
    <li> Clique no &iacute;cone do volume PGPdisk. Selecione a op&ccedil;&atilde;o 
      &quot;Unmount PGPdisk&quot; (Desmontar PGPdisk).<br>
      <br>
    </li>
    <li> Copie o arquivo codificado e desmontado para um disquete, fita, ou cartucho 
      remov&iacute;vel como faria com qualquer outro arquivo. Mesmo se uma pessoa 
      n&atilde;o autorizada tiver acesso a seus <i>backups</i>, ele ou ela n&atilde;o 
      poder&atilde;o decifrar seu conte&uacute;do.</li>
  </ol>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Trocando 
  volumes PGPdisk</font></b></p>
<blockquote> 
  <p>Voc&ecirc; pode trocar volumes PGPdisk com colegas que possuam seus pr&oacute;prios 
    programas PGPdisk enviando a eles uma c&oacute;pia do arquivo codificado que 
    cont&eacute;m os dados associados ao volume. Aqui est&atilde;o algumas formas 
    que voc&ecirc; pode trocar volumes PGPdisk:</p>
  <ul>
    <li>Como anexo de email<br>
      <br>
    </li>
    <li> Em disquetes ou cartuchos<br>
      <br>
    </li>
    <li> Atrav&eacute;s de uma rede</li>
  </ul>
  <p><b>DICA</b>: Voc&ecirc; deve considerar cuidadosamente o m&eacute;todo que 
    usar&aacute; para prover a algu&eacute;m a frase-senha usada para ter acesso 
    a um volume PGPdisk. Em geral, a n&atilde;o ser que voc&ecirc; use algum outro 
    produto de criptografia para proteger sua mensagem, email n&atilde;o &eacute; 
    uma boa forma de trocar frases-senhas. Linhas telef&ocirc;nicas tamb&eacute;m 
    s&atilde;o vulner&aacute;veis &agrave; monitora&ccedil;&atilde;o, e sua conversa&ccedil;&atilde;o 
    poderia ser espionada. Quanto mais precau&ccedil;&otilde;es de seguran&ccedil;a 
    voc&ecirc; tomar, maiores as chances de suas informa&ccedil;&otilde;es permanecerem 
    confidenciais. Se voc&ecirc; n&atilde;o possuir um email seguro, ent&atilde;o 
    &eacute; provavelmente mais seguro dizer &agrave; outra pessoa a frase-senha 
    em um encontro face-a-face ou mesmo usando correio postal regular.</p>
  <p>Uma vez que a parte intencionada possui uma c&oacute;pia do arquivo codificado, 
    tudo que ela precisa fazer para acessar o conte&uacute;do do volume &eacute; 
    mont&aacute;-lo usando a frase-senha correta, ou, se o volume foi codificado 
    para sua chave p&uacute;blica, sua chave. Ela tamb&eacute;m precisa de uma 
    c&oacute;pia do programa PGPdisk. Para maiores informa&ccedil;&otilde;es sobre 
    como montar um volume PGPdisk, veja <a href="#montando_volume_pgpdisk">&quot;Montando 
    um volume PGPdisk&quot; na p&aacute;gina 118</a>.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Alterando 
  o tamanho de um volume PGPdisk</font></b></p>
<blockquote>
  <p>Apesar de voc&ecirc; n&atilde;o poder alterar o tamanho de um volume PGPdisk 
    uma vez que ele foi criado, voc&ecirc; pode criar um volume maior ou menor 
    e ent&atilde;o copiar o conte&uacute;do do volume antigo para o novo.</p>
  <p><b><font face="Arial, Helvetica, sans-serif" color="#A00048">Para alterar 
    o tamanho de um volume PGPdisk</font></b></p>
  <p>1. Crie um novo volume PGPdisk e especifique o tamanho desejado.</p>
  <p>2. Copie o conte&uacute;do do volume PGPdisk montado existente para o volume 
    rec&eacute;m criado.</p>
  <p>3. Desmonte o volume PGPdisk antigo e ent&atilde;o apague o arquivo codificado 
    associado ao volume, para liberar espa&ccedil;o em disco.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="detalhes_tecnicos"></a>Detalhes 
  T&eacute;cnicos e Considera&ccedil;&otilde;es de Seguran&ccedil;a</font></b></p>
<blockquote>
  <p>Esta se&ccedil;&atilde;o discute as quest&otilde;es sobre codifica&ccedil;&atilde;o 
    e seguran&ccedil;a e prov&ecirc; dicas ao usu&aacute;rio e outras informa&ccedil;&otilde;es 
    t&eacute;cnicas sobre PGPdisk.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Sobre 
  volumes PGPdisk</font></b></p>
<blockquote>
  <p>Voc&ecirc; pode usar volumes PGPdisk para organizar seu trabalho, manter 
    nomes de arquivos similares separados, ou manter m&uacute;ltiplas vers&otilde;es 
    dos mesmos documentos ou programas separados.</p>
  <p>Apesar dos volumes que voc&ecirc; cria com PGPdisk funcionarem como qualquer 
    outro volume com o qual voc&ecirc; est&aacute; acostumado a trabalhar, os 
    dados s&atilde;o na verdade armazenados em um grande arquivo codificado. Apenas 
    ap&oacute;s voc&ecirc; montar o arquivo que seu conte&uacute;do &eacute; apresentado 
    na forma de um volume. &Eacute; importante saber que todos os seus dados permanecem 
    seguros no arquivo codificado, e s&atilde;o decifrados apenas quando voc&ecirc; 
    acessa um dos arquivos. Manter os dados para um volume armazenado desta maneira 
    torna simples de manipular e trocar volumes PGPdisk com outros, mas tamb&eacute;m 
    torna mais f&aacute;cil perder dados se o arquivo for apagado de alguma forma. 
    &Eacute; s&aacute;bio manter uma c&oacute;pia <i>backup</i> destes arquivos 
    codificados de forma que os dados possam ser recuperados no caso de algo acontecer 
    ao original. &Eacute; tamb&eacute;m importante notar que voc&ecirc; n&atilde;o 
    pode comprimir um arquivo compactado em uma tentativa de reduzir seu tamanho, 
    mas pode comprimir os arquivos individuais contidos no volume montado, e assim 
    armazenar mais dados codificados no volume. Voc&ecirc; tamb&eacute;m pode 
    armazenar um volume PGPdisk seguro dentro de outro, e assim aninhar diversos 
    volumes para um n&iacute;vel adicional de seguran&ccedil;a.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">O algoritmo 
  de criptografia de PGPdisk</font></b></p>
<blockquote>
  <p>Codifica&ccedil;&atilde;o aplica uma f&oacute;rmula matem&aacute;tica para 
    misturar seus dados de forma que ningu&eacute;m mais possa us&aacute;-los. 
    Quando voc&ecirc; aplica a chave matem&aacute;tica correta, voc&ecirc; reorganiza 
    seus dados A f&oacute;rmula de codifica&ccedil;&atilde;o de PGPdisk usa dados 
    aleat&oacute;rios para parte do processo de codifica&ccedil;&atilde;o. Alguns 
    deste dados aleat&oacute;rios v&ecirc;m do movimento do seu mouse durante 
    a codifica&ccedil;&atilde;o e alguns dados aleat&oacute;rios tamb&eacute;m 
    v&ecirc;m diretamente de sua frase-senha.</p>
  <p>O processo de codifica&ccedil;&atilde;o de PGPdisk &eacute; uma f&oacute;rmula 
    matem&aacute;tica complexa que, ao tanto que sabemos, &eacute; atualmente 
    inquebr&aacute;vel. Algu&eacute;m pode desenvolver um m&eacute;todo de quebrar 
    esta f&oacute;rmula alguns anos no futuro, mas informa&ccedil;&atilde;o sens&iacute;vel 
    &eacute; geralmente sens&iacute;vel por apenas um tempo limitado. O programa 
    PGPdisk usas um algoritmo de codifica&ccedil;&atilde;o sofisticado, chamado 
    de CAST, que &eacute; considerado uma excelente cifra de blocos porque &eacute; 
    r&aacute;pido e inquebr&aacute;vel &#151; ao tanto que algu&eacute;m saiba. 
    Seu nome &eacute; derivado das iniciais de seus projetistas, Carlisle Adams 
    e Stafford Tavares da Northern Telecom (Nortel). Nortel pediu uma patente 
    para CAST, mas eles se comprometeram a fazer CAST dispon&iacute;vel a qualquer 
    um sem pagamento de &quot;royalties&quot;. CAST parece ser excepcionalmente 
    bem projetado, por pessoas com boa reputa&ccedil;&atilde;o no campo. O projeto 
    &eacute; baseado em uma aproxima&ccedil;&atilde;o bastante formal, com um 
    n&uacute;mero de assertivas formalmente prov&aacute;veis, que d&atilde;o boas 
    raz&otilde;es para acreditar que ele provavelmente requer exaust&atilde;o 
    de chaves para quebrar sua chave de 128 bits. CAST n&atilde;o possui chaves 
    fracas. H&aacute; fortes argumentos que CAST &eacute; imune tanto &agrave; 
    criptoan&aacute;lise linear e diferencial, as duas formas mais poderosas de 
    criptoan&aacute;lise na literatura publicada, onde ambas foram efetivas em 
    quebrar o &quot;Data Encryption Standard&quot; (DES).</p>
</blockquote>
<p><b><font face="Arial, Helvetica, sans-serif" size="4" color="#A00048"><a name="qualidade_frase_senha"></a>Qualidade 
  da Frase-Senha</font></b></p>
<blockquote>
  <p>Sua seguran&ccedil;a &eacute; apenas t&atilde;o boa quanto sua frase-senha. 
    Entretanto, codificar um arquivo e depois se achar impossibilitado de decifr&aacute;-lo 
    &eacute; uma dolorosa li&ccedil;&atilde;o para aprender a escolher uma frase-senha 
    da qual voc&ecirc; se lembrar&aacute;.</p>
  <p>A maioria das aplica&ccedil;&otilde;es requer uma senha entre tr&ecirc;s 
    e oito letras. Uma senha de uma s&oacute; palavra &eacute; vulner&aacute;vel 
    a um &quot;ataque de dicion&aacute;rio&quot;, que consiste em fazer um computador 
    tentar todas as palavras de um dicion&aacute;rio at&eacute; achar sua senha. 
    Para proteger-se contra esta maneira de ataque, &eacute; amplamente recomendado 
    que voc&ecirc; crie uma frase que inclua uma combina&ccedil;&atilde;o de letras 
    mai&uacute;sculas e min&uacute;sculas, n&uacute;meros, marcas de pontua&ccedil;&atilde;o, 
    e espa&ccedil;os. Isto resulta em uma senha mais forte, mas obscura, que &eacute; 
    improv&aacute;vel que se lembre facilmente. N&oacute;s n&atilde;o recomendamos 
    que voc&ecirc; usa um frase-senha de uma s&oacute; palavra.</p>
  <p>Uma frase-senha &eacute; menos vulner&aacute;vel a um ataque de dicion&aacute;rio. 
    Isto &eacute; realizado facilmente usando v&aacute;rias palavras em sua frase-senha, 
    ao inv&eacute;s de tentar contrariar um ataque de dicion&aacute;rio inserindo 
    arbitrariamente montes de caracteres engra&ccedil;ados n&atilde;o-alfab&eacute;ticos, 
    que t&ecirc;m o efeito de fazer sua frase-senha muito f&aacute;cil de se esquecer 
    e poder conduzir a uma perda desastrosa de informa&ccedil;&otilde;es porque 
    voc&ecirc; n&atilde;o pode decifrar seus pr&oacute;prios arquivos. Por&eacute;m, 
    a menos que a frase-senha que voc&ecirc; escolher seja algo que &eacute; facilmente 
    grav&aacute;vel em sua mem&oacute;ria de longo prazo, &eacute; pouco prov&aacute;vel 
    que voc&ecirc; ir&aacute; se lembrar dela literalmente. &Eacute; prov&aacute;vel 
    que a escolha de uma frase no calor de um determinado momento resulte em seu 
    esquecimento por completo. Escolha algo que j&aacute; est&aacute; gravado 
    em sua mem&oacute;ria de longo prazo. N&atilde;o deve ser algo que voc&ecirc; 
    repetiu recentemente a outros, nem uma frase famosa, porque voc&ecirc; quer 
    que ela seja dura para um atacante sofisticado adivinhar. Se j&aacute; estiver 
    profundamente enraizado em sua mem&oacute;ria de longo prazo, voc&ecirc; provavelmente 
    n&atilde;o a esquecer&aacute;. <i>N&atilde;o a escreva!</i></p>
  <p> Sua frase-senha &eacute; parte dos dados aleat&oacute;rios usados para codificar 
    seus arquivos PGPdisk files. A barra &quot;Passphrase Quality&quot; (Qualidade 
    da Frase-Senha) deve ser preenchida ao menos at&eacute; a metade quando voc&ecirc; 
    inserir uma frase-senha. A n&atilde;o ser que voc&ecirc; preencha toda a barra, 
    voc&ecirc; n&atilde;o est&aacute; conseguindo seguran&ccedil;a m&aacute;xima.</p>
  <p>Voc&ecirc; pode criar uma frase-senha separada ou alternativa para cada volume 
    PGPdisk que criar. Isto torna poss&iacute;vel voc&ecirc; permitir que alguns 
    usu&aacute;rios acessem os arquivos no PGPdisk selecionado, de acordo com 
    o volume. Voc&ecirc; pode usar uma frase-senha para arquivos PGPdisk que voc&ecirc; 
    envia a um colega, e ainda assim prevenir que este colega acesse qualquer 
    um de seus outros arquivos PGPdisk.</p>
</blockquote>
<p><font color="#A00048"><b><font size="4" face="Arial, Helvetica, sans-serif">Precau&ccedil;&otilde;es 
  especiais de seguran&ccedil;a tomadas por PGPdisk</font></b></font></p>
<blockquote>
  <p>PGPdisk toma cuidados especiais para evitar problemas de seguran&ccedil;a 
    que outros programas talvez n&atilde;o tomem. Estes incluem os seguintes: 
  </p>
</blockquote>
<p><font color="#A00048"><b><font face="Arial, Helvetica, sans-serif">Apagamento 
  da frase-senha</font></b></font></p>
<blockquote>
  <p>Quando voc&ecirc; insere uma frase-senha, PGPdisk a usa apenas por um breve 
    tempo, ent&atilde;o a apaga da mem&oacute;ria. PGPdisk tamb&eacute;m evita 
    fazer c&oacute;pias da frase-senha. O resultado &eacute; que sua frase-senha 
    tipicamente permanece na mem&oacute;ria por apenas uma fra&ccedil;&atilde;o 
    de segundo. Este recurso &eacute; crucialmente importante &#151; se a frase-senha 
    ficasse na mem&oacute;ria, algu&eacute;m poderia procurar por ela na mem&oacute;ria 
    de seu computador enquanto voc&ecirc; estivesse longe da m&aacute;quina. Voc&ecirc; 
    n&atilde;o saberia disso, mas eles teriam acesso completo a qualquer volume 
    PGPdisk protegido por essa frase-senha.</p>
</blockquote>
<p><font color="#A00048"><b><font face="Arial, Helvetica, sans-serif">Prote&ccedil;&atilde;o 
  de mem&oacute;ria virtual</font></b></font></p>
<blockquote>
  <p>Sua frase-senha ou outras chaves poderiam ser escritas no disco como parte 
    das transfer&ecirc;ncias da mem&oacute;ria para o disco, feitas pelo sistema 
    de mem&oacute;ria virtual. PGPdisk cuida para que as frases-senhas e chaves 
    nunca sejam escritas em disco. Este recurso &eacute; importante porque algu&eacute;m 
    poderia pesquisar o arquivo de mem&oacute;ria virtual procurando por frases-senhas. 
  </p>
</blockquote>
<p><font color="#A00048"><b><font face="Arial, Helvetica, sans-serif">Prote&ccedil;&atilde;o 
  de mem&oacute;ria contra migra&ccedil;&atilde;o de &iacute;ons est&aacute;ticos</font></b></font></p>
<blockquote>
  <p>Quando voc&ecirc; monta um PGPdisk, sua frase-senha &eacute; transformada 
    em uma chave. Esta chave &eacute; usada para codificar e decifrar os dados 
    em seu volume PGPdisk. Apesar da frase-senha ser apagada da mem&oacute;ria 
    imediatamente, a chave (da qual sua frase-senha n&atilde;o pode ser derivada) 
    permanece na mem&oacute;ria enquanto o disco &eacute; montado. Esta chave 
    &eacute; protegida da mem&oacute;ria virtual, entretanto, se uma certa se&ccedil;&atilde;o 
    da mem&oacute;ria armazenar os mesmos dados iguais por per&iacute;odos extremamente 
    longos de tempo sem ser limpado ou reiniciado, aquela mem&oacute;ria tende 
    a reter carga est&aacute;tica, que poderia ser lida por atacantes. Se seu 
    PGPdisk est&aacute; montado por longos per&iacute;odos, de tempos em tempos 
    tra&ccedil;os detect&aacute;veis de sua chave poderiam ficar retidas na mem&oacute;ria. 
    Voc&ecirc; n&atilde;o vai encontrar tais dispositivos na loja de aparelhos 
    eletr&ocirc;nicos da vizinhan&ccedil;a, mas os maiores governos possivelmente 
    t&ecirc;m alguns.</p>
  <p>PGPdisk protege contra isto mantendo duas c&oacute;pias da chave na RAM, 
    uma c&oacute;pia normal e uma c&oacute;pia com os bits invertidos, e inverte 
    ambas as c&oacute;pias a cada poucos segundos.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Outras 
  considera&ccedil;&otilde;es de seguran&ccedil;a</font></b></p>
<p>Em geral, a habilidade de proteger seus dados depende das precau&ccedil;&otilde;es 
  que voc&ecirc; toma, e nenhum programa de codifica&ccedil;&atilde;o pode proteg&ecirc;-lo 
  de pr&aacute;ticas de seguran&ccedil;a descuidadas. Por exemplo, se voc&ecirc; 
  deixar seu computador ligado com arquivos sens&iacute;veis abertos quando voc&ecirc; 
  deixar sua mesa, qualquer um pode acessar aquela informa&ccedil;&atilde;o ou 
  mesmo obter a chave usada para acessar os dados. Aqui est&atilde;o algumas dicas 
  para manter uma seguran&ccedil;a &oacute;tima:</p>
<ul>
  <li> Certifique-se de desmontar volumes PGPdisk quando deixar o computador. 
    Desta forma, o conte&uacute;do estar&aacute; armazenado com seguran&ccedil;a 
    no arquivo codificado associado ao volume at&eacute; que voc&ecirc; esteja 
    pronto para acess&aacute;-lo novamente.<br>
    <br>
  </li>
  <li> Use uma prote&ccedil;&atilde;o de tela (&quot;screen saver&quot;) com uma 
    op&ccedil;&atilde;o de senha, de forma que seja mais dif&iacute;cil para algu&eacute;m 
    acessar sua m&aacute;quina ou ver sua tela quando voc&ecirc; estiver longe 
    de sua mesa.<br>
    <br>
  </li>
  <li> Certifique-se de que seus volumes PGPdisk n&atilde;o podem ser vistos por 
    outros computadores na rede. Voc&ecirc; pode precisar conversar com as pessoas 
    de gerenciamento da sua rede para garantir isto. Os arquivos em volumes PGPdisk 
    montados podem ser acessados por qualquer um que possa v&ecirc;-lo pela rede.<br>
    <br>
  </li>
  <li> Nunca escreva sua frase-senha. Use algo que voc&ecirc; possa se lembrar. 
    Se voc&ecirc; tiver problemas em lembrar-se de sua frase-senha, use algo que 
    mexa com sua mem&oacute;ria, com um poster, uma m&uacute;sica, um poema, uma 
    piada, mas n&atilde;o escreva suas frases-senha.<br>
    <br>
  </li>
  <li> Se voc&ecirc; usa PGPdisk em casa e compartilha seu computador com outras 
    pessoas elas provavelmente poder&atilde;o ver seus arquivos PGPdisk. Enquanto 
    voc&ecirc; desmontar seus volumes PGPdisk quando tiver terminado de us&aacute;-los, 
    ningu&eacute;m mais poder&aacute; ler seu conte&uacute;do.<br>
    <br>
  </li>
  <li> Se outro usu&aacute;rio tiver acesso f&iacute;sico &agrave; sua m&aacute;quina, 
    esta pessoa pode apagar seus arquivos PGPdisk como tamb&eacute;m quaisquer 
    outros arquivos ou volumes. Se o acesso f&iacute;sico &eacute; uma quest&atilde;o, 
    tente criar arquivos <i>backup</i> dos arquivos de seu PGPdisk ou mant&ecirc;-los 
    em um dispositivo externo, sobre o qual apenas voc&ecirc; possui controle 
    f&iacute;sico.<br>
    <br>
  </li>
  <li>Saiba que c&oacute;pias de seu volume PGPdisk usam as mesmas chaves secretas 
    que a original. Se voc&ecirc; trocar uma c&oacute;pia de seu volume com outros 
    e ambos alterarem suas senhas mestras, ambos ainda estar&atilde;o usando a 
    mesma chave para codificar os dados. Enquanto n&atilde;o &eacute; uma opera&ccedil;&atilde;o 
    trivial recuperar a chave, n&atilde;o &eacute; imposs&iacute;vel.</li>
</ul>
</body>
</html>
