<html>
<head>
<title>Transferindo Arquivos entre MacOS e Windows</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
</head>

<body bgcolor="#FFFFFF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>Transferindo 
        Arquivos entre MacOS e Windows</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>B</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Transfer&ecirc;ncia de arquivos para e de MacOS &eacute; um problema cl&aacute;ssico 
    no uso de quase qualquer tipo de software de troca de dados, como aplicativos 
    de email, FTP, utilit&aacute;rios de compress&atilde;o, e PGP. Este ap&ecirc;ndice 
    pretende documentar como este problema &eacute; finalmente resolvido por PGP 
    Vers&atilde;o 6.0, e discutir como comunicar com vers&otilde;es anteriores 
    de PGP. <br>
    <br>
    O MacOS armazena arquivos diferentemente de outros sistemas operacionais. 
    At&eacute; mesmo o formato de arquivo de texto do MacOS &eacute; diferente. 
    Arquivos de MacOS s&atilde;o na verdade dois arquivos que consistem em um 
    &quot;segmento de dados&quot; e um &quot;segmento de recursos&quot;. Para 
    enviar um arquivo de MacOS para Windows sem perder dados, os dois segmentos 
    devem ser fundidos em um. O m&eacute;todo padr&atilde;o pelo qual um arquivo 
    de MacOS &eacute; convertido em um &uacute;nico arquivo, de forma que possa 
    ser transferido a outro Macintosh ou PC sem perder qualquer uma das metades, 
    &eacute; chamado MacBinary. <br>
    <br>
    O problema &eacute; que, sem software especial, Windows e outras plataformas 
    n&atilde;o podem entender o formato MacBinary. Se acontecer uma situa&ccedil;&atilde;o 
    onde o software receptor falhar em converter um arquivo em formato MacBinary 
    em um arquivo Windows, o arquivo resultante &eacute; inutiliz&aacute;vel. 
    Utilit&aacute;rios de terceiros existem para Windows para converter estes 
    os arquivos em um arquivo utiliz&aacute;vel, mas isso pode ser bastante inconveniente. 
    <br>
    <br>
    Vers&otilde;es anteriores de PGP e a maioria dos utilit&aacute;rios dispon&iacute;vel 
    no mercado hoje tentam geralmente ignorar este problema o m&aacute;ximo poss&iacute;vel 
    e deixar todas as decis&otilde;es para o usu&aacute;rio, como codificar ou 
    n&atilde;o um arquivo com MacBinary quando enviando de MacOS. Isto coloca 
    o fardo de decidir enviar com MacBinary, e n&atilde;o perder quaisquer dados, 
    ou enviar sem MacBinary, e esperar que nenhum dado importante seja perdido, 
    nas m&atilde;os do usu&aacute;rio, que freq&uuml;entemente n&atilde;o tem 
    nenhuma id&eacute;ia sobre qual &eacute; a decis&atilde;o correta. A decis&atilde;o 
    geralmente deveria ser baseada em se o arquivo est&aacute; sendo enviado a 
    Windows ou a MacOS. Mas e se voc&ecirc; est&aacute; enviando ao mesmo tempo 
    a ambos? N&atilde;o h&aacute; nenhuma boa solu&ccedil;&atilde;o para este 
    problema com vers&otilde;es mais antigas de PGP e muitos outros utilit&aacute;rios. 
    Isto resultou em grande confus&atilde;o e inconveni&ecirc;ncia para usu&aacute;rios. 
    O contr&aacute;rio, enviar um arquivo de Windows para MacOS, tamb&eacute;m 
    tem sido um grande problema. Windows usa extens&otilde;es para nomes de arquivo, 
    como &quot;.doc&quot;, para identificar o tipo de um arquivo. Isto n&atilde;o 
    tem sentido para MacOS. Estes arquivos s&atilde;o enviados a um computador 
    Macintosh sem qualquer &quot;tipo&quot; de arquivo ou informa&ccedil;&atilde;o 
    sobre o criador. O processo de faz&ecirc;-los leg&iacute;veis depois de recebidos 
    geralmente envolve v&aacute;rios movimentos enigm&aacute;ticos na caixa de 
    di&aacute;logo &quot;Abrir&quot; do aplicativo do criador, ou em muitos casos 
    exige que o usu&aacute;rio entenda o costume de MacOS sobre criador e tipos 
    de c&oacute;digos, fixando-os manualmente com um utilit&aacute;rio de terceiros. 
    <br>
    <br>
    Felizmente, as vers&otilde;es mais recentes de PGP (vers&atilde;o 5.5 e superiores) 
    acabaram com esta confus&atilde;o. Se todos os usu&aacute;rios de PGP fossem 
    usar as mais recentes vers&otilde;es, ningu&eacute;m teria que pensar como 
    enviar arquivos de MacOS para Windows e vice-versa.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="enviando_do_macos_para_windows"></a>Enviando 
  do MacOS ao Windows</font></b></p>
<blockquote> 
  <p>No MacOS, h&aacute; tr&ecirc;s op&ccedil;&otilde;es quando codificando ou 
    assinando um arquivo: </p>
  <ul>
    <li><b>MacBinary: Yes</b>. Esta &eacute; a op&ccedil;&atilde;o recomendada 
      para todas as codifica&ccedil;&otilde;es quando enviando a outro usu&aacute;rio 
      de PGP Vers&atilde;o 5.5 ou superior em qualquer plataforma. Isto significa 
      que usu&aacute;rios de MacOS receber&atilde;o o arquivo exatamente como 
      intencionado, e a vers&atilde;o de Windows decodificar&aacute; o MacBinary 
      automaticamente e at&eacute; mesmo adicionar a extens&atilde;o de arquivo 
      apropriada, como &quot;.doc&quot; para Microsoft Word ou &quot;.ppt&quot; 
      para Microsoft PowerPoint. PGP inclui informa&ccedil;&atilde;o sobre extens&otilde;es 
      de nomes de arquivos dos aplicativos mais populares e c&oacute;digos de 
      criador de Macintosh. Em casos onde o tipo &eacute; desconhecido ou se sabe 
      que se trata de ser um arquivo apenas para MacOS, como um aplicativo de 
      MacOS, o arquivo permanece em formato MacBinary, de forma que possa ser 
      remetido depois completamente intacto a um Macintosh.<br>
      <br>
    </li>
    <li><b>MacBinary: No</b>. Se voc&ecirc; est&aacute; se comunicando com usu&aacute;rios 
      que t&ecirc;m uma vers&atilde;o mais antiga de PGP, a decis&atilde;o de 
      se geralmente enviar com MacBinary acaba nas m&atilde;os do remetente, como 
      na maioria dos outros programas e em vers&otilde;es anteriores de PGP para 
      MacOS. Quando enviando a um PC que usa uma vers&atilde;o mais antiga, se 
      voc&ecirc; sabe que o arquivo que voc&ecirc; est&aacute; enviando pode ser 
      lido atrav&eacute;s de aplica&ccedil;&otilde;es para Windows quando MacBinary 
      n&atilde;o &eacute; usado, selecione esta op&ccedil;&atilde;o. Isto inclui 
      a maioria dos arquivos que geralmente s&atilde;o inter-plataformas, como 
      os criados pelos aplicativos de Microsoft Office, arquivos de gr&aacute;ficos, 
      arquivos comprimidos, e muitos outros. O remetente ou o destinat&aacute;rio 
      ter&atilde;o que renomear o arquivo manualmente, para ter a extens&atilde;o 
      de arquivo correta em Windows. Isto &eacute; requerido porque o destinat&aacute;rio 
      Windows n&atilde;o tem as informa&ccedil;&otilde;es de criador normalmente 
      codificadas com MacBinary.<br>
      <br>
    </li>
    <li><b>MacBinary: Smart</b>. H&aacute; alguns casos muito limitados onde esta 
      op&ccedil;&atilde;o pode ser &uacute;til quando comunicando com usu&aacute;rios 
      que n&atilde;o est&atilde;o usando vers&otilde;es mais recentes de PGP. 
      Esta op&ccedil;&atilde;o toma uma decis&atilde;o sobre se deve codificar 
      com MacBinary, baseado em uma an&aacute;lise dos dados atuais no arquivo. 
      Se o arquivo &eacute; um dos tipos a seguir, n&atilde;o ser&aacute; codificado 
      com MacBinary, sendo assim leg&iacute;vel em um PC com qualquer vers&atilde;o 
      de PGP: <br>
      <br>
      <ul>
        <li>arquivo comprimido PKzip<br>
          <br>
        </li>
        <li>arquivo comprimido Lempel-Ziv<br>
          <br>
        </li>
        <li>formato de arquivo musical MIDI<br>
          <br>
        </li>
        <li>arquivo comprimido PackIt<br>
          <br>
        </li>
        <li>arquivo gr&aacute;fico GIF<br>
          <br>
        </li>
        <li>arquivo comprimido StuffIt_ <br>
          <br>
        </li>
        <li>arquivo comprimido Compactor <br>
          <br>
        </li>
        <li>arquivo comprimido Arco<br>
          <br>
        </li>
        <li>arquivo gr&aacute;fico JPEG<br>
          <br>
        </li>
      </ul>
    </li>
  </ul>
  <p>Como mostrado, s&oacute; uma sele&ccedil;&atilde;o limitada de arquivos resultar&aacute; 
    em um arquivo leg&iacute;vel por vers&otilde;es antigos de PGP em outras plataformas, 
    quando usando a op&ccedil;&atilde;o &quot;Smart&quot;. Qualquer outro arquivo 
    recebido em um PC com uma vers&atilde;o mais antiga de PGP ser&aacute; ileg&iacute;vel, 
    se n&atilde;o se remover o MacBinary que o codifica com um utilit&aacute;rio 
    de terceiros. Tamb&eacute;m, o arquivo n&atilde;o ter&aacute; a extens&atilde;o 
    de nome de arquivo correta no PC, a menos que aquela extens&atilde;o fosse 
    adicionada manualmente pelo usu&aacute;ria no lado que o envia. Se usando 
    o modo &quot;Smart&quot;, o arquivo resultante pode n&atilde;o estar igual 
    ao original quando enviado a um Macintosh, porque pode perder seu criador 
    e tipos de c&oacute;digos. Este modo permanece no produto principalmente devido 
    ao fato que estava em PGP Vers&atilde;o 5.0, e alguns usu&aacute;rios podem 
    ter apenas a necessidade de enviar os tipos de arquivo acima. Esta op&ccedil;&atilde;o 
    n&atilde;o &eacute; recomendada na maioria dos casos. </p>
  <p>Em resumo, se voc&ecirc; est&aacute; enviando apenas para as Vers&otilde;es 
    6.0 ou superiores, sempre selecione &quot;MacBinary: Yes&quot; (o padr&atilde;o). 
    Assim, voc&ecirc; n&atilde;o precisa ficar pensando, se seu ambiente est&aacute; 
    usando exclusivamente PGP Vers&atilde;o 6.0. Quando enviando aos usu&aacute;rios 
    com vers&otilde;es mais antigas, voc&ecirc; deve selecionar &quot;MacBinary: 
    No&quot; para tipos de arquivos inter-plataformas e &quot;MacBinary: Yes&quot; 
    para arquivos que simplesmente n&atilde;o seriam leg&iacute;veis para usu&aacute;rios 
    de PC de qualquer maneira (como um aplicativo MacOS). </p>
  <p><b>NOTA</b>: PGP Vers&atilde;o 5.0 n&atilde;o teve uma op&ccedil;&atilde;o 
    &quot;MacBinary: No&quot;. Para enviar tipos de arquivo sem MacBinary, que 
    n&atilde;o est&aacute; inclu&iacute;do na lista para &quot;MacBinary: Smart&quot; 
    para um PC que usa 5.0, o arquivo deve ser configurado manualmente para um 
    dos criadores e tipos de c&oacute;digo na lista &quot;Smart&quot; antes de 
    ser enviado.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="recebendo_win_em_macos"></a>Recebendo 
  arquivos Windows no MacOS</font></b></p>
<blockquote> 
  <p>Quando decifrando, PGP Vers&atilde;o 6.0 tenta automaticamente traduzir extens&otilde;es 
    de nomes de arquivo para arquivos n&atilde;o-MacBinary em informa&ccedil;&otilde;es 
    de criador e tipo para MacOS. Por exemplo, se voc&ecirc; receber um arquivo 
    de Windows com uma extens&atilde;o &quot;.doc&quot;, o arquivo ser&aacute; 
    salvo como um documento Microsoft Word. A mesma lista de aplica&ccedil;&otilde;es 
    usada quando adicionando extens&otilde;es de nomes de arquivos na recep&ccedil;&atilde;o 
    de um arquivo MacBinary em Windows &eacute; usada para traduzir extens&otilde;es 
    de nomes de arquivos de volta ao equivalente MacOS quando recebido em um computador 
    Macintosh. Em quase todos casos, isto resulta em arquivos que s&atilde;o imediatamente 
    leg&iacute;veis e que podem ser duplamente clic&aacute;veis em MacOS.</p>
  <p>Vers&otilde;es anteriores de PGP para MacOS n&atilde;o t&ecirc;m esta caracter&iacute;stica. 
    O usu&aacute;rio precisa determinar manualmente que um arquivo de nome &quot;relat&oacute;rio.doc&quot; 
    &eacute; um arquivo Microsoft Word. Depois de determinar o aplicativo criador, 
    no caso de Microsoft Word, a pessoa pode simplesmente usar a caixa de di&aacute;logo 
    &quot;Abrir&quot; para abrir o arquivo selecionando &quot;Exibir Todos os 
    Arquivos&quot; no menu popup. Muitos outros aplicativos tamb&eacute;m t&ecirc;m 
    esta caracter&iacute;stica, mas alguns n&atilde;o. Se o documento n&atilde;o 
    pode ser aberto de dentro do aplicativo, o usu&aacute;rio tem que descobrir 
    qual o programa criador no Macintosh apropriado e tipos de c&oacute;digo para 
    o arquivo e manualmente os fixar com um utilit&aacute;rio de terceiros. H&aacute; 
    muitos utilit&aacute;rios gratuitos para se fazer isto. Atualizando para a 
    Vers&atilde;o 6.0 provavelmente &eacute; a op&ccedil;&atilde;o mais f&aacute;cil 
    neste caso, j&aacute; que elimina este problema.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Aplicativos 
  Suportados</font></b></p>
<blockquote> 
  <p>A seguinte lista de principais aplicativos produzem documentos que s&atilde;o 
    automaticamente traduzidos por PGP 6.0 quando enviados de Windows para MacOS 
    e vice-versa. Neste momento, n&atilde;o h&aacute; uma forma de um usu&aacute;rio 
    adicionar ou alterar estas convers&otilde;es, entretanto, n&oacute;s poderemos 
    adicionar tal funcionalidade no futuro.</p>
  <ul>
    <li> Photoshop (GIF, documentos nativos do Photoshop, TGA, JPEG)<br>
      <br>
    </li>
    <li>PageMaker (Vers&otilde;es 3.X, 4.X, 5.X, 6.X)<br>
      <br>
    </li>
    <li>Microsoft Project (arquivos de projeto e modelos)<br>
      <br>
    </li>
    <li>FileMaker Pro<br>
      <br>
    </li>
    <li>Adobe Acrobat<br>
      <br>
    </li>
    <li>Lotus 123<br>
      <br>
    </li>
    <li>Microsoft Word (texto, RTF, modelos)<br>
      <br>
    </li>
    <li>PGP<br>
      <br>
    </li>
    <li>Microsoft PowerPoint<br>
      <br>
    </li>
    <li>StuffIt<br>
      <br>
    </li>
    <li>QuickTime<br>
      <br>
    </li>
    <li>Corel WordPerfect<br>
      <br>
    </li>
    <li>Microsoft Excel (muitos diferentes tipos de arquivos)<br>
      <br>
    </li>
    <li>Quark XPress</li>
  </ul>
  <br>
  <p>As seguintes extens&otilde;es gerais de nomes de arquivos tamb&eacute;m s&atilde;o 
    convertidas:</p>
  <table border="0" cellspacing="5" width="80%" align="center">
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.cvs</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.arj</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.ima</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.eps</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.mac</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.cgm</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.dl</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.fli</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.ico</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.iff</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.img</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.lbm</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.msp</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pac</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pbm</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pcs</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pcx</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pgm</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.plt</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pm</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.ppm</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.rif</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.rle</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.shp</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.spc</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.sr</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.sun</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.sup</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.wmf</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.flc</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.gz</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.vga</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.hal</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.lzh</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.Z</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.exe</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.mpg</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.dvi</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.tex</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.aif</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.zip</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.au</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.mod</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.svx</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.wav</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.tar</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pct</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pic</font></td>
    </tr>
    <tr> 
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pit</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.txt</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.mdi</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.pak</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.tif</font></td>
      <td><font face="Arial, Helvetica, sans-serif" size="2">.eps</font></td>
    </tr>
  </table>
</blockquote>
</body>
</html>