<html>
<head>
<title>Phil Zimmermann sobre PGP</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
<style type="text/css">
<!--
a {text-decoration: none}
-->
</style></head>

<body bgcolor="#FFFFFF" link="#0000FF" vlink="#0000FF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b> 
        Phil Zimmermann sobre PGP</b></font></td>
      <td width="10%"><font size="7" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b>C</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<blockquote> 
  <p>Este cap&iacute;tulo cont&eacute;m informa&ccedil;&otilde;es introdut&oacute;rias 
    e originais sobre criptografia e PGP, como escrito por Phil Zimmermann.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="por_que"></a>Por 
  qu&ecirc; escrevi PGP</font></b></p>
<blockquote> 
  <p>&quot;<i>Tudo que voc&ecirc; fizer ser&aacute; insignificante, mas o importante 
    &eacute; que voc&ecirc; fa&ccedil;a.</i>&quot; - Mahatma Gandhi.</p>
  <p>&Eacute; pessoal. &Eacute; particular. E n&atilde;o interessa a ningu&eacute;m 
    al&eacute;m de voc&ecirc;. Voc&ecirc; pode estar planejando uma campanha pol&iacute;tica, 
    discutindo seus impostos, ou tendo um romance secreto. Ou voc&ecirc; pode 
    estar se comunicando com um dissidente pol&iacute;tico em um pa&iacute;s repressor. 
    Seja o que for, voc&ecirc; n&atilde;o quer que sua correspond&ecirc;ncia eletr&ocirc;nica 
    particular (email) ou documentos confidenciais sejam lidos por qualquer um. 
    N&atilde;o h&aacute; nada de errado em reivindicar sua privacidade. Privacidade 
    &eacute; t&atilde;o importante quanto a Constitui&ccedil;&atilde;o.</p>
  <p>O direito &agrave; privacidade est&aacute; divulgado implicitamente atrav&eacute;s 
    da Lei de Direitos. Mas quando a constitui&ccedil;&atilde;o dos Estados Unidos 
    estava sendo criada, os fundadores n&atilde;o viram a necessidade de explicitamente 
    afirmar o direito &agrave; uma conversa privada. Isso seria tolice. Duzentos 
    anos atr&aacute;s, todas as conversas eram privadas. Se algu&eacute;m mais 
    estivesse ao alcance da voz, voc&ecirc; poderia simplesmente ir para tr&aacute;s 
    do p&aacute;tio e ter sua conversa l&aacute;. Ningu&eacute;m poderia ouvir 
    sem seu conhecimento. O direito &agrave; conversa privada era um direito natural, 
    n&atilde;o apenas em um sentido filos&oacute;fico, mas um sentido de lei da 
    f&iacute;sica, dada a tecnologia da &eacute;poca.</p>
  <p>Mas com a chegada da era da informa&ccedil;&atilde;o, come&ccedil;ando com 
    a inven&ccedil;&atilde;o do telefone, tudo isto mudou. Agora a maioria de 
    nossas conversas &eacute; conduzida eletronicamente. Isto permite que nossas 
    conversas mais &iacute;ntimas estejam expostas sem nosso conhecimento. Chamadas 
    de telefones celulares podem ser monitorados por qualquer um com um r&aacute;dio. 
    Correspond&ecirc;ncia eletr&ocirc;nica, enviada atrav&eacute;s da Internet, 
    n&atilde;o &eacute; mais segura que um chamada de telefone celular. Email 
    est&aacute; rapidamente substituindo a correspond&ecirc;ncia postal, tornando-se 
    norma para todos, n&atilde;o a novidade que era no passado. E email pode ser 
    pesquisado de forma rotineira e autom&aacute;tica por palavras-chave interessantes, 
    em uma larga escala, sem detec&ccedil;&atilde;o. &Eacute; como pescaria com 
    rede.</p>
  <p>Talvez voc&ecirc; ache que seu email &eacute; suficientemente leg&iacute;timo 
    e que a criptografia seja injustific&aacute;vel. Se voc&ecirc; realmente &eacute; 
    um cidad&atilde;o obediente &agrave; lei e que n&atilde;o tem nada a esconder, 
    ent&atilde;o, por que voc&ecirc; n&atilde;o envia sempre o conte&uacute;do 
    de suas correspond&ecirc;ncias em cart&otilde;es postais? Por que n&atilde;o 
    se submete a teste de drogas quando pedido? Por que pedir um mandato judicial 
    para que a pol&iacute;cia entre em sua casa? Voc&ecirc; est&aacute; tentando 
    esconder algo? Se voc&ecirc; esconde sua correspond&ecirc;ncia dentro de envelopes, 
    isto significa que voc&ecirc; deve ser um subversivo ou um traficante, ou 
    talvez um louco paran&oacute;ico? Algum cidad&atilde;o obediente &agrave; 
    lei t&ecirc;m necessidade de criptografar seu email?</p>
  <p>E se todo mundo acreditasse que os cidad&atilde;os obedientes &agrave; lei 
    deveriam usar cart&otilde;es postais para suas correspond&ecirc;ncias? Se 
    algum n&atilde;o-conformista tentasse assegurar sua privacidade usando um 
    envelope para sua correspond&ecirc;ncia, isto despertaria suspeitas. Talvez 
    as autoridades abririam sua correspond&ecirc;ncia para ver o que ele est&aacute; 
    escondendo. Felizmente, n&atilde;o vivemos neste tipo de mundo, porque todos 
    protegem a maioria de suas correspond&ecirc;ncias com envelopes. Assim, ningu&eacute;m 
    desperta suspeitas quando garante sua privacidade com um envelope. H&aacute; 
    seguran&ccedil;a nos n&uacute;meros. De forma an&aacute;loga, seria bom se 
    todos habitualmente usassem a criptografia em todos os seus emails, inocentes 
    ou n&atilde;o, de modo que ningu&eacute;m levantasse suspeitas quando assegurasse 
    sua privacidade de email com codifica&ccedil;&atilde;o. Pense nisso como uma 
    forma de solidariedade.</p>
  <p>At&eacute; agora, se o governo quisesse violar a privacidade de cidad&atilde;os 
    comuns, teria que gastar uma certa quantia de dinheiro e trabalho para interceptar, 
    abrir e ler correspond&ecirc;ncias em papel. Ou teria que ouvir e possivelmente 
    transcrever conversas por telefone, ao menos antes da tecnologia de reconhecimento 
    autom&aacute;tico de voz estar dispon&iacute;vel. Este tipo de monitora&ccedil;&atilde;o 
    trabalhosa n&atilde;o &eacute; pr&aacute;tico em larga escala. Isto era feito 
    somente em casos importantes quando parecia valer a pena.</p>
  <p>A Lei 266 do Senado, uma lei anti-crime de 1991, tinha uma medida n&atilde;o 
    muito clara escondida nela. Se esta resolu&ccedil;&atilde;o n&atilde;o obrigat&oacute;ria 
    tivesse se tornado uma lei de verdade, teria for&ccedil;ado que fabricantes 
    de equipamentos de comunica&ccedil;&atilde;o segura a inserir &quot;armadilhas&quot; 
    especiais em seus produtos, de forma que o governo pudesse ler mensagens criptografadas 
    de qualquer pessoa. Esta lei diz: &quot;&Eacute; decis&atilde;o do Congresso 
    que fornecedores de servi&ccedil;os de comunica&ccedil;&atilde;o eletr&ocirc;nica 
    e fabricantes de equipamentos de servi&ccedil;o de comunica&ccedil;&atilde;o 
    eletr&ocirc;nica assegurem que os sistemas de comunica&ccedil;&otilde;es permitam 
    que o governo obtenha o conte&uacute;do integral de voz, dados, e outras comunica&ccedil;&otilde;es 
    quando apropriadamente autorizados por lei&quot;. Foi esta medida que me levou 
    a publicar eletronicamente PGP de forma gratuita naquele ano, pouco tempo 
    ap&oacute;s a medida ser anulada ap&oacute;s vigorosos protestos de civis 
    liberais e grupos industriais.</p>
  <p>Em 1994 a Lei de Telefonia Digital ordenava que as companhias telef&ocirc;nicas 
    instalassem portas de escuta remota em seus aparelhos digitais nos escrit&oacute;rios 
    centrais, criando uma nova infra-estrutura tecnol&oacute;gica para &quot;apontar-e-clicar&quot; 
    escutas, de forma que agentes federais n&atilde;o precisam mais sair e colocar 
    presilhas (&quot;jacar&eacute;s&quot;) &agrave;s linhas telef&ocirc;nicas. 
    Agora eles podem sentar em seus escrit&oacute;rios centrais e escutar suas 
    chamadas telef&ocirc;nicas. Claro, a lei ainda requer uma ordem da Corte para 
    uma escuta. Mas enquanto a infra-estrutura tecnol&oacute;gica pode persistir 
    por gera&ccedil;&otilde;es, leis e pol&iacute;cias podem mudar do dia para 
    a noite. Uma vez que uma infra-estrutura de comunica&ccedil;&otilde;es otimizada 
    para vigil&acirc;ncia se torna entrincheirada, uma guinada nas condi&ccedil;&otilde;es 
    pol&iacute;ticas levar ao abuso deste novo poder. Condi&ccedil;&otilde;es 
    pol&iacute;ticas podem mudar com a elei&ccedil;&atilde;o de um novo governo, 
    ou mesmo de forma mais abrupta como o bombardeamento de um pr&eacute;dio federal. 
  </p>
  <p>Um ano ap&oacute;s a Lei de Telefonia Digital passar, o FBI revelou planos 
    de exigir &agrave;s companhias telefônicas que constru&iacute;ssem em sua 
    infra-estrutura a capacidade para monitorar simultaneamente 1 por cento de 
    todos os telefonemas feitos em todas as principais cidades norte-americanas. 
    Isto representaria um aumento superior a mil vezes sobre níveis anteriores 
    no número de telefones que poderiam ser monitorados. Em anos anteriores, havia 
    apenas cerca de mil monitoramentos ordenados pelos tribunais nos Estados Unidos 
    por ano, em n&iacute;veis federal, estadual e local combinados. É duro ver 
    como o governo pode empregar suficientes ju&iacute;zes até mesmo para assinar 
    ordens de monitoramento suficientes para monitorar 1 por cento de todos nossos 
    telefonemas, muito menos contratar agentes federais suficientes para sentarem 
    e escutar todo aquele tráfego em tempo real. O único modo plausível de processar 
    essa quantidade de tráfego é um enorme aplicativo Orwelliano de tecnologia 
    de reconhecimento de voz automatizado para peneirar tudo isso, procurar palavras-chave 
    interessantes ou procura pela voz de um locutor em particular. Se o governo 
    não acha seu alvo na primeira amostra de 1 por cento, o monitoramento pode 
    ser alterado para outro 1 por cento diferente até o alvo ser achado, ou até 
    a linha telefônica de todo mundo for verificada por tr&aacute;fego subversivo. 
    O FBI diz que eles precisam desta capacidade para planejar para o futuro. 
    Este plano causou tal revolta que foi derrotado no Congresso, pelo menos desta 
    vez, em 1995. Mas o mero fato do FBI ter pedido tais grandes poderes revela 
    o programa de trabalho deles. E a derrota deste plano não &eacute; t&atilde;o 
    tranq&uuml;ilizante assim, quando você considera que a Lei de Telefonia Digital 
    de 1994 também foi derrotada na primeira vez em que foi introduzida, em 1993.</p>
  <p>Avan&ccedil;os na tecnologia n&atilde;o ir&atilde;o permitir a manuten&ccedil;&atilde;o 
    deste status quo, ao menos ao quanto diz respeito &agrave; privacidade. O 
    status quo &eacute; inst&aacute;vel. Se n&atilde;o fazemos nada, novas tecnologias 
    dar&atilde;o ao governo novas capacidades de vigil&acirc;ncia autom&aacute;tica 
    que Stalin jamais teria sonhado. A &uacute;nica forma de manter a linha na 
    privacidade na era da informa&ccedil;&atilde;o &eacute; a criptografia forte. 
  </p>
  <p>Voc&ecirc; n&atilde;o precisa duvidar do governo se quer usar criptografia. 
    Seus neg&oacute;cios podem ser monitorados por rivais nos neg&oacute;cios, 
    crime organizado, ou governos estrangeiros. Diversos governos estrangeiros, 
    por exemplo, admitem usar seus sinais de intelig&ecirc;ncia contra companhias 
    de outros pa&iacute;ses para dar &agrave; suas pr&oacute;prias corpora&ccedil;&otilde;es 
    uma margem competitiva. Ironicamente, as restri&ccedil;&otilde;es do governo 
    dos Estados Unidos &agrave; criptografia tem enfraquecido as defesas das corpora&ccedil;&otilde;es 
    americanas contra intelig&ecirc;ncias estrangeiras e o crime organizado.</p>
  <p>O governo sabe que regra central a criptografia est&aacute; destinada a ter 
    nas poderosas rela&ccedil;&otilde;es com seu povo. Em abril de 1993, a administra&ccedil;&atilde;o 
    Clinton revelou uma nova e grande iniciativa pol&iacute;tica de codifica&ccedil;&atilde;o, 
    que estava em desenvolvimento na Ag&ecirc;ncia de Seguran&ccedil;a Nacional, 
    (National Security Agency - NSA) desde o in&iacute;cio da administra&ccedil;&atilde;o 
    Bush. A pe&ccedil;a central desta iniciativa &eacute; um dispositivo de criptografia 
    planejado pelo governo, chamado de chip &quot;Clipper&quot;, contendo um novo 
    algoritmo de criptografia secreto da NSA. O Governo tentou incentivar a ind&uacute;stria 
    privada a projet&aacute;-lo em todos os seus produtos de comunica&ccedil;&atilde;o 
    segura, como telefones seguros, fax seguros etc. AT&amp;T colocou &quot;Clipper&quot; 
    em seus produtos de voz seguros. A tram&oacute;ia: na hora da fabrica&ccedil;&atilde;o, 
    cada chip Clipper &eacute; carregado com sua &uacute;nica chave pr&oacute;pria, 
    a qual o Governo ter&aacute; uma c&oacute;pia, que &eacute; colocada em ju&iacute;zo. 
    Nada com o que se preocupar, porque o governo promete que usar&aacute; estas 
    chaves para ler seu tr&aacute;fico apenas &quot;quando devidamente autorizado 
    por lei&quot;. Claro, para tornar &quot;Clipper&quot; completamente efetivo, 
    o pr&oacute;ximo passo l&oacute;gico seria considerar ilegal outras formas 
    de criptografia.</p>
  <p>O governo inicialmente afirmou que o uso de &quot;Clipper&quot; seria volunt&aacute;rio, 
    que ningu&eacute;m seria for&ccedil;ado a us&aacute;-lo ao inv&eacute;s de 
    outros tipos de criptografia. Mas a rea&ccedil;&atilde;o p&uacute;blica contra 
    o chip &quot;Clipper&quot; tem sido forte, ainda mais forte que o governo 
    antecipou. A ind&uacute;stria de computadores afirmou em uma s&oacute; voz 
    sua oposi&ccedil;&atilde;o contra o uso de &quot;Clipper&quot;. O diretor 
    do FBI Louis Freeh respondeu &agrave; uma pergunta em uma confer&ecirc;ncia 
    da imprensa em 1994 dizendo que se &quot;Clipper&quot; falhasse em obter suporte 
    do p&uacute;blico, e os monitoramentos do FBI fossem terminados por criptografia 
    n&atilde;o controlada pelo governo, seu escrit&oacute;rio n&atilde;o teria 
    escolha al&eacute;m de procurar aux&iacute;lio legislativo. Mais tarde, na 
    conseq&uuml;&ecirc;ncia da trag&eacute;dia de Oklahoma City, o sr. Freeh testemunhou 
    ao Comitê Judiciário do Senado que a disponibilidade pública de criptografia 
    forte deveria ser reduzida pelo governo (embora ninguém houvesse sugerido 
    que criptografia era usada pelos bombardeiros).</p>
  <p>O Centro de Informaç&otilde;es de Privacidade Eletrônica (Electronic Privacy 
    Information Center - EPIC) obteve alguns documentos esclarecedores sob o Ato 
    de Liberdade de Informação. Em um breve documento intitulado &quot;Codifica&ccedil;&atilde;o: 
    A Ameaça, Aplicações e Soluções Potenciais&quot;, e enviado ao Conselho de 
    Segurança Nacional em fevereiro de 1993, o FBI, NSA, e o Departamento de Justiça 
    (DOJ) conclu&iacute;ram que &quot;soluções técnicas, como elas s&atilde;o, 
    só funcionar&atilde;o se elas estiverem incorporadas em todos os produtos 
    de codifica&ccedil;&atilde;o. Para assegurar que isto aconte&ccedil;a, requer-se 
    legislação que designe o uso de produtos de codifica&ccedil;&atilde;o aprovados 
    pelo governo ou aderência &agrave; crit&eacute;rios de codifica&ccedil;&atilde;o 
    governamental&quot;. </p>
  <p>O governo tem um registro de passos que não inspira confiança em que eles 
    nunca abusar&atilde;o de nossas liberdades civis. O programa COINTELPRO do 
    FBI tinha como alvo grupos que se opunham &agrave;s políticas governamentais. 
    Eles espiaram no movimento antibélico e o movimento de direitos civis. Eles 
    grampearam o telefone de Martin Luther King Jr. Nixon teve sua lista de inimigos. 
    E então houve a bagun&ccedil;a de Watergate. O congresso parece agora ter 
    a inten&ccedil;&atilde;o de votar leis que reduzem nossa liberdade civil na 
    Internet. Em nenhum momento no século passado a desconfian&ccedil;a do p&uacute;blico 
    com o governo no espectro pol&iacute;tico tem sida t&atilde;o amplamente distribu&iacute;da, 
    como é hoje. </p>
  <p>Se nós quisermos resistir &agrave; esta obscura tendência do governo em proscrever 
    a criptografia, uma medida que podemos aplicar é usar criptografia o m&aacute;ximo 
    que pudermos agora enquanto ainda é legal. Quando o uso de criptografia forte 
    se torna popular, é mais dif&iacute;cil para o governo criminaliz&aacute;-la. 
    Assim, o uso de PGP é bom para preservar a democracia.</p>
  <p>Se privacidade for considerada ilegal, somente os criminosos ter&atilde;o 
    privacidade. As ag&ecirc;ncias de intelig&ecirc;ncia tem acesso a boa tecnologia 
    criptogr&aacute;fica. Assim como os grandes traficantes de armas e drogas. 
    Mas pessoas comuns e organiza&ccedil;&otilde;es pol&iacute;ticas populares 
    em sua maioria n&atilde;o tiveram acesso &agrave; tecnologia de criptografia 
    por chave p&uacute;blica de &quot;n&iacute;vel militar&quot; dispon&iacute;vel. 
    At&eacute; agora.</p>
  <p> PGP d&aacute; poderes &agrave;s pessoas para colocar suas privacidades em 
    suas pr&oacute;prias m&atilde;os. Existe uma crescente necessidade social 
    por ela. Foi por isto que eu o criei.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="algoritmos_simetricos_PGP"></a>Os 
  algoritmos sim&eacute;tricos de PGP</font></b></p>
<blockquote> 
  <p>PGP oferece uma sele&ccedil;&atilde;o de diferentes algoritmos de chaves 
    secretas para codificar a mensagem atual. Por algoritmo de chave secreta, 
    queremos dizer uma cifragem de blocos convencional, ou sim&eacute;tricos, 
    que usa a mesma chave para codificar e para decifrar. As tr&ecirc;s cifras 
    de blocos sim&eacute;tricos oferecidos por PGP s&atilde;o CAST, Triple-DES, 
    e IDEA. Eles n&atilde;o s&atilde;o algoritmos &quot;caseiros&quot;. Todos 
    eles foram desenvolvidos por times de cript&oacute;grafos de reconhecida reputa&ccedil;&atilde;o.</p>
  <p>Para os criptograficamente curiosos, todas as tr&ecirc;s cifras operam em 
    blocos de texto puro e texto cifrado de 64 bits. CAST e IDEA possuem chaves 
    de 128 bits de tamanho, enquanto Triple-DES usa uma chave de 168 bits. Como 
    o &quot;Data Encryption Standard&quot; (DES), qualquer uma dessas cifras pode 
    ser usada em modos de Realimenta&ccedil;&atilde;o de Cifras (&quot;cipher 
    feedback&quot;, ou CFB) e Liga&ccedil;&otilde;es de Blocos de Cifras (&quot;cipher 
    block chaining&quot;, ou CBC). PGP as usa em modo CFB de 64 bits.</p>
  <p>Eu inclu&iacute; o algoritmo de codifica&ccedil;&atilde;o CAST em PGP porque 
    ele mostra promessas como uma boa cifra de blocos com sua chave de 128 bits 
    de tamanho, &eacute; r&aacute;pido, e &eacute; gratuito. Seu nome &eacute; 
    derivado das iniciais de seus projetistas, Carlisle Adams e Stafford Tavares 
    da Northern Telecom (Nortel). Nortel pediu uma patente para CAST, mas eles 
    se comprometeram a tornar CAST dispon&iacute;vel a qualquer um sem pagamento 
    de &quot;royalties&quot;. CAST parece ser excepcionalmente bem projetado, 
    por pessoas com boa reputa&ccedil;&atilde;o no campo. O projeto &eacute; baseado 
    em uma aproxima&ccedil;&atilde;o bastante formal, com um n&uacute;mero de 
    assertivas formalmente prov&aacute;veis, que d&atilde;o boas raz&otilde;es 
    para acreditar que ele provavelmente requer exaust&atilde;o de chaves para 
    quebrar sua chave de 128 bits. CAST n&atilde;o possui chaves fracas ou semifracas. 
    H&aacute; fortes argumentos que CAST &eacute; imune tanto &agrave; criptoan&aacute;lise 
    linear e diferencial, as duas formas mais poderosas de criptoan&aacute;lise 
    na literatura publicada, onde ambas foram efetivas em quebrar o &quot;Data 
    Encryption Standard&quot; (DES). CAST &eacute; muito novo para ter desenvolvido 
    um longo registro de seus passos, mas seu projeto formal e a boa reputa&ccedil;&atilde;o 
    de seus projetistas ir&atilde;o sem d&uacute;vida atrair as aten&ccedil;&otilde;es 
    e tentativas de ataques criptoanal&iacute;ticos do resto da comunidade acad&ecirc;mica 
    de criptografia. Eu estou tendo a mesmo grau de confian&ccedil;a com CAST 
    que tive anos atr&aacute;s com IDEA, a cifra que selecionei para uso nas primeiras 
    vers&otilde;es de PGP. Naquela &eacute;poca, IDEA tamb&eacute;m era muito 
    novo para ter um registro de passos, mas t&ecirc;m suportado bem.</p>
  <p>A cifra de blocos IDEA (&quot;International Data Encryption Algorithm&quot;, 
    ou Algoritmo Internacional de Codifica&ccedil;&atilde;o de Dados) baseia-se 
    no conceito de projeto de &quot;misturar operações de grupos algébricos diferentes&quot;. 
    Isto foi desenvolvido na ETH em Zurique por James L. Massey e Xuejia Lai, 
    e publicado em 1990. Documentos publicados anteriormente sobre o algoritmo 
    o chamavam de IPES (&quot;Improved Proposed Encryption Standard&quot;, ou 
    Padrão Melhorado de Codifica&ccedil;&atilde;o Proposto), mas eles mudaram 
    o nome depois para IDEA. At&eacute; agora, IDEA t&ecirc;m resistido bem melhor 
    a ataques, que outras cifras como FEAL, REDOC-II, LOKI, Snefru e Khafre. E 
    IDEA é mais resistente que DES em ataques de criptoan&aacute;lise diferencial 
    de grande sucesso de Biham e Shamir, como também &agrave; ataques de criptoan&aacute;lise 
    linear. Como esta cifra continua atraindo esforços de ataque dos mais formidáveis 
    cantos do mundo criptoanal&iacute;tico, a confiança em IDEA está crescendo 
    com a passagem do tempo. Tristemente, o obstáculo maior para a aceitação de 
    IDEA como um padrão foi o fato que Ascom Systec mant&eacute;m a patente de 
    seu projeto, e ao contr&aacute;rio de DES e CAST, IDEA não foi disponibilizado 
    a todo o mundo em bases gratuitas.</p>
  <p>Para finalizar, PGP inclui tr&ecirc;s chaves Triple-DES em seu repert&oacute;rio 
    de cifras de bloco dispon&iacute;veis. O DES foi desenvolvido pela IBM em 
    meados dos anos setenta. Apesar de ter um bom projeto, sua chave de 56 bits 
    de tamanho &eacute; muito pequena para os padr&otilde;es de hoje. Triple-DES 
    &eacute; muito forte, e tem sido bem estudado por muitos anos, assim poderia 
    ser uma aposta mais segura que as cifras mais novas como CAST e IDEA. Triple-DES 
    &eacute; o DES aplicado tr&ecirc;s vezes para o mesmo bloco de dados, usando 
    tr&ecirc;s chaves diferentes, exceto que a segunda opera&ccedil;&atilde;o 
    de DES &eacute; feita de tr&aacute;s para frente, em modo de decifragem. Apesar 
    de Triple-DES ser muito mais lento que CAST ou IDEA, velocidade normalmente 
    n&atilde;o &eacute; cr&iacute;tico para aplicativos de email. Embora Triple-DES 
    use uma chave de 168 bits de tamanho, parece ter uma for&ccedil;a efetiva 
    de chave de pelo menos 112 bits contra um atacante, com uma capacidade impossivelmente 
    imensa de armazenamento de dados para usar no ataque. De acordo com um documento 
    apresentado por Michael Weiner na Crypto96, qualquer quantia remotamente plaus&iacute;vel 
    de armazenamento de dados dispon&iacute;vel ao atacante permitiria um ataque 
    que requereria tanto trabalho quanto a quebra de uma chave de 129 bits. Triple-DES 
    n&atilde;o est&aacute; amarrado por qualquer patente.</p>
  <p>Chaves p&uacute;blicas PGP que foram geradas por PGP Vers&atilde;o 5.0 ou 
    superiores possuem informa&ccedil;&otilde;es embutidas nelas que dizem ao 
    emitente quais blocos de cifragem s&atilde;o entendidas pelo software do destinat&aacute;rio, 
    de forma que o software do emitente saiba quais cifras podem ser usadas para 
    codifica&ccedil;&atilde;o. Chaves p&uacute;blicas Diffie-Hellman/DSS aceitam 
    CAST, IDEA, ou Triple-DES como cifra de bloco, com CAST sendo a sele&ccedil;&atilde;o 
    padr&atilde;o. No presente, por motivos de compatibilidade, chaves RSA n&atilde;o 
    possuem este recurso. Apenas a cifra IDEA &eacute; usada por PGP para enviar 
    mensagens para chaves RSA, porque vers&otilde;es mais antigas de PGP apenas 
    suportavam RSA e IDEA.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Sobre 
  as rotinas de compress&atilde;o de dados de PGP</font></b></p>
<blockquote> 
  <p>PGP normalmente comprime (compacta) o texto puro antes de codific&aacute;-lo, 
    porque &eacute; tarde demais comprimir o texto puro ap&oacute;s ele ser codificado; 
    dados codificados n&atilde;o s&atilde;o comprim&iacute;veis. Compress&atilde;o 
    de dados poupa tempo de transmiss&otilde;es via modem e espa&ccedil;o em disco 
    e, mais importante, aumenta a for&ccedil;a da seguran&ccedil;a criptogr&aacute;fica. 
    A maioria das t&eacute;cnicas criptoanal&iacute;ticas exploram redund&acirc;ncias 
    encontradas no texto puro para quebrar a cifra. Compress&atilde;o de dados 
    reduz esta redund&acirc;ncia no texto puro, portanto melhorando bastante a 
    resist&ecirc;ncia &agrave; criptoan&aacute;lise. Leva tempo extra comprimir 
    o texto puro, mas de um ponto de vista de seguran&ccedil;a vale a pena.</p>
  <p>Arquivos que s&atilde;o muito pequenos para comprimir, ou que n&atilde;o 
    comprimem bem, n&atilde;o s&atilde;o comprimidos por PGP. Al&eacute;m disso, 
    o programa reconhece arquivos produzidos pelos programas de compress&atilde;o 
    mais populares, como PKZIP, e n&atilde;o tenta comprimir um arquivo que j&aacute; 
    foi comprimido.</p>
  <p>Para os tecnicamente curiosos, o programa usa as rotinas de compress&atilde;o 
    freeware ZIP escritas por Jean-Loup Gailly, Mark Adler, e Richard B. Wales. 
    Este software ZIP usa algoritmos de compress&atilde;o que s&atilde;o funcionalmente 
    equivalentes &agrave;queles usados pela PKWare em PKZIP 2.x. Este software 
    de compress&atilde;o ZIP foi escolhido para PGP principalmente porque tem 
    uma taxa de compress&atilde;o realmente boa e porque &eacute; r&aacute;pido.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Sobre 
  os n&uacute;meros aleat&oacute;rios usados como chaves de sess&atilde;o</font></b></p>
<blockquote> 
  <p>PGP usa um criptograficamente forte gerador de n&uacute;meros pseudo-aleat&oacute;rios 
    para criar chaves de sess&atilde;o tempor&aacute;rias. Se este arquivo de 
    inicializa&ccedil;&atilde;o de n&uacute;meros aleat&oacute;rios n&atilde;o 
    existir, ele &eacute; automaticamente criado e iniciado com n&uacute;meros 
    realmente aleat&oacute;rios derivados de seus eventos aleat&oacute;rios, obtidos 
    pelo programa PGP atrav&eacute;s do tempo de seu pressionar de teclas e movimentos 
    do mouse.</p>
  <p>Este gerador reinicializa o arquivo de inicializa&ccedil;&atilde;o a cada 
    vez que &eacute; usado, misturando novo material parcialmente derivado da 
    hora do dia e outras fontes verdadeiramente aleat&oacute;rias. Ele usa algoritmos 
    convencionais de codifica&ccedil;&atilde;o como motor para o gerador de n&uacute;meros 
    aleat&oacute;rios. O arquivo de inicializa&ccedil;&atilde;o cont&eacute;m 
    tanto material de inicializa&ccedil;&atilde;o aleat&oacute;ria quanto material 
    de chaves aleat&oacute;rias, usadas para tensionar o motor de codifica&ccedil;&atilde;o 
    condicional para o gerador aleat&oacute;rio.</p>
  <p>Este arquivo de inicializa&ccedil;&atilde;o aleat&oacute;ria deve ser protegido 
    de descobertas, para reduzir o risco de um atacante derivar suas pr&oacute;ximas 
    ou anteriores chaves de sess&atilde;o. O atacante teria um tempo muito duro 
    para obter qualquer coisa &uacute;til atrav&eacute;s da captura deste arquivo 
    de inicializa&ccedil;&atilde;o aleat&oacute;ria, porque o arquivo &eacute; 
    criptograficamente limpo antes e depois de cada uso. De qualquer forma, parece 
    ser prudente tentar mant&ecirc;-lo longe de m&atilde;os erradas. Se poss&iacute;vel, 
    fa&ccedil;a o arquivo leg&iacute;vel apenas por voc&ecirc;. Se n&atilde;o 
    for poss&iacute;vel, n&atilde;o deixe outras pessoas indiscriminadamente copiar 
    discos de seu computador.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Sobre 
  o sum&aacute;rio da mensagem</font></b></p>
<blockquote> 
  <p>O sum&aacute;rio da mensagem (no original, &quot;message digest&quot;) &eacute; 
    um &quot;destilado&quot; compacto (de 160 ou 128 bits) do &quot;checksum&quot; 
    (um m&eacute;todo de detec&ccedil;&atilde;o de erros) de sua mensagem ou arquivo. 
    Voc&ecirc; pode pensar nele como a &quot;impress&atilde;o digital&quot; da 
    mensagem ou arquivo. O sum&aacute;rio da mensagem &quot;representa&quot; sua 
    mensagem, de forma que se a mensagem fosse alterada de qualquer forma, um 
    diferente sum&aacute;rio da mensagem seria computado dela. Isto torna poss&iacute;vel 
    detectar quaisquer altera&ccedil;&otilde;es feitas em uma mensagem por um 
    falsificador. Um sum&aacute;rio da mensagem &eacute; computado usando uma 
    fun&ccedil;&atilde;o hash de caminho &uacute;nico criptograficamente forte 
    na mensagem. Deve ser computacionalmente impratic&aacute;vel para um atacante 
    planejar uma mensagem substitua que produziria um sum&aacute;rio da mensagem 
    id&ecirc;ntico. Neste respeito, um sum&aacute;rio da mensagem &eacute; muito 
    melhor que um &quot;checksum&quot;, porque &eacute; f&aacute;cil projetar 
    uma mensagem diferente que produziria o mesmo &quot;checksum&quot;. Mas, como 
    um &quot;checksum&quot;, voc&ecirc; n&atilde;o pode derivar a mensagem original 
    de seu sum&aacute;rio da mensagem.</p>
  <p>O algoritmo de sum&aacute;rio da mensagem agora usado em PGP (vers&otilde;es 
    5.0 e posteriores) &eacute; chamado SHA, abrevia&ccedil;&atilde;o de &quot;Secure 
    Hash Algorithm&quot; (ou Algoritmo de Hash Seguro), projetado pela NSA para 
    o &quot;National Institute of Standards and Technology&quot; (NIST). SHA &eacute; 
    um algoritmo de hash de 160 bits. Algumas pessoas podem olhar qualquer coisa 
    da NSA com suspeita, porque a NSA tem a fun&ccedil;&atilde;o de interceptar 
    comunica&ccedil;&otilde;es e quebrar c&oacute;digos. Mas tenha em mente que 
    a NSA n&atilde;o tem interesse em forjar assinaturas, e o governo seria beneficiado 
    com um bom padr&atilde;o de assinaturas digitais infalsific&aacute;veis que 
    iria impediria qualquer um de rejeitar suas assinaturas. Isto possui benef&iacute;cios 
    distintos para fazer cumprir a lei e reunir intelig&ecirc;ncia. Tamb&eacute;m, 
    SHA tem sido publicado na literatura aberta e tem sido extensivamente e atentamente 
    revisto pela maioria dos melhores cript&oacute;grafos no mundo, que se especializaram 
    em fun&ccedil;&otilde;es hash, e a opini&atilde;o un&acirc;nime &eacute; que 
    SHA &eacute; extremamente bem projetado. Ele possui algumas inova&ccedil;&otilde;es 
    de projeto que vencem todas as fraquezas observadas em algoritmos de sum&aacute;rios 
    da mensagem anteriormente publicados por cript&oacute;grafos acad&ecirc;micos. 
    Todas as novas vers&otilde;es de PGP usam SHA como algoritmo de &quot;sum&aacute;rio 
    da mensagem&quot; para criar assinaturas com as novas chaves DSS que seguem o Padr&atilde;o 
    de Assinatura Digital do NIST. Por raz&otilde;es de compatibilidade, novas 
    vers&otilde;es de PGP ainda usam MD5 para assinaturas RSA, porque vers&otilde;es 
    antigas de PGP usavam MD5 para assinaturas RSA.</p>
  <p>O algoritmo de sum&aacute;rio da mensagem usado por vers&otilde;es antigas 
    de PGP &eacute; o Algoritmo de Sum&aacute;rio da Mensagem MD5, colocado em 
    dom&iacute;nio p&uacute;blico pela RSA Data Security, Inc. MD5 &eacute; um 
    algoritmo hash de 128 bits. Em 1996, MD5 foi quebrado por um cript&oacute;grafo 
    alem&atilde;o, Hans Dobbertin. Apesar de MD5 n&atilde;o ter sido completamente 
    quebrado na &eacute;poca, foi descoberto que ele possui fraquezas t&atilde;o 
    s&eacute;rias que ningu&eacute;m deveria continuar usando-o para gerar assinaturas. 
    Maiores trabalhos nesta &aacute;rea poder&atilde;o quebr&aacute;-lo completamente, 
    permitindo que assinaturas sejam falsificadas. Se voc&ecirc; n&atilde;o quer 
    um dia descobrir sua assinatura digital PGP em uma confiss&atilde;o falsificada, 
    aconselha-se que voc&ecirc; migre para as novas chaves DSS de PGP como m&eacute;todo 
    preferido para criar assinaturas digitais, porque DSS usa SHA como seu algoritmo 
    hash seguro.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="como_proteger_chaves_publicas_de_falsificacoes"></a>Como 
  proteger suas chaves p&uacute;blicas de falsifica&ccedil;&otilde;es</font></b></p>
<blockquote> 
  <p>Num sistema de criptografia por chave p&uacute;blica, voc&ecirc; n&atilde;o 
    precisa proteger as chaves p&uacute;blicas da exposi&ccedil;&atilde;o. Na 
    verdade, &eacute; melhor se elas forem largamente disseminadas. Mas &eacute; 
    importante proteger as chaves p&uacute;blicas de falsifica&ccedil;&otilde;es, 
    para ter a certeza de que uma determinada chave realmente pertence a quem 
    ela aparenta pertencer. Talvez seja esta a vulnerabilidade mais importante 
    de um sistema de criptografia por chave p&uacute;blica. Vamos primeiro considerar 
    um desastre potencial, ent&atilde;o ver como evit&aacute;-lo com seguran&ccedil;a 
    utilizando PGP.</p>
  <p>Suponhamos que voc&ecirc; quer enviar uma mensagem privada para a Alice. 
    Voc&ecirc; faz o &quot;download&quot; do certificado da chave p&uacute;blica 
    de Alice de uma BBS (&quot;Bulletin Board System&quot;). Voc&ecirc; codifica 
    sua carta para Alice com esta chave p&uacute;blica, e a envia para ela atrav&eacute;s 
    do servi&ccedil;o de email da BBS.</p>
  <p>Infelizmente, sem que voc&ecirc; e Alice saibam, um outro utilizador chamado 
    Charlie infiltrou-se na BBS e gerou uma chave p&uacute;blica para ele com 
    o ID de usu&aacute;rio de Alice anexado. Ele secretamente substitui sua chave 
    falsa pela chave p&uacute;blica verdadeira de Alice. Voc&ecirc; inadvertidamente 
    usa esta chave falsa de Charlie ao inv&eacute;s da chave p&uacute;blica de 
    Alice. Tudo parece normal porque a chave falsa tem o ID de usu&aacute;rio 
    de Alice. Agora Charlie pode decifrar a mensagem enviada para ela porque tem 
    a chave privada correspondente. Ele pode at&eacute; mesmo re-codificar novamente 
    a mensagem decifrada com a chave p&uacute;blica verdadeira de Alice e enviar 
    a mensagem para ela, de modo que ningu&eacute;m suspeite algo errado. Al&eacute;m 
    disso, ele pode mesmo forjar assinaturas aparentemente boas de Alice com esta 
    chave privada, porque todo mundo estar&aacute; usando a chave p&uacute;blica 
    falsa para verificar as assinaturas de Alice.</p>
  <p>O &uacute;nico jeito de evitar este desastre &eacute; prevenir qualquer um 
    de falsifica&ccedil;&otilde;es de chaves p&uacute;blicas. Se voc&ecirc; recebeu 
    a chave p&uacute;blica de Alice diretamente dela, n&atilde;o h&aacute; problema. 
    Mas isto pode ser dif&iacute;cil se ela estiver a milhares de quil&ocirc;metros 
    de dist&acirc;ncia, ou estiver atualmente inacess&iacute;vel.</p>
  <p>Talvez voc&ecirc; pudesse obter a chave p&uacute;blica de Alice de um amigo 
    confiado por ambos, David, que sabe que possui uma c&oacute;pia boa da chave 
    p&uacute;blica de Alice. David poderia assinar a chave p&uacute;blica de Alice, 
    garantindo a integridade da chave p&uacute;blica. David criaria esta assinatura 
    com sua pr&oacute;pria chave privada.</p>
  <p>Isto criaria um certificado assinado de chave p&uacute;blica, indicando que 
    a chave de Alice n&atilde;o foi falsificada. Isto requer que voc&ecirc; tenha 
    uma c&oacute;pia boa da chave p&uacute;blica de David para verificar a assinatura 
    dele. Talvez David tamb&eacute;m pudesse fornecer a Alice uma c&oacute;pia 
    assinada de sua chave p&uacute;blica. David estaria assim servindo como um 
    &quot;Apresentador&quot; entre voc&ecirc; e Alice.</p>
  <p>Este certificado assinado de chave p&uacute;blica para Alice poderia ser 
    transferido por David ou Alice para a BBS, e voc&ecirc; poderia fazer o &quot;download&quot; 
    dele mais tarde. Voc&ecirc; poderia ent&atilde;o verificar a assinatura atrav&eacute;s 
    da chave p&uacute;blica de David, e assim se certificar de que esta &eacute; 
    realmente a chave p&uacute;blica de Alice. Nenhum impostor pode tentar engan&aacute;-lo 
    mostrando sua pr&oacute;pria chave falsa como sendo a de Alice, porque ningu&eacute;m 
    mais pode forjar assinaturas feitas por David.</p>
  <p>Uma pessoa amplamente confiada poderia at&eacute; especializar-se em fazer 
    este servi&ccedil;o de &quot;apresentar&quot; usu&aacute;rios para outros, 
    provendo assinaturas para seus certificados de chave p&uacute;blica. Esta 
    pessoa confiada poderia ser considerada como uma &quot;Autoridade de Certifica&ccedil;&atilde;o&quot;. 
    Quaisquer certificados de chave p&uacute;blica que tivessem a assinatura da 
    Autoridade de Certifica&ccedil;&atilde;o poderiam ser considerados como realmente 
    pertencentes &agrave;s pessoas a quem aparentam pertencer. Todos os utilizadores 
    que quisessem participar precisariam de uma c&oacute;pia boa conhecida apenas 
    da chave p&uacute;blica da Autoridade de Certifica&ccedil;&atilde;o, de uma 
    forma que as assinaturas da Autoridade de Certifica&ccedil;&atilde;o pudessem 
    ser verificadas. Em alguns casos, a Autoridade de Certifica&ccedil;&atilde;o 
    tamb&eacute;m poderia atuar como um servidor de chaves, permitindo usu&aacute;rios 
    em uma rede procurar por chaves p&uacute;blicas pedindo-as ao servidor de 
    chaves, mas n&atilde;o h&aacute; raz&atilde;o para um servidor de chaves tamb&eacute;m 
    precisar de certificar chaves.</p>
  <p>Uma Autoridade de Certifica&ccedil;&atilde;o confiada e centralizada &eacute; 
    especialmente apropriada para grandes corpora&ccedil;&otilde;es impessoais 
    centralmente controladas ou para institui&ccedil;&otilde;es governamentais. 
    Alguns ambientes institucionais usam hierarquias de Autoridades de Certifica&ccedil;&atilde;o.</p>
  <p>Para ambientes mais decentralizados, permitir que todos os usu&aacute;rios 
    atuem como apresentadores confi&aacute;veis para seus amigos provavelmente 
    funcionaria melhor que uma autoridade de certifica&ccedil;&atilde;o centralizada.</p>
  <p>Um dos recursos atrativos de PGP &eacute; que ele opera igualmente bem em 
    um ambiente centralizado com uma Autoridade de Certifica&ccedil;&atilde;o 
    ou em um ambiente mais decentralizado onde os indiv&iacute;duos trocam chaves 
    pessoais. </p>
  <p>Todo esse neg&oacute;cio de proteger chaves p&uacute;blicas de falsifica&ccedil;&otilde;es 
    &eacute; o problema &uacute;nico mais dif&iacute;cil em aplicativos pr&aacute;ticos 
    de chave p&uacute;blica. &Eacute; o &quot;calcanhar de Aquiles&quot; da criptografia 
    por chave p&uacute;blica, e um bocado da complexidade do software diz respeito 
    &agrave; solu&ccedil;&atilde;o deste problema.</p>
  <p>Voc&ecirc; deve usar uma chave p&uacute;blica somente depois de ter certeza 
    de que se trata de uma chave boa que n&atilde;o foi falsificada, e que ela 
    realmente pertence &agrave; pessoa a quem pretende estar associada. Voc&ecirc; 
    pode estar certo disto se voc&ecirc; obter este certificado de chave p&uacute;blica 
    diretamente de seu propriet&aacute;rio, ou se ela leva a assinatura de uma 
    outra pessoa que voc&ecirc; confia, e de quem voc&ecirc; j&aacute; possui 
    uma chave p&uacute;blica boa. Tamb&eacute;m, o ID de usu&aacute;rio deveria 
    ter o nome completo do propriet&aacute;rio da chave, n&atilde;o apenas seu 
    primeiro nome.</p>
  <p>N&atilde;o importa o qu&atilde;o tentado voc&ecirc; fique, voc&ecirc; <i>nunca</i> 
    deve deixar a prud&ecirc;ncia de lado e confiar em uma chave p&uacute;blica 
    que transferiu de uma BBS, a menos que ela esteja assinada por algu&eacute;m 
    que voc&ecirc; confie. Aquela chave p&uacute;blica n&atilde;o certificada 
    poderia ter sido falsificada por qualquer um, talvez at&eacute; pelo administrador 
    de sistema da BBS.</p>
  <p>Se lhe pedirem para assinar o certificado de chave p&uacute;blica de algu&eacute;m, 
    certifique-se de que ele realmente pertence &agrave; pessoa mencionada no 
    ID de usu&aacute;rio daquele certificado. Isto porque sua assinatura neste 
    certificado de chave p&uacute;blica &eacute; uma promessa feita por voc&ecirc; 
    que esta chave realmente pertence &agrave;quela pessoa. Outras pessoas que 
    confiem em voc&ecirc; aceitar&atilde;o a chave p&uacute;blica da pessoa porque 
    ela leva sua assinatura. N&atilde;o &eacute; aconselh&aacute;vel confiar no 
    que outros dizem — n&atilde;o assine a chave p&uacute;blica a menos que tenha 
    conhecimento de primeira m&atilde;o que esta chave realmente pertence &agrave; 
    pessoa. Preferivelmente, voc&ecirc; deve assin&aacute;-la somente se conseguir 
    diretamente dela.</p>
  <p>De forma a assinar uma chave p&uacute;blica, voc&ecirc; deve ter muito mais 
    certeza da propriedade da chave do que se meramente a quiser usar para codificar 
    uma mensagem. Para estar convencido da validade de uma chave o suficiente 
    para us&aacute;-la, assinaturas de certifica&ccedil;&atilde;o de apresentadores 
    confi&aacute;veis devem bastar. Mas, para assinar por si s&oacute; uma chave, 
    voc&ecirc; deve ter um conhecimento pr&oacute;prio de primeira m&atilde;o 
    sobre quem a possui. Talvez voc&ecirc; possa ligar para o propriet&aacute;rio 
    da chave e ler a impress&atilde;o digital da chave para ele, para confirmar 
    que a chave que voc&ecirc; tem &eacute; realmente dele — e certificar-se de 
    que est&aacute; realmente falando com a pessoa certa.</p>
  <p>Tenha em mente que sua assinatura num certificado de chave p&uacute;blica 
    n&atilde;o garante a integridade daquela pessoa, mas apenas garante a integridade 
    (a propriedade) da chave p&uacute;blica desta pessoa. Voc&ecirc; n&atilde;o 
    est&aacute; arriscando sua credibilidade quando assina a chave p&uacute;blica 
    de um sociopata, se estiver completamente certo que a chave realmente pertence 
    a ele. Outras pessoas aceitariam a chave como pertencendo a ele porque voc&ecirc; 
    a assinou (assumindo que eles confiam em voc&ecirc;), mas eles n&atilde;o 
    confiariam no propriet&aacute;rio da chave. Confiar em uma chave n&atilde;o 
    &eacute; a mesma coisa que confiar no propriet&aacute;rio da chave.</p>
  <p>Seria uma boa id&eacute;ia manter sua pr&oacute;pria chave p&uacute;blica 
    em m&atilde;os com uma cole&ccedil;&atilde;o de assinaturas de certifica&ccedil;&atilde;o 
    anexas, de uma s&eacute;rie de &quot;apresentadores&quot;, na esperan&ccedil;a 
    que a maioria das pessoas confiem em pelo menos um dos apresentadores que 
    garantem a validade da sua chave p&uacute;blica. Voc&ecirc; poderia colocar 
    sua chave com a cole&ccedil;&atilde;o anexada de assinaturas de certifica&ccedil;&atilde;o 
    em v&aacute;rias BBSs. Se voc&ecirc; assinar a chave p&uacute;blica de algu&eacute;m, 
    envie-a de volta &agrave; pessoa com sua assinatura, de forma que ele possa 
    acrescentar sua assinatura &agrave; sua pr&oacute;pria cole&ccedil;&atilde;o 
    de credenciais para sua chave p&uacute;blica.</p>
  <p>Certifique-se de que ningu&eacute;m possa falsificar o seu pr&oacute;prio 
    chaveiro p&uacute;blico. A verifica&ccedil;&atilde;o de um certificado de 
    chave p&uacute;blica rec&eacute;m assinado deve definitivamente depender da 
    integridade das chaves p&uacute;blicas confi&aacute;veis que j&aacute; est&atilde;o 
    em seu pr&oacute;prio chaveiro p&uacute;blico. Mantenha controle f&iacute;sico 
    sobre seu chaveiro p&uacute;blico, preferencialmente em seu pr&oacute;prio 
    computador pessoal ao inv&eacute;s de em um sistema remoto de compartilhamento 
    de tempo, como voc&ecirc; faria com sua chave privada. Isto &eacute; para 
    proteg&ecirc;-lo de falsifica&ccedil;&otilde;es, n&atilde;o de exposi&ccedil;&atilde;o. 
    Mantenha uma c&oacute;pia <i>backup</i> confi&aacute;vel de seu chaveiro p&uacute;blico 
    e de sua chave privada em uma m&iacute;dia protegida contra grava&ccedil;&atilde;o.</p>
  <p>J&aacute; que sua pr&oacute;pria chave p&uacute;blica confi&aacute;vel &eacute; 
    usada como autoridade final para direta ou indiretamente certificar todas 
    as outras chaves no seu chaveiro, ela &eacute; a chave mais importante a ser 
    protegida contra falsifica&ccedil;&otilde;es. Voc&ecirc; pode querer manter 
    uma c&oacute;pia <i>backup</i> dela em um disquete protegido contra grava&ccedil;&atilde;o.</p>
  <p> PGP geralmente assume que voc&ecirc; mant&eacute;m seguran&ccedil;a f&iacute;sica 
    sobre seu sistema e seus chaveiros, como tamb&eacute;m &agrave; sua pr&oacute;pria 
    c&oacute;pia de PGP. Se um intruso conseguir falsificar seu disco, ent&atilde;o 
    em teoria ele poder&aacute; falsificar o pr&oacute;prio programa, tornando 
    in&uacute;teis as prote&ccedil;&otilde;es que o programa pode ter para detectar 
    falsifica&ccedil;&otilde;es com chaves.</p>
  <p>Uma forma um tanto complicada de proteger todo seu chaveiro de falsifica&ccedil;&otilde;es 
    &eacute; assinando-o todo com sua pr&oacute;pria chave privada. Voc&ecirc; 
    poderia fazer isso fazendo um &quot;certificado de assinatura separada&quot; 
    do seu chaveiro p&uacute;blico.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Como 
  PGP mant&eacute;m registro de quais chaves s&atilde;o v&aacute;lidas?</font></b></p>
<blockquote> 
  <p>Antes de ler esta se&ccedil;&atilde;o, voc&ecirc; deveria ler a se&ccedil;&atilde;o 
    anterior, <a href="#como_proteger_chaves_publicas_de_falsificacoes">&quot;Como 
    proteger chaves p&uacute;blicas de falsifica&ccedil;&otilde;es&quot;</a>.</p>
  <p> PGP mant&eacute;m registro de quais chaves no seu chaveiro p&uacute;blico 
    est&atilde;o apropriadamente certificadas com assinaturas de apresentadores 
    que voc&ecirc; confia. Tudo o que voc&ecirc; tem a fazer &eacute; dizer a 
    PGP quais pessoas voc&ecirc; confia como apresentadores, e certificar voc&ecirc; 
    mesmo as chaves destes com sua chave privada. A partir da&iacute; PGP automaticamente 
    validar&aacute; quaisquer outras chaves que tenham sido assinadas pelos apresentadores 
    que voc&ecirc; designou. E &eacute; claro que voc&ecirc; pode diretamente 
    assinar mais chaves voc&ecirc; mesmo.</p>
  <p>H&aacute; dois crit&eacute;rios completamente diferentes que PGP usa para 
    julgar a utilidade de um chave p&uacute;blica — n&atilde;o as confunda:</p>
  <ol>
    <li>A chave realmente pertence a quem ela aparenta pertencer? Em outras palavras, 
      ela foi certificada por um assinatura confi&aacute;vel?<br>
      <br>
    </li>
    <li>A chave pertence a algu&eacute;m em quem voc&ecirc; pode confiar para 
      certificar outras chaves? </li>
  </ol>
  <p> PGP pode calcular a resposta para a primeira quest&atilde;o. Para responder 
    &agrave; segunda quest&atilde;o, voc&ecirc; deve dizer explicitamente a PGP. 
    Quando voc&ecirc; fornece a resposta &agrave; quest&atilde;o 2, PGP ent&atilde;o 
    calcula a resposta para a quest&atilde;o 1 para outras chaves assinadas pelo 
    apresentador que voc&ecirc; designou como sendo confi&aacute;vel.</p>
  <p>Chaves que foram certificadas por um apresentador confi&aacute;vel s&atilde;o 
    consideradas v&aacute;lidas por PGP. As chaves que perten&ccedil;am a apresentadores 
    confi&aacute;veis devem ser elas pr&oacute;prias serem certificadas ou por 
    voc&ecirc; ou por outros apresentadores confi&aacute;veis.</p>
  <p> PGP tamb&eacute;m permite a possibilidade de voc&ecirc; ter v&aacute;rios 
    n&iacute;veis de confian&ccedil;a para as pessoas que atuam como apresentadores. 
    Sua confian&ccedil;a para um propriet&aacute;rio de uma chave atuar como um 
    apresentador n&atilde;o simplesmente reflete sua estima em sua integridade 
    pessoal — ela tamb&eacute;m deve refletir qu&atilde;o competente voc&ecirc; 
    pensa que eles s&atilde;o em entender o gerenciamento de chaves e usar um 
    bom julgamento quando assinam chaves. Voc&ecirc; pode designar uma pessoa 
    como n&atilde;o confi&aacute;vel, marginalmente confi&aacute;vel, ou totalmente 
    confi&aacute;vel para certificar outras chaves p&uacute;blicas. Esta informa&ccedil;&atilde;o 
    sobre confian&ccedil;a &eacute; armazenada em seu chaveiro com as chaves destes, 
    mas quando voc&ecirc; diz a PGP para copiar uma chave que n&atilde;o est&aacute; 
    em seu chaveiro, PGP n&atilde;o copia a informa&ccedil;&atilde;o sobre confian&ccedil;a 
    juntamente com a chave, porque suas opini&otilde;es pessoais sobre confian&ccedil;a 
    s&atilde;o consideradas confidenciais.</p>
  <p>Quando PGP est&aacute; calculando a validade de uma chave p&uacute;blica, 
    ele examina o n&iacute;vel de confian&ccedil;a de todas as assinaturas de 
    certifica&ccedil;&atilde;o anexadas a ela. Ele computa uma nota m&eacute;dia 
    de validade — por exemplo, duas assinaturas marginalmente confi&aacute;veis 
    s&atilde;o consideradas t&atilde;o dignas de cr&eacute;dito quanto uma assinatura 
    de confian&ccedil;a completa. O ceticismo do programa &eacute; ajust&aacute;vel 
    — por exemplo, voc&ecirc; pode regular PGP para requerer duas assinaturas 
    de total confian&ccedil;a ou tr&ecirc;s de confian&ccedil;a marginal para 
    julgar uma chave como v&aacute;lida.</p>
  <p>Sua pr&oacute;pria chave &eacute; &quot;axiomaticamente&quot; v&aacute;lida 
    para PGP, n&atilde;o necessitando de nenhuma assinatura de apresentadores 
    para provar sua validade. PGP sabe quais s&atilde;o suas chaves p&uacute;blicas, 
    procurando pelas chaves privadas correspondentes no chaveiro privado. PGP 
    tamb&eacute;m assume que voc&ecirc; confia completamente em voc&ecirc; mesmo 
    para certificar outras chaves.</p>
  <p>&Agrave; medida que o tempo passa, voc&ecirc; acumular&aacute; chaves de 
    outras pessoas que talvez possa querer designar como apresentadores confi&aacute;veis. 
    Todos os outros escolher&atilde;o seus pr&oacute;prios apresentadores confi&aacute;veis. 
    E todo mundo ir&aacute; gradualmente acumular e distribuir com suas chaves 
    uma cole&ccedil;&atilde;o de assinaturas de certifica&ccedil;&atilde;o de 
    outras pessoas, com a esperan&ccedil;a de que algu&eacute;m que a receba ir&aacute; 
    confiar em pelo menos uma ou duas das assinaturas. Isto causar&aacute; a emerg&ecirc;ncia 
    de uma rede de confian&ccedil;a descentralizada e tolerante a erros para todas 
    as chaves p&uacute;blicas.</p>
  <p>Esta atitude popular &uacute;nica contrasta fortemente com os esquemas padr&atilde;o 
    de gest&atilde;o de chaves desenvolvido pelo governo e outras institui&ccedil;&otilde;es 
    monol&iacute;ticas, como o Internet Privacy Enhanced Mail (PEM), que s&atilde;o 
    baseados num controle centralizado e num sistema de confian&ccedil;a centralizado 
    mandat&oacute;rio. Os esquemas padr&otilde;es baseiam-se numa hierarquia de 
    Autoridades de Certifica&ccedil;&atilde;o que ditam em quem voc&ecirc; deve 
    confiar. O m&eacute;todo descentralizado probabil&iacute;stico do programa 
    para determinar a legitimidade de chaves p&uacute;blicas &eacute; o ponto 
    chave da sua arquitetura da gerenciamento de chaves. PGP permite que voc&ecirc; 
    apenas decida em quem confiar, colocando voc&ecirc; no topo de sua pr&oacute;pria 
    pir&acirc;mide de certifica&ccedil;&atilde;o privada. PGP &eacute; para as 
    pessoas que preferem elas mesmas embalarem seus pr&oacute;prios p&aacute;ra-quedas.</p>
  <p>Note que enquanto essa atitude descentralizada e popular &eacute; enfatizada 
    aqui, isto n&atilde;o significa que PGP n&atilde;o funcione igualmente bem 
    em esquemas de gerenciamento de chaves p&uacute;blicas mais hier&aacute;rquicos 
    e centralizados. Usu&aacute;rios de grandes corpora&ccedil;&otilde;es, por 
    exemplo, v&atilde;o provavelmente querer uma figura ou pessoa central que 
    assine todas as chaves de seus funcion&aacute;rios. PGP manipula este cen&aacute;rio 
    centralizado como um caso especialmente degenerado do modelo de confian&ccedil;a 
    mais generalizado de PGP.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Como 
  proteger suas chaves privadas de serem descobertas</font></b></p>
<blockquote> 
  <p>Proteja sua pr&oacute;pria chave p&uacute;blica e sua frase-senha com muito 
    cuidado. Se a sua chave privada for comprometida, &eacute; melhor que voc&ecirc; 
    avise o mais r&aacute;pido poss&iacute;vel todas as partes interessadas antes 
    que algu&eacute;m a use para fazer assinaturas em seu nome. Por exemplo, algu&eacute;m 
    poderia utiliz&aacute;-la para assinar certificados de chave p&uacute;blica 
    falsos, o que poderia criar problemas para muitas pessoas, especialmente se 
    a sua assinatura &eacute; largamente confiada. E &eacute; claro, o comprometimento 
    de sua pr&oacute;pria chave p&uacute;blica poderia revelar todas as mensagens 
    que lhe foram enviadas.</p>
  <p>Para proteger a sua chave secreta, voc&ecirc; pode come&ccedil;ar por manter 
    sempre um controle f&iacute;sico sobre ela. Guard&aacute;-la em seu computador 
    pessoal em casa est&aacute; OK, ou mant&ecirc;-la em seu computador &quot;notebook&quot; 
    que transporta consigo. Se voc&ecirc; precisar usar um computador num escrit&oacute;rio 
    no qual voc&ecirc; n&atilde;o tem sempre um controle f&iacute;sico, guarde 
    suas chaves p&uacute;blicas e privadas em um disquete remov&iacute;vel protegido 
    contra grava&ccedil;&atilde;o, e n&atilde;o o deixe para tr&aacute;s quando 
    deixar o escrit&oacute;rio. N&atilde;o seria boa id&eacute;ia deixar sua chave 
    privada residir em um computador remoto com compartilhamento de tempo, como 
    um sistema remoto UNIX por discagem. Algu&eacute;m poderia espionar sua linha 
    do modem e capturar sua frase-senha, e ent&atilde;o obter sua chave privada 
    a partir do sistema remoto. Voc&ecirc; deve usar sua chave privada apenas 
    em uma m&aacute;quina que est&aacute; sob seu controle f&iacute;sico.</p>
  <p>N&atilde;o armazene sua frase-senha em qualquer lugar no computador que tem 
    o arquivo de sua chave privada. Armazenar tanto a chave privada e a frase-senha 
    no mesmo computador &eacute; t&atilde;o perigoso quanto guardar seu c&oacute;digo 
    pessoal na mesma carteira onde est&aacute; seu cart&atilde;o de cr&eacute;dito. 
    Voc&ecirc; n&atilde;o ir&aacute; querer que algu&eacute;m ponha suas m&atilde;os 
    no seu disco que cont&eacute;m tanto a sua frase-senha e o arquivo da chave 
    privada. Seria mais seguro se voc&ecirc; simplesmente memorizasse sua frase-senha 
    e a guardasse somente no seu c&eacute;rebro. Se voc&ecirc; acha que deve escrever 
    sua frase-senha , guarde-a bem protegida, talvez ainda mais bem protegida 
    que o arquivo com sua chave privada.</p>
  <p>Guarde c&oacute;pias <i>backup</i> de sua chave privada — lembre-se, voc&ecirc; 
    possui a &uacute;nica c&oacute;pia de sua chave privada, e perd&ecirc;-la 
    tornar&aacute; inutiliz&aacute;vel todas as c&oacute;pias de sua chave p&uacute;blica 
    que voc&ecirc; espalhou pelo mundo.</p>
  <p>A maneira descentralizada e n&atilde;o-institucional que PGP suporta para 
    gerenciamento de chaves p&uacute;blicas tem seus benef&iacute;cios, mas infelizmente 
    isso tamb&eacute;m quer dizer que voc&ecirc; n&atilde;o pode contar com uma 
    &uacute;nica lista centralizada de quais chaves foram comprometidas. Isto 
    torna um pouco mais dif&iacute;cil conter os danos do comprometimento de uma 
    chave privada. Voc&ecirc; simplesmente deve espalhar a not&iacute;cia e esperar 
    que todos a ou&ccedil;am.</p>
  <p>Se o pior caso acontecer — sua chave privada e sua frase-senha estarem comprometidas 
    (esperando que voc&ecirc; descobriu isso de alguma forma) — voc&ecirc; precisar&aacute; 
    emitir um certificado de &quot;revoga&ccedil;&atilde;o de chave&quot;. Este 
    tipo de certificado &eacute; utilizado para avisar &agrave;s outras pessoas 
    que parem de utilizar sua chave p&uacute;blica. Voc&ecirc; pode usar PGP para 
    criar tal certificado, usando o comando &quot;Revoke&quot; (Revogar) do menu 
    de PGPkeys ou pedindo seu &quot;Revogador Designado&quot; para faz&ecirc;-lo 
    por voc&ecirc;. Ent&atilde;o voc&ecirc; deve enviar este certificado para 
    um servidor de certificados, de forma que outros possam ach&aacute;-lo. O 
    pr&oacute;prio PGP destas pessoas instala este certificado de chave revogada 
    em seus chaveiros p&uacute;blicos, e automaticamente evita que eles acidentalmente 
    utilizem sua chave p&uacute;blica novamente. Voc&ecirc; pode ent&atilde;o 
    gerar um novo par de chaves privada/p&uacute;blica e publicar sua nova chave 
    p&uacute;blica. Voc&ecirc; poderia enviar um &quot;pacote&quot; contendo tanto 
    sua nova chave p&uacute;blica quanto seu certificado de revoga&ccedil;&atilde;o 
    de chave para sua chave antiga.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">E se 
  voc&ecirc; perder sua chave privada?</font></b></p>
<blockquote> 
  <p>Normalmente, se voc&ecirc; quisesse revogar sua pr&oacute;pria chave privada, 
    voc&ecirc; poderia usar o comando &quot;Revoke&quot; (Revogar) no menu de 
    PGPkeys para emitir um certificado de revoga&ccedil;&atilde;o, assinado com 
    sua pr&oacute;pria chave privada.</p>
  <p>Mas o que aconteceria se voc&ecirc; perdesse sua chave privada, ou sua chave 
    privada fosse destru&iacute;da? Voc&ecirc; n&atilde;o pode revog&aacute;-la 
    voc&ecirc; mesmo, porque voc&ecirc; deve usar sua pr&oacute;pria chave privada 
    para revog&aacute;-la, e voc&ecirc; n&atilde;o a tem mais. Se voc&ecirc; n&atilde;o 
    possui um revogador designado para sua chave, algu&eacute;m especificado em 
    PGP que pode revogar sua chave sob seu nome, voc&ecirc; dever&aacute; pedir 
    a cada pessoa que assinou sua chave para retirar sua certifica&ccedil;&atilde;o. 
    Ent&atilde;o qualquer um que tente usar sua chave baseado na confian&ccedil;a 
    de um de seus apresentadores saber&aacute; que n&atilde;o deve confiar em 
    sua chave p&uacute;blica.</p>
  <p>Para maiores informa&ccedil;&otilde;es sobre revogadores designados, veja 
    a se&ccedil;&atilde;o <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm#para_apontar_um_revogador_designado">&quot;Para 
    apontar um revogador designado&quot;</a> no <a href="6%20-%20Gerenciando%20Chaves%20e%20Configurando%20Preferencias.htm">Cap&iacute;tulo 
    6</a>.</p>
</blockquote>
<p>&nbsp;</p>
<p><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><b><a name="veneno"></a>Cuidado 
  com veneno de cobra</b></font></p>
<blockquote> 
  <p>Quando se examina um pacote de software criptogr&aacute;fico, fica sempre 
    a d&uacute;vida, por que voc&ecirc; deveria confiar neste produto? Mesmo que 
    voc&ecirc; examinasse o c&oacute;digo fonte voc&ecirc; mesmo, nem todo mundo 
    tem experi&ecirc;ncia criptogr&aacute;fica para julgar a seguran&ccedil;a. 
    Mesmo se voc&ecirc; for um cript&oacute;grafo experiente, falhas impercept&iacute;veis 
    nos algoritmos ainda poderiam engan&aacute;-lo.</p>
  <p>Quando eu estava na faculdade no in&iacute;cio dos anos 70, eu planejei o 
    que acreditava ser um brilhante esquema de codifica&ccedil;&atilde;o. Uma 
    simples cadeia de n&uacute;meros pseudo-aleat&oacute;rios era acrescentada 
    &agrave; uma cadeia de texto puro para criar um texto cifrado. Isto aparentemente 
    impediria qualquer an&aacute;lise de freq&uuml;&ecirc;ncia do texto cifrado, 
    e seria inquebr&aacute;vel at&eacute; mesmo para as melhores ag&ecirc;ncias 
    de intelig&ecirc;ncia do governo. Me senti muito satisfeito com minha fa&ccedil;anha.</p>
  <p>Anos mais tarde, descobri este mesmo esquema em diversos textos introdut&oacute;rios 
    de criptografia e trabalhos educacionais. Que legal. Outros cript&oacute;grafos 
    pensaram no mesmo esquema. Infelizmente, o esquema era apresentado como uma 
    simples atribui&ccedil;&atilde;o de dever de casa sobre como usar t&eacute;cnicas 
    criptoanal&iacute;ticas elementares para trivialmente quebr&aacute;-la. T&atilde;o 
    pouco para meu esquema brilhante.</p>
  <p>Desta humilde experi&ecirc;ncia aprendi como &eacute; f&aacute;cil cair num 
    falso senso de seguran&ccedil;a quando se planeja um algoritmo de codifica&ccedil;&atilde;o. 
    A maioria das pessoas n&atilde;o percebem como &eacute; terrivelmente complicado 
    planejar um algoritmo de codifica&ccedil;&atilde;o que consiga resistir a 
    um ataque prolongado e determinado de um oponente com recursos. Muitos engenheiros 
    de software conceituados desenvolvem esquemas igualmente simples de codifica&ccedil;&atilde;o 
    (muitas vezes at&eacute; os mesmos esquemas de codifica&ccedil;&atilde;o) 
    e alguns destes foram incorporados a pacotes comerciais de software de codifica&ccedil;&atilde;o 
    e vendidos por um bom dinheiro para milhares de usu&aacute;rios inocentes.</p>
  <p>Isto &eacute; como vender cinto de seguran&ccedil;a para autom&oacute;veis 
    que parecem bons e ajeitam-se bem, mas abrem com um estalo no mais lento teste 
    de colis&atilde;o. Depender dele pode ser pior que n&atilde;o usar nenhum 
    cinto. Ningu&eacute;m suspeita que s&atilde;o ruins at&eacute; acontecer uma 
    batida real. E depender de softwares de criptografia fraca pode fazer voc&ecirc; 
    colocar em risco informa&ccedil;&otilde;es confidenciais sem saber, o que 
    por outro lado poderia at&eacute; n&atilde;o acontecer se voc&ecirc; n&atilde;o 
    tivesse um software criptogr&aacute;fico. Talvez voc&ecirc; nunca nem descobriria 
    que seus dados foram comprometidos.</p>
  <p>Algumas vezes pacotes comerciais utilizam o &quot;Federal Data Encryption 
    Standard&quot; (DES, ou Padr&atilde;o Federal de Criptografia de Dados), que 
    &eacute; um bom algoritmo convencional recomendado pelo governo para uso comercial 
    (mas n&atilde;o para informa&ccedil;&otilde;es confidenciais, por estranho 
    que pare&ccedil;a — Hmmm). Existe v&aacute;rios &quot;modos de opera&ccedil;&atilde;o&quot; 
    que DES pode utilizar, alguns deles melhores do que outros. O governo especificamente 
    recomenda n&atilde;o usar o modo mais fraco e simples nas mensagens, o modo 
    &quot;Eletronic Codebook&quot; (ECB). Mas recomendam os modos mais fortes 
    e mais complexos, tais como &quot;Cipher Feedback&quot; (CFB) e &quot;Cipher 
    Block Chaining&quot; (CBC).</p>
  <p>Infelizmente, a maioria dos pacotes comerciais de codifica&ccedil;&atilde;o 
    que observei usam o modo ECB. Quando conversei com os autores de algumas dessas 
    implementa&ccedil;&otilde;es, eles disseram que nunca tinham ouvido falar 
    dos modos CBC ou CFB, e n&atilde;o sabiam de nada sobre as fraquezas do modo 
    ECB. O fato de que eles n&atilde;o sequer aprenderam criptografia o suficiente 
    para conhecer estes conceitos elementares n&atilde;o &eacute; tranq&uuml;ilizador. 
    E eles &agrave;s vezes gerenciam suas chaves DES de forma inapropriada ou 
    insegura. Tamb&eacute;m, estes mesmos pacotes de software muitas vezes incluem 
    um segundo algoritmo de criptografia, mais r&aacute;pido, para ser usado no 
    lugar do lento DES. O autor do pacote geralmente acha que seu algoritmo propriet&aacute;rio 
    mais r&aacute;pido &eacute; t&atilde;o seguro quanto DES, mas depois de question&aacute;-lo 
    geralmente descubro que &eacute; apenas uma varia&ccedil;&atilde;o do meu 
    pr&oacute;prio esquema brilhante da &eacute;poca da faculdade. Ou talvez ele 
    at&eacute; n&atilde;o revelaria como seu esquema de criptografia propriet&aacute;rio 
    funciona, mas me asseguram que &eacute; um esquema brilhante e que eu deveria 
    acreditar nele. Eu tenho certeza de que ele acredita que seu algoritmo &eacute; 
    brilhante, mas como posso saber disto sem v&ecirc;-lo?</p>
  <p>Honestamente, devo destacar que na maioria dos casos estes produtos terrivelmente 
    fracos n&atilde;o v&ecirc;m de companhias que se especializam na tecnologia 
    criptogr&aacute;fica.</p>
  <p>Mesmo os pacotes de software realmente bons, que utilizam DES nos modos corretos 
    de opera&ccedil;&atilde;o, ainda possuem problemas. DES padr&atilde;o usa 
    uma chave de 56 bits, que &eacute; muito pequena para os padr&otilde;es de 
    hoje, e j&aacute; podem ser facilmente quebradas atrav&eacute;s de procuras 
    exaustivas de chaves em m&aacute;quinas especiais de alta velocidade. O DES 
    chegou ao fim de sua vida &uacute;til, como tamb&eacute;m qualquer pacote 
    de software que se baseie nele.</p>
  <p>Existe uma companhia chamada AcessData (http://www.accessdata.com) que vende 
    um pacote de pre&ccedil;o muito baixo que quebra os esquemas internos de criptografia 
    usados pelo WordPerfect, Lotus 1-2-3, MS Excel, Symphony, Quattro Pro, Paradox, 
    MS Word e PKZIP. Ele n&atilde;o faz simples adivinha&ccedil;&otilde;es de 
    senhas — faz verdadeiras criptoan&aacute;lises. Algumas pessoas o compram 
    quando se esquecem de suas senhas para seus pr&oacute;prios arquivos. Ag&ecirc;ncias 
    para cumprimento da lei tamb&eacute;m o compram, assim podem ler os arquivos 
    que conseguirem capturar. Conversei com Eric Thompson, o autor, e ele disse 
    que seu programa leva apenas uma fra&ccedil;&atilde;o de segundo para quebr&aacute;-las, 
    mas ele inseriu alguns &quot;loops&quot; de espera para torn&aacute;-lo mais 
    lento de modo que n&atilde;o pare&ccedil;a t&atilde;o f&aacute;cil para o 
    cliente.</p>
  <p>Na arena da telefonia segura, suas chances parecem desanimadoras. O concorrente 
    l&iacute;der &eacute; o STU-III (de &quot;Secure Telephone Unit&quot;, ou 
    Unidade de Telefone Seguro), feito pela Motorola e AT&amp;T por US$2,000 a 
    US$3,000, e usado pelo governo para aplica&ccedil;&otilde;es confidenciais. 
    Ele possui criptografia forte, mas requer algum tipo de licen&ccedil;a especial 
    do governo para comprar a vers&atilde;o forte. Uma vers&atilde;o comercial 
    do STU-III est&aacute; dispon&iacute;vel, mas enfraquecida para conveni&ecirc;ncia 
    da NSA, e uma vers&atilde;o para exporta&ccedil;&atilde;o est&aacute; dispon&iacute;vel 
    mas ainda mais severamente enfraquecida. Ent&atilde;o houve o AT&amp;T Surity 
    3600, de US$1,200, que usa o famoso chip &quot;Clipper&quot; do governo para 
    codifica&ccedil;&atilde;o, com as chaves em ju&iacute;zo para o governo para 
    conveni&ecirc;ncia dos monitores de chamadas. Ent&atilde;o, &eacute; claro, 
    houve os misturadores de vozes anal&oacute;gicos (n&atilde;o digitais), que 
    voc&ecirc; pode comprar em cat&aacute;logos de &quot;futuros espi&otilde;es&quot;, 
    que s&atilde;o brinquedos realmente in&uacute;teis ao tanto quanto a criptografia 
    est&aacute; envolvida, mas s&atilde;o vendidas como produtos &quot;seguros&quot; 
    de comunica&ccedil;&atilde;o para consumidores que n&atilde;o conhecem nada 
    melhor. </p>
  <p>De certa forma, criptografia &eacute; como farmac&ecirc;utica. Sua integridade 
    pode ser absolutamente crucial. Penicilina ruim se parece como penicilina 
    boa. Voc&ecirc; pode dizer se seu software de planilha estiver errado, mas 
    como dizer se seu pacote de criptografia &eacute; fraco? O texto cifrado produzido 
    por um algoritmo fraco de criptografia parece t&atilde;o bom quanto o texto 
    cifrado produzido por um forte algoritmo de criptografia. H&aacute; um bocado 
    de veneno de cobra l&aacute; fora. Um bocado de curandeiros. Diferentemente 
    dos vendedores ambulantes de rem&eacute;dios do passado, estes implementadores 
    de software geralmente nem sabem que suas coisas s&atilde;o veneno de cobra. 
    Podem ser bons engenheiros de software, mas geralmente nunca leram nada da 
    literatura acad&ecirc;mica sobre criptografia. Mas acham que podem escrever 
    bons softwares criptogr&aacute;ficos. E por que n&atilde;o? No fim das contas, 
    parece intuitivamente f&aacute;cil escrever um. E seus softwares parecem funcionar 
    bem.</p>
  <p>Qualquer um que pensa que planejou um esquema de codifica&ccedil;&atilde;o 
    inquebr&aacute;vel ou &eacute; um g&ecirc;nio inacreditavelmente raro ou &eacute; 
    ing&ecirc;nuo e inexperiente. Infelizmente, eu &agrave;s vezes tenho que lidar 
    com &quot;aprendizes de cript&oacute;grafos&quot; que gostariam de fazer &quot;melhorias&quot; 
    em PGP adicionando algoritmos de codifica&ccedil;&atilde;o que eles pr&oacute;prios 
    projetaram. </p>
  <p>Lembro-me de uma conversa com Brian Snow, um cript&oacute;grafo veterano 
    com influ&ecirc;ncia na NSA. Ele disse que nunca confiaria num algoritmo de 
    codifica&ccedil;&atilde;o planejado por algu&eacute;m que n&atilde;o tivesse 
    &quot;ganhado seus ossos&quot; primeiramente gastando muito tempo quebrando 
    c&oacute;digos. Isto fez muito sentido. Observei que praticamente ningu&eacute;m 
    no mundo comercial de criptografia se qualificava sob este crit&eacute;rio. 
    &quot;Sim&quot;, ele disse com um sorriso confiante, &quot;e isto torna nosso 
    trabalho na NSA bem mais f&aacute;cil&quot;. Um pensamento desanimador. Eu 
    tamb&eacute;m n&atilde;o me qualificaria.</p>
  <p>O governo tamb&eacute;m vendeu veneno de cobra. Depois da Segunda Guerra 
    Mundial, os Estados Unidos venderam m&aacute;quinas alem&atilde;es de codifica&ccedil;&atilde;o 
    &quot;Enigma&quot; para governos do terceiro mundo. Mas n&atilde;o disseram 
    que os aliados quebraram o c&oacute;digo Enigma durante a guerra, um fato 
    que permaneceu confidencial por muitos anos. Mesmo hoje muitos sistemas UNIX 
    em todo o mundo usam a cifra Enigma para codifica&ccedil;&atilde;o de arquivos, 
    em parte porque o governo criou obst&aacute;culos legais contra o uso de algoritmos 
    melhores. Eles at&eacute; tentaram proibir a publica&ccedil;&atilde;o inicial 
    do algoritmo RSA em 1977. E eles por muitos anos esmagaram essencialmente 
    todos os esfor&ccedil;os comerciais para desenvolver telefones efetivamente 
    seguros para o p&uacute;blico em geral.</p>
  <p>O principal trabalho da ag&ecirc;ncia de seguran&ccedil;a nacional (&quot;National 
    Security Agency&quot;, NSA) do governo americano &eacute; agrupar intelig&ecirc;ncia, 
    principalmente grampeando as comunica&ccedil;&otilde;es particulares das pessoas 
    (veja o livro de James Bamford, &quot;The Puzzle Palace&quot;). A NSA acumulou 
    consider&aacute;vel habilidade e recursos na quebra de c&oacute;digos. Quando 
    as pessoas n&atilde;o possuem uma boa criptografia para se protegerem, isto 
    torna o trabalho da NSA bem mais f&aacute;cil. NSA tamb&eacute;m tem a responsabilidade 
    de aprovar e recomendar algoritmos de codifica&ccedil;&atilde;o. Alguns cr&iacute;ticos 
    afirmam que isto &eacute; um conflito de interesses, como colocar a raposa 
    para tomar conta do galinheiro. Nos anos 80, NSA colocou no mercado um algoritmo 
    de criptografia convencional que planejou (o COMSEC Endorsement Program) e 
    nunca revelam a ningu&eacute;m como funciona porque &eacute; considerado confidencial. 
    Ela queria que outros confiassem nele e o usassem. Mas qualquer cript&oacute;grafo 
    pode lhe dizer que um algoritmo de criptografia bem planejado n&atilde;o precisa 
    ser confidencial para permanecer seguro. Somente as chaves precisariam de 
    prote&ccedil;&atilde;o. Como algu&eacute;m poderia realmente saber se o algoritmo 
    confidencial da RSA &eacute; seguro? N&atilde;o &eacute; t&atilde;o dif&iacute;cil 
    para a NSA projetar um algoritmo de criptografia que somente eles poderiam 
    quebrar, se ningu&eacute;m mais pode revisar o algoritmo.</p>
  <p>H&aacute; tr&ecirc;s fatores principais que t&ecirc;m minado a qualidade 
    do software comercial de criptografia nos Estados Unidos.</p>
  <ul>
    <li>O primeiro &eacute; a virtualmente universal falta de compet&ecirc;ncia 
      dos implementadores de software comerciais de codifica&ccedil;&atilde;o 
      (apesar disto estar come&ccedil;ando a mudar desde a publica&ccedil;&atilde;o 
      de PGP). Cada engenheiro de software imagina-se um cript&oacute;grafo, o 
      que causou a prolifera&ccedil;&atilde;o de softwares de criptografia realmente 
      ruins.<br>
      <br>
    </li>
    <li>O segundo &eacute; a NSA deliberadamente e sistematicamente suprimir toda 
      a boa tecnologia comercial de criptografia, atrav&eacute;s de intimida&ccedil;&atilde;o 
      legal e press&atilde;o econ&ocirc;mica. Parte desta press&atilde;o &eacute; 
      sustentada por rigorosos controles de exporta&ccedil;&atilde;o em softwares 
      de codifica&ccedil;&atilde;o que, pela economia do mercado de software, 
      possui o efeito colateral de suprimir softwares dom&eacute;sticos de codifica&ccedil;&atilde;o.<br>
      <br>
    </li>
    <li>O terceiro m&eacute;todo principal de supress&atilde;o v&ecirc;m de garantir 
      todas as patentes de software para todos os algoritmos de codifica&ccedil;&atilde;o 
      por chave p&uacute;blica para uma &uacute;nica companhia, proporcionando 
      um &uacute;nico ponto de estrangulamento para suprimir a difus&atilde;o 
      desta tecnologia (apesar do cartel de patentes de criptografia ter sido 
      quebrado no outono de 1995).</li>
  </ul>
  <p>O efeito colateral de tudo isso &eacute; que antes de PGP ser publicado, 
    n&atilde;o havia praticamente nenhum software de codifica&ccedil;&atilde;o 
    de alta seguran&ccedil;a para prop&oacute;sitos gerais dispon&iacute;vel nos 
    Estados Unidos.</p>
  <p>N&atilde;o estou t&atilde;o certo da seguran&ccedil;a do PGP como certa vez 
    estive com meu brilhante software de criptografia da faculdade. Se estivesse, 
    seria um mau sinal. Mas eu n&atilde;o acho que PGP contenha alguma fraqueza 
    evidente (apesar de estar bem certo de que ele cont&eacute;m <i>bugs</i>). 
    Eu selecionei os melhores algoritmos da literatura publicada da academia criptogr&aacute;fica 
    civil. Na maior parte, estes algoritmos foram individualmente submetidos &agrave; 
    extensas revis&otilde;es. Conhe&ccedil;o muitos dos melhores cript&oacute;grafos 
    do mundo, e tenho discutido com alguns deles v&aacute;rios dos protocolos 
    e algoritmos de criptografia usados em PGP. Ele est&aacute; bem pesquisado, 
    e levou anos para ser feito. E eu n&atilde;o trabalho para a NSA. Mas voc&ecirc; 
    n&atilde;o precisa acreditar na minha palavra sobre a integridade criptogr&aacute;fica 
    de PGP, porque o c&oacute;digo fonte est&aacute; dispon&iacute;vel para facilitar 
    revis&otilde;es.</p>
  <p>Mais um ponto sobre meu compromisso com a qualidade criptogr&aacute;fica 
    em PGP: desde que comecei a desenvolver e lancei PGP gratuitamente em 1991, 
    eu fiquei tr&ecirc;s anos sob investiga&ccedil;&atilde;o criminal pelas Alf&acirc;ndegas 
    dos EUA devido &agrave; difus&atilde;o de PGP pelo mundo, com risco de acusa&ccedil;&atilde;o 
    criminal e anos de pris&atilde;o. Por falar nisso, voc&ecirc; n&atilde;o viu 
    o governo se preocupar com outros softwares criptogr&aacute;ficos — &eacute; 
    PGP que eles atacam. O que isto diz a voc&ecirc; sobre a for&ccedil;a de PGP? 
    Eu ganhei minha reputa&ccedil;&atilde;o de integridade com a integridade criptogr&aacute;fica 
    de meus produtos. Eu n&atilde;o vou trair meu compromisso com nosso direito 
    de privacidade, pelo qual eu arrisquei minha liberdade. Eu n&atilde;o vou 
    permitir que um produto que leve meu nome possua quaisquer &quot;backdoors&quot; 
    secretos.</p>
</blockquote>
<p>&nbsp;</p>
<p><b><font size="6" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="vulnerabilidades"></a>Vulnerabilidades</font></b></p>
<blockquote>
  <p>&quot;<i>Se todos os computadores pessoais no mundo &#151; 260 milh&otilde;es 
    &#151; fossem colocados para trabalhar em uma &uacute;nica mensagem codificada 
    por PGP, ainda levaria um tempo estimado de 12 milh&otilde;es de vezes a idade 
    do universo, em m&eacute;dia, para quebrar uma &uacute;nica mensagem.</i>&quot;<br>
    &#151; William Crowell, Diretor Adjunto, Ag&ecirc;ncia de Seguran&ccedil;a 
    Nacional (&quot;National Security Agency&quot;, NSA), 20 de mar&ccedil;o de 
    1997.</p>
  <p>Nenhum sistema de seguran&ccedil;a &eacute; impenetr&aacute;vel. PGP pode 
    ser enganado de v&aacute;rias formas diferentes. Em qualquer sistema de seguran&ccedil;a, 
    voc&ecirc; precisa se perguntar se a informa&ccedil;&atilde;o que tenta proteger 
    &eacute; mais valiosa para o atacante que o custo do ataque. Isto deveria 
    lev&aacute;-lo a se proteger de ataques de baixo custo, sem se preocupar com 
    ataques mais caros.</p>
  <p>Um pouco da discuss&atilde;o que segue pode parecer um tanto ou quanto paran&oacute;ica, 
    mas tal atitude &eacute; apropriada para uma discuss&atilde;o razo&aacute;vel 
    sobre quesitos de vulnerabilidade.</p>
</blockquote>
<p> <font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><b>Comprometimento 
  da frase-senha e chave privada</b></font></p>
<blockquote>
  <p>Provavelmente a forma mais simples de ataque &eacute; feita se voc&ecirc; 
    deixar a frase-senha para sua chave privada escrita em algum lugar. Se algu&eacute;m 
    a achar e tamb&eacute;m conseguir seu arquivo de chave privada, ele pode ler 
    suas mensagens e fazer assinaturas em seu nome.</p>
  <p>Aqui est&atilde;o algumas recomenda&ccedil;&otilde;es para proteger sua frase-senha:</p>
  <ol>
    <li>N&atilde;o use frases-senhas &oacute;bvias que possam ser facilmente descobertas, 
      como os nomes de seus filhos ou esposa(o). <br>
      <br>
    </li>
    <li>Use espa&ccedil;os e uma combina&ccedil;&atilde;o de n&uacute;meros e 
      letras em sua frase-senha. Se voc&ecirc; fizer de sua frase-senha uma &uacute;nica 
      palavra, ela poder&aacute; ser descoberta fazendo um computador tentar todas 
      as palavras do dicion&aacute;rio at&eacute; encontrar sua senha. &Eacute; 
      por isso que uma frase-senha &eacute; melhor do que uma senha simples. Um 
      atacante mais sofisticado poderia fazer seu computador pesquisar um livro 
      com frases famosas para tentar achar sua frase-senha. <br>
      <br>
    </li>
    <li>Seja criativo. Use uma frase-senha f&aacute;cil de lembrar e dif&iacute;cil 
      de se descobrir; voc&ecirc; poderia facilmente construir uma usando alguns 
      dizeres criativos sem sentido ou cita&ccedil;&otilde;es liter&aacute;rias 
      obscuras.</li>
  </ol>
</blockquote>
<p> <font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><b>Falsifica&ccedil;&atilde;o 
  da chave p&uacute;blica</b></font></p>
<blockquote> 
  <p>Uma maior vulnerabilidade existe se chaves p&uacute;blicas s&atilde;o falsificadas. 
    Esta deve ser a vulnerabilidade mais crucialmente importante em um criptosistema 
    de chave p&uacute;blica, em parte porque a maioria dos novatos n&atilde;o 
    a percebem imediatamente. </p>
  <p>Para sumariar: quando voc&ecirc; usar a chave p&uacute;blica de algu&eacute;m, 
    esteja certo de que n&atilde;o foi falsificada. Uma nova chave p&uacute;blica 
    de algu&eacute;m deve ser confiada apenas se voc&ecirc; a obtiver diretamente 
    de seu propriet&aacute;rio, ou se ela foi assinada por algu&eacute;m em quem 
    voc&ecirc; confia. Certifique-se de que ningu&eacute;m ir&aacute; falsificar 
    sua pr&oacute;pria chave p&uacute;blica. Mantenha controle f&iacute;sico de 
    seus chaveiro p&uacute;blico e sua chave privada, preferivelmente em seu computador 
    pessoal ao inv&eacute;s de um sistema remoto de compartilhamento de tempo. 
    Tenha sempre uma c&oacute;pia <i>backup</i> de ambos os chaveiros.</p>
</blockquote>
<p> <font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><b>Arquivos 
  n&atilde;o apagados completamente do disco</b></font></p>
<blockquote>
  <p>Outro problema potencial &eacute; causado pelo modo que a maioria dos sistemas 
    operacionais apaga arquivos. Quando voc&ecirc; codifica um arquivo e apaga 
    o texto puro original, na verdade o sistema operacional n&atilde;o apaga fisicamente 
    os dados. Ele simplesmente marca aqueles blocos de disco como apagados, permitindo 
    que o espa&ccedil;o seja reutilizado posteriormente. &Eacute; como jogar documentos 
    sens&iacute;veis em papel para uma lixeira recicl&aacute;vel ao inv&eacute;s 
    de um destruidor de pap&eacute;is. Os blocos do disco ainda cont&eacute;m 
    o texto original sens&iacute;vel que voc&ecirc; queria destruir, e ser&atilde;o 
    provavelmente sobrescritos por novos dados em algum ponto no futuro. Se o 
    atacante ler estes blocos de disco apagados logo que eles forem desalojados, 
    ele poderia recuperar seu texto original.</p>
  <p>De fato isto poderia at&eacute; acontecer acidentalmente, se algo der errado 
    com o disco e alguns arquivos foram acidentalmente apagados ou corrompidos. 
    Um programa de recupera&ccedil;&atilde;o de discos podem ser utilizado para 
    recuperar os arquivos danificados, mas isto geralmente significa que alguns 
    arquivos apagados sejam ressuscitados juntos com tudo mais. Seus arquivos 
    confidenciais que voc&ecirc; pensou terem sumidos para sempre poderiam ent&atilde;o 
    reaparecer e serem inspecionado por qualquer um que estiver tentando recuperar 
    seu disco danificado. Mesmo enquanto voc&ecirc; est&aacute; criando a mensagem 
    original com um processador ou editor de textos, o editor pode estar criando 
    v&aacute;rias c&oacute;pias tempor&aacute;rias do seu texto no disco, simplesmente 
    por causa de seus trabalhos internos. Estas c&oacute;pias tempor&aacute;rias 
    de seu texto s&atilde;o apagadas pelo processador de textos quando ele tiver 
    terminado, mas estes fragmentos sens&iacute;veis ainda estar&atilde;o em seu 
    disco em algum lugar.</p>
  <p>A &uacute;nica forma de se prevenir que o texto puro de reaparecer &eacute; 
    de alguma forma fazer com que os arquivos de texto puro apagados sejam sobrescritos. 
    A n&atilde;o ser que voc&ecirc; tenha certeza de que todos os blocos apagados 
    do disco ser&atilde;o brevemente reutilizados, voc&ecirc; deve tomar provid&ecirc;ncias 
    para sobrescrever o arquivo, e tamb&eacute;m quaisquer fragmentos dele no 
    disco deixado por seu processador de textos. Voc&ecirc; pode cuidar de quaisquer 
    fragmentos do texto deixado no disco usando os recursos de Elimina&ccedil;&atilde;o 
    Segura (&quot;Secure Wipe&quot;) e Elimina&ccedil;&atilde;o de Espa&ccedil;o 
    Livre (&quot;Freespace Wipe&quot;) de PGP.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Viroses 
  e Cavalos de Tr&oacute;ia</font></b></p>
<blockquote> 
  <p>Outro ataque poderia envolver um v&iacute;rus ou &quot;verme&quot; hostil 
    para computadores especialmente criado que poderia infectar PGP ou seu sistema 
    operacional. Este v&iacute;rus hipot&eacute;tico poderia ser projetado para 
    capturar sua frase-senha ou chave privada ou decifrar mensagens e para invisivelmente 
    escrever as informa&ccedil;&otilde;es capturadas em um arquivo ou envi&aacute;-los 
    atrav&eacute;s de uma rede para o dono do v&iacute;rus. Ou ele poderia alterar 
    o comportamento de PGP de forma que as assinaturas n&atilde;o sejam checadas 
    corretamente, por exemplo. Este ataque &eacute; mais barato que ataques criptoanal&iacute;ticos.</p>
  <p>A defesa para este tipo de ataque cai na categoria de defesa contra infec&ccedil;&otilde;es 
    de viroses em geral. H&aacute; alguns produtos antiv&iacute;rus moderadamente 
    capazes comercialmente dispon&iacute;veis, e h&aacute; procedimentos higi&ecirc;nicos 
    a serem seguidos que podem grandemente reduzir as chances de uma infec&ccedil;&atilde;o 
    viral. Um tratamento completo de contramedidas anti-v&iacute;rus e anti-vermes 
    est&aacute; al&eacute;m do escopo deste documento. PGP n&atilde;o tem defesas 
    contra v&iacute;rus, e assume que seu pr&oacute;prio computador pessoal &eacute; 
    um ambiente confi&aacute;vel de execu&ccedil;&atilde;o. Se tal tipo de v&iacute;rus 
    ou verme realmente aparecer, espera-se que todos logo tomemos conhecimento.</p>
  <p>Um ataque similar envolve algu&eacute;m criando uma inteligente imita&ccedil;&atilde;o 
    de PGP que comporta-se como PGP na maioria dos aspectos, mas n&atilde;o funcionando 
    da forma esperada. Por exemplo, ele poderia ser deliberadamente avariado para 
    n&atilde;o verificar assinaturas corretamente, permitindo que certificados 
    de chaves falsas fossem aceitas. Esta vers&atilde;o cavalo de tr&oacute;ia 
    de PGP n&atilde;o &eacute; dif&iacute;cil de ser criada por um atacante, porque 
    o c&oacute;digo fonte de PGP est&aacute; amplamente dispon&iacute;vel, portanto 
    qualquer um poderia modificar o c&oacute;digo fonte e produzir uma imita&ccedil;&atilde;o 
    lobotomizada zumbi de PGP que pareceria real mas faz os desejos de seu mestre 
    diab&oacute;lico. Esta vers&atilde;o cavalo de tr&oacute;ia de PGP poderia 
    ent&atilde;o ser amplamente distribu&iacute;da, dizendo-se ser de uma fonte 
    leg&iacute;tima. Que trai&ccedil;oeiro.</p>
  <p>Voc&ecirc; deve fazer um esfor&ccedil;o para obter sua c&oacute;pia de PGP 
    diretamente da Network Associates, Inc.</p>
  <p>H&aacute; outras formas de checar PGP por falsifica&ccedil;&otilde;es, usando 
    assinaturas digitais. Voc&ecirc; poderia usar outra vers&atilde;o confi&aacute;vel 
    de PGP para checar a assinatura de uma vers&atilde;o suspeita de PGP. Mas 
    isto n&atilde;o ajudaria se seu sistema operacional estiver infectado, j&aacute; 
    que n&atilde;o detectaria se sua c&oacute;pia original de pgp.exe foi maliciosamente 
    alterada de tal forma a comprometer sua pr&oacute;pria habilidade de checar 
    assinaturas. Este teste tamb&eacute;m assume que voc&ecirc; possui uma boa 
    c&oacute;pia confi&aacute;vel da chave p&uacute;blica que voc&ecirc; usa para 
    checar a assinatura no execut&aacute;vel de PGP.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><a name="memoria_virtual"></a>Arquivos 
  de troca ou mem&oacute;ria virtual</font></b></p>
<blockquote> 
  <p>PGP foi originalmente desenvolvido para MS-DOS, um sistema operacional primitivo 
    para os padr&otilde;es de hoje. Mas quando foi portado para outros sistemas 
    operacionais mais complexos, como Microsoft Windows e Macintosh OS, uma nova 
    vulnerabilidade emergiu. Esta vulnerabilidade prov&ecirc;m do fato de que 
    este sistemas operacionais modernos usam uma t&eacute;cnica chamada <i>mem&oacute;ria 
    virtual</i>.</p>
  <p>Mem&oacute;ria virtual permite que voc&ecirc; execute programas enormes em 
    seu computador que s&atilde;o maiores que o espa&ccedil;o dispon&iacute;vel 
    nos chips de mem&oacute;ria de semicondutores em seu computador. Isto &eacute; 
    &uacute;til porque software tem se tornado mais e mais &quot;gordo&quot; desde 
    que interfaces gr&aacute;ficas com o usu&aacute;rio tornaram-se norma e usu&aacute;rios 
    come&ccedil;aram a executar diversos programas grandes ao mesmo tempo. O sistema 
    operacional usa o disco r&iacute;gido para armazenar por&ccedil;&otilde;es 
    de seu software que n&atilde;o est&atilde;o sendo usadas em determinado momento. 
    Isto significa que o sistema operacional pode, sem seu conhecimento, escrever 
    no disco algumas coisas que voc&ecirc; pensou que eram mantidas apenas na 
    mem&oacute;ria principal — coisas como chaves, frases-senhas, e textos decifrados. 
    PGP n&atilde;o mant&eacute;m este tipo de dados sens&iacute;veis em algum 
    lugar na mem&oacute;ria al&eacute;m do necess&aacute;rio, mas h&aacute; alguma 
    chance de que o sistema operacional poderia escrev&ecirc;-los em disco de 
    qualquer forma.</p>
  <p>Os dados s&atilde;o escritos em uma &aacute;rea de &quot;notas&quot; no disco, 
    conhecido como um <i>arquivo de troca</i>. Dados s&atilde;o lidos de volta 
    a partir do arquivo de troca quando necess&aacute;rio, de forma que apenas 
    parte de seu programa ou dados estar&atilde;o na mem&oacute;ria f&iacute;sica 
    por vez. Toda esta atividade &eacute; invis&iacute;vel para o usu&aacute;rio, 
    que simplesmente v&ecirc; o disco trepidando. Microsoft Windows faz trocas 
    de peda&ccedil;os de mem&oacute;ria, chamadas &quot;p&aacute;ginas&quot;, 
    usando um algoritmo de troca de p&aacute;ginas do tipo &Uacute;ltimo Recentemente 
    Usado, ou &quot;Least Recently Used&quot; (LRU). Isto significa que p&aacute;ginas 
    que n&atilde;o foram acessadas pelos per&iacute;odos de tempo mais longos 
    s&atilde;o as primeiras a serem colocadas no disco. Este caminho sugere que 
    na maioria dos casos o risco &eacute; bem baixo que dados sens&iacute;veis 
    ser&atilde;o colocados no disco, j&aacute; que PGP n&atilde;o os deixa na 
    mem&oacute;ria por muito tempo. Mas n&atilde;o damos nenhuma garantia.</p>
  <p>Este arquivo de troca pode ser acessado por qualquer um que tiver acesso 
    f&iacute;sico &agrave; seu computador. Se voc&ecirc; estiver preocupado com 
    este problema, voc&ecirc; talvez possa resolv&ecirc;-lo obtendo algum software 
    especial que sobrescreva seu arquivo de troca. Outra cura poss&iacute;vel 
    &eacute; desligar o recurso de mem&oacute;ria virtual de seu sistema operacional. 
    Microsoft Windows permite isto, e tamb&eacute;m Mac OS. Desligar a mem&oacute;ria 
    virtual pode significar que voc&ecirc; precisar&aacute; ter mais chips f&iacute;sicos 
    de mem&oacute;ria RAM instalados de forma a fazer com que tudo caiba na RAM.</p>
</blockquote>
<p><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><b>Falha 
  de seguran&ccedil;a f&iacute;sica</b></font></p>
<blockquote> 
  <p>Uma falha de seguran&ccedil;a f&iacute;sica poderia permitir a algu&eacute;m 
    fisicamente obter seus arquivos de texto ou mensagens impressas. Um oponente 
    determinado poderia obter isto atrav&eacute;s de roubo, vasculhando lixo, 
    procura e captura sem motivo, ou suborno, chantagem ou infiltra&ccedil;&atilde;o 
    entre seu quadro de funcion&aacute;rios. Alguns desses ataques podem ser especialmente 
    pratic&aacute;veis contra organiza&ccedil;&otilde;es pol&iacute;ticas populares 
    que dependem de um quadro de funcion&aacute;rios largamente formado por volunt&aacute;rios.</p>
  <p>N&atilde;o se iluda em uma falsa sensa&ccedil;&atilde;o de seguran&ccedil;a 
    s&oacute; porque voc&ecirc; tem uma ferramenta de criptografia. T&eacute;cnicas 
    criptogr&aacute;ficas protegem dados apenas quando elas est&atilde;o codificadas 
    — viola&ccedil;&otilde;es diretas de seguran&ccedil;a f&iacute;sica ainda 
    podem comprometer dados em textos ou informa&ccedil;&otilde;es escritas ou 
    faladas.</p>
  <p>Este tipo de ataque &eacute; mais barato que ataques criptoanal&iacute;ticos 
    em PGP.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Ataques 
  &quot;Tempest&quot;</font></b></p>
<blockquote>
  <p>Outro tipo de ataque que tem sido utilizada por oponentes bem equipados envolvem 
    a detec&ccedil;&atilde;o remota dos sinais eletromagn&eacute;ticos vindos 
    de seu computador. Este ataque caro e um tanto trabalhoso &eacute; provavelmente 
    ainda mais barato que ataques criptoanal&iacute;ticos diretos. Um caminh&atilde;o 
    ou van apropriadamente suprido das m&aacute;quinas necess&aacute;rias pode 
    estacionar pr&oacute;ximo ao seu escrit&oacute;rio e remotamente capturar 
    todos os seus toques no teclado e mensagens mostradas na tela de v&iacute;deo 
    de seu computador. Isto iria comprometer todas as suas senhas, mensagens etc. 
    Este ataque poderia ser evitado atrav&eacute;s de blindagens apropriadas em 
    todos os seus equipamentos para computador e cabos de rede, de forma a n&atilde;o 
    emitir estes sinais. Esta tecnologia de blindagem, conhecida como &quot;Tempest&quot;, 
    &eacute; usado por algumas ag&ecirc;ncias governamentais e fornecedores de 
    defesas. H&aacute; fabricantes de hardware que fornecem blindagens Tempest 
    comercialmente.</p>
  <p>Algumas novas vers&otilde;es de PGP (ap&oacute;s a vers&atilde;o 6.0) podem 
    exibir textos decifrados usando uma fonte especialmente projetada que pode 
    possuir n&iacute;veis reduzidos de emiss&atilde;o de freq&uuml;&ecirc;ncias 
    de r&aacute;dio a partir da tela de v&iacute;deo de seu computador. Isto pode 
    tornar mais dif&iacute;cil que sinais sejam remotamente detectados. Esta fonte 
    especial est&aacute; dispon&iacute;vel em algumas vers&otilde;es de PGP que 
    suportam o recurso Visualizador Seguro (&quot;Secure Viewer&quot;).</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Protegendo-se 
  contra marcas de hora falsas</font></b></p>
<blockquote> 
  <p>Uma vulnerabilidade um tanto obscura de PGP envolve usu&aacute;rios desonestos 
    criarem marcas de horas (&quot;timestamps&quot;) falsas em seus certificados 
    e assinaturas de chaves p&uacute;blicas. Voc&ecirc; pode saltar esta se&ccedil;&atilde;o 
    se &eacute; um usu&aacute;rio casual e n&atilde;o quer se aprofundar em obscuros 
    protocolos de chaves p&uacute;blicas.</p>
  <p>N&atilde;o h&aacute; nada que impe&ccedil;a um usu&aacute;rio desonesto de 
    alterar a configura&ccedil;&atilde;o de data e hora do rel&oacute;gio de seu 
    pr&oacute;prio sistema, e gerar seus pr&oacute;prios certificados de chave 
    p&uacute;blica e assinaturas que parecem ter sido criadas em uma hora diferente. 
    Ele pode fazer parecer que ele assinou algo mais cedo ou tarde do que realmente 
    fez, ou que seu par de chaves p&uacute;blico/privado foi criado mais cedo 
    ou mais tarde. Isto pode dar algum benef&iacute;cio legal ou financeiro a 
    ele, por exemplo criando algum tipo de evasiva que poderia permitir que ele 
    rejeitasse uma assinatura.</p>
  <p>Creio que este problema de marcas de hora falsificadas em assinaturas digitais 
    n&atilde;o &eacute; pior do que j&aacute; &eacute; em assinaturas feitas &agrave; 
    m&atilde;o. Qualquer um pode escrever qualquer data perto de sua assinatura 
    escrita em um contrato, mas ningu&eacute;m parece estar alarmado sobre este 
    acontecimento. Em alguns casos, uma data &quot;incorreta&quot; em uma assinatura 
    feita &agrave; m&atilde;o pode n&atilde;o estar associada com fraudes reais. 
    A marca de hora tamb&eacute;m pode ser quando o assinante afirma que ele assinou 
    um documento, ou talvez quando ele deseja que sua assinatura entre em efeito.</p>
  <p>Em situa&ccedil;&otilde;es onde &eacute; cr&iacute;tico confiar em uma assinatura 
    com a data atual correta, as pessoas podem simplesmente usar tabeli&atilde;s 
    para testemunhar e datar uma assinatura feita &agrave; m&atilde;o. O an&aacute;logo 
    a isto em assinaturas digitais &eacute; obter uma terceira pessoa confi&aacute;vel 
    para assinar um certificado de assinatura, aplicando uma marca de hora confi&aacute;vel. 
    Nenhum protocolo ex&oacute;tico ou muito formal &eacute; necess&aacute;rio 
    para isso. Assinaturas testemunhadas t&ecirc;m sido por muito tempo reconhecidas 
    como uma forma leg&iacute;tima de determinar quando um documento foi assinado.</p>
  <p>Uma Autoridade de Certifica&ccedil;&atilde;o digna de confian&ccedil;a ou 
    tabeli&atilde;o poderia criar assinaturas autenticadas com uma marca de hora 
    digna de confian&ccedil;a. Isto n&atilde;o necessariamente iria requerer uma 
    autoridade centralizada. Talvez qualquer apresentador confi&aacute;vel ou 
    parte desinteressada poderia exercer esta fun&ccedil;&atilde;o, da mesma forma 
    que tabeli&atilde;s p&uacute;blicos reais fazem hoje. Quando um tabeli&atilde;o 
    assina a assinatura de outras pessoas, ele cria um certificado de assinatura 
    de um certificado de assinatura. Isto serviria como um testemunho para a assinatura 
    da mesma forma que tabeli&atilde;s reais hoje testemunham assinaturas feitas 
    &agrave; m&atilde;o. O tabeli&atilde;o poderia inserir o certificado de assinatura 
    separado (sem todo o documento que foi assinado) em um registro especial controlado 
    pelo tabeli&atilde;o. Qualquer um poderia ler este registro. A assinatura 
    do tabeli&atilde;o teria uma marca de hora confi&aacute;vel, que poderia ter 
    maior credibilidade ou significado legal maior que a marca de hora na assinatura 
    original.</p>
  <p>H&aacute; um bom tratamento sobre este t&oacute;pico no artigo de Denning 
    feito em 1983 para a &quot;IEEE Computer&quot;. Futuras melhorias em PGP poderiam 
    ter recursos para facilmente gerenciar assinaturas reconhecidas de assinaturas, 
    com marcas de hora confi&aacute;veis.</p>
</blockquote>
<p> <font size="4" face="Arial, Helvetica, sans-serif" color="#A00048"><b>Exposi&ccedil;&atilde;o 
  em sistemas multiusu&aacute;rio</b></font></p>
<blockquote>
  <p>PGP foi originalmente projetado para um PC monousu&aacute;rio sob seu controle 
    f&iacute;sico direto. Se voc&ecirc; executa PGP em casa ou em seu pr&oacute;prio 
    PC, seus arquivos codificados geralmente est&atilde;o seguros, a n&atilde;o 
    ser que algu&eacute;m invada sua casa, roube seu PC e o conven&ccedil;a a 
    lhes dar sua frase-senha (ou sua frase-senha &eacute; simples o suficiente 
    para ser descoberta). </p>
  <p>PGP n&atilde;o foi projetado para proteger seus dados enquanto eles est&atilde;o 
    em formato de texto em um sistema comprometido. Nem pode prevenir que um invasor 
    use medidas sofisticadas para ler sua chave privada enquanto ela est&aacute; 
    sendo usada. Voc&ecirc; simplesmente dever&aacute; reconhecer estes riscos 
    em sistemas multiusu&aacute;rios, e ajustar suas expectativas e comportamento 
    de acordo. Talvez sua situa&ccedil;&atilde;o seja tal que voc&ecirc; deve 
    considerar executar PGP apenas em um sistema isolado e monousu&aacute;rio 
    sob seu controle f&iacute;sico direto. </p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">An&aacute;lise 
  de tr&aacute;fico</font></b></p>
<blockquote>
  <p>Mesmo se um atacante n&atilde;o puder ler o conte&uacute;do de suas mensagens 
    codificadas, ele poderia deduzir ao menos algumas informa&ccedil;&otilde;es 
    &uacute;teis observando de onde as mensagem v&ecirc;m e para onde elas v&atilde;o, 
    o tamanho das mensagens, e a hora do dia que s&atilde;o enviadas. Isto &eacute; 
    an&aacute;logo ao atacante olhar para sua conta telef&ocirc;nica de longa 
    dist&acirc;ncia para ver para quem voc&ecirc; ligou e quando e por quanto 
    tempo, mesmo que o conte&uacute;do atual de suas conversas seja desconhecido 
    para o atacante. Isto &eacute; chamado de an&aacute;lise de tr&aacute;fico. 
    PGP por si s&oacute; n&atilde;o protege contra an&aacute;lise de tr&aacute;fico. 
    A solu&ccedil;&atilde;o deste tipo de problema requer protocolos de comunica&ccedil;&atilde;o 
    especializados, projetados para reduzir a exposi&ccedil;&atilde;o &agrave; 
    an&aacute;lise de tr&aacute;fico em seu ambiente de comunica&ccedil;&atilde;o, 
    possivelmente com alguma assist&ecirc;ncia criptogr&aacute;fica.</p>
</blockquote>
<p><b><font size="4" face="Arial, Helvetica, sans-serif" color="#A00048">Criptoan&aacute;lise</font></b></p>
<blockquote> 
  <p>Um ataque criptoanal&iacute;tico caro e formid&aacute;vel poderia possivelmente 
    ser montado por algu&eacute;m com vastos recursos de supercomputadores, como 
    uma ag&ecirc;ncia governamental de intelig&ecirc;ncia. Eles poderiam quebrar 
    sua chave p&uacute;blica usando algum novo m&eacute;todo secreto de quebra 
    de defesas. Mas a academia civil tem intensivamente atacado a criptografia 
    por chave p&uacute;blica sem sucesso desde 1978.</p>
  <p>Talvez o governo possua algum m&eacute;todo confidencial para quebrar os 
    algoritmos de criptografia convencional utilizados em PGP. Isto &eacute; o 
    pior pesadelo de qualquer cript&oacute;grafo. N&atilde;o pode haver nenhuma 
    garantia absoluta de seguran&ccedil;a em implementa&ccedil;&otilde;es criptogr&aacute;ficas 
    pr&aacute;ticas.</p>
  <p>Entretanto, algum otimismo parece justific&aacute;vel. Os algoritmos de chave 
    p&uacute;blica, algoritmos de sum&aacute;rio da mensagem, e cifras de bloco 
    usados em PGP foram projetados por alguns dos melhores cript&oacute;grafos 
    no mundo. Os algoritmos de PGP t&ecirc;m sido extensivamente analisados quanto 
    &agrave; seguran&ccedil;a e revisados por alguns dos melhores criptoanalistas 
    no mundo.</p>
  <p>Al&eacute;m disso, mesmo se as cifras de blocos usadas em PGP possu&iacute;rem 
    alguma pequena fraqueza desconhecida, PGP comprime o texto puro antes de codific&aacute;-lo, 
    o que deve grandemente reduzir essas fraquezas. O gasto computacional para 
    quebr&aacute;-lo seria provavelmente muito mais caro que o valor da mensagem.</p>
  <p>Se sua situa&ccedil;&atilde;o justificar a preocupa&ccedil;&atilde;o com 
    ataques muito formid&aacute;veis deste calibre, ent&atilde;o talvez voc&ecirc; 
    deveria contactar uma consultoria de seguran&ccedil;a de dados para algumas 
    dire&ccedil;&otilde;es sob medida para seguran&ccedil;a de dados espec&iacute;ficas 
    para suas necessidades em particular.</p>
  <p>Em resumo, sem boa prote&ccedil;&atilde;o criptogr&aacute;fica de sua comunica&ccedil;&atilde;o 
    de dados, pode ser praticamente sem esfor&ccedil;o e talvez mesmo rotineiro 
    para um oponente interceptar suas mensagens, especialmente aquelas enviadas 
    atrav&eacute;s de um modem ou sistema de email. Se voc&ecirc; usa PGP e segue 
    precau&ccedil;&otilde;es razo&aacute;veis, o atacante ter&aacute; que gastar 
    muito mais esfor&ccedil;os e dinheiro para violar sua privacidade. </p>
  <p>Se voc&ecirc; se proteger contra os ataques mais simples, e se sente seguro 
    de que sua privacidade n&atilde;o ser&aacute; violada por um atacante determinado 
    e com muitos recursos, ent&atilde;o voc&ecirc; provavelmente estar&aacute; 
    seguro usando PGP. PGP lhe d&aacute; uma privacidade muito boa (no original, 
    &quot;PGP gives you Pretty Good Privacy&quot;).</p>
</blockquote>
<p>&nbsp;</p>
</body>
</html>
