<html>
<head>
<title>Gloss&aacute;rio</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="Author" content="Christian Haagensen Gontijo">
</head>

<body bgcolor="#FFFFFF">
<div align="right"> 
  <table width="96%" border="0" bgcolor="#A00048" cellspacing="10">
    <tr> 
      <td width="90%"><font size="6" color="#FFFFFF" face="Arial, Helvetica, sans-serif"><b> 
        Gloss&aacute;rio</b></font></td>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
<table width="97%" border="0" cellspacing="20" align="center">
  <tr> 
    <td><b>apresentador</b></td>
    <td>Uma pessoa ou organiza&ccedil;&atilde;o a quem &eacute; permitido certificar 
      a autenticidade da chave p&uacute;blica de algu&eacute;m. Voc&ecirc; designa 
      um apresentador assinado a chave p&uacute;blica deste.</td>
  </tr>
  <tr> 
    <td><b>apresentador confi&aacute;vel</b></td>
    <td>Algu&eacute;m que voc&ecirc; confia para lhe prover com chaves que s&atilde;o 
      v&aacute;lidas. Quando um apresentador confi&aacute;vel assina a chave de 
      outra pessoa, voc&ecirc; acredita que as chaves dela s&atilde;o v&aacute;lidas, 
      e voc&ecirc; n&atilde;o precisa verificar suas chaves antes de us&aacute;-las.</td>
  </tr>
  <tr> 
    <td><b>assinar</b></td>
    <td>Aplicar uma assinatura.</td>
  </tr>
  <tr> 
    <td><b>assinatura</b></td>
    <td>Um c&oacute;digo digital criado com uma chave privada. Assinaturas permitem 
      autentica&ccedil;&atilde;o das informa&ccedil;&otilde;es pelo processo de 
      verifica&ccedil;&atilde;o de assinatura. Quando voc&ecirc; assina uma mensagem 
      ou arquivo, o programa PGP usa sua chave privada para criar um c&oacute;digo 
      digital que &eacute; &uacute;nico tanto para o conte&uacute;do da mensagem 
      quanto para sua chave privada. Qualquer um pode usar sua chave p&uacute;blica 
      para verificar sua assinatura.</td>
  </tr>
  <tr> 
    <td><b>assinatura digital</b></td>
    <td>veja &quot;Assinatura&quot;.</td>
  </tr>
  <tr> 
    <td><b>autentica&ccedil;&atilde;o</b></td>
    <td>A determina&ccedil;&atilde;o da origem da informa&ccedil;&atilde;o codificada 
      atrav&eacute;s da verifica&ccedil;&atilde;o da assinatura digital de algu&eacute;m 
      ou da chave p&uacute;blica de algu&eacute;m, checando sua &quot;impress&atilde;o 
      digital&quot; &uacute;nica.</td>
  </tr>
  <tr> 
    <td><b>autoridade de certifica&ccedil;&atilde;o</b></td>
    <td>Uma ou mais pessoas a quem &eacute;/s&atilde;o atribu&iacute;da(s) a responsabilidade 
      de certificar a origem de chaves e adicion&aacute;-las a um banco de dados 
      comum.</td>
  </tr>
  <tr> 
    <td><b>certificar</b></td>
    <td>Assinar a chave p&uacute;blica de outra pessoa.</td>
  </tr>
  <tr> 
    <td><b>chave</b></td>
    <td>Um c&oacute;digo digital usado para codificar e assinar e decifrar e verificar 
      mensagens e arquivos. Chaves v&ecirc;m em pares de chave e s&atilde;o armazenadas 
      em chaveiros.</td>
  </tr>
  <tr> 
    <td><b>chave privada</b></td>
    <td>A parte secreta de um par de chaves, usada para assinar e decifrar informa&ccedil;&otilde;es. 
      A chave privada de um usu&aacute;rio deve ser mantida secreta, conhecida 
      apenas pelo usu&aacute;rio.</td>
  </tr>
  <tr> 
    <td><b>chave p&uacute;blica</b></td>
    <td>Uma das duas chaves em um par de chaves, usada para codificar informa&ccedil;&otilde;es 
      e verificar assinaturas. A chave p&uacute;blica de um usu&aacute;rio pode 
      ser amplamente disseminada para colegas ou estranhos. Conhecer a chave p&uacute;blica 
      de uma pessoa n&atilde;o ajuda ningu&eacute;m a descobrir a chave privada 
      correspondente.</td>
  </tr>
  <tr> 
    <td><b>chaveiro</b></td>
    <td>Um conjunto de chaves. Cada usu&aacute;rio possui dois tipos de chaveiros: 
      um chaveiro privado e um chaveiro p&uacute;blico.</td>
  </tr>
  <tr> 
    <td><b>chaveiro privado</b></td>
    <td>Um conjunto de uma ou mais chaves privadas, todas elas pertencendo ao 
      propriet&aacute;rio do chaveiro privado.</td>
  </tr>
  <tr> 
    <td><b>chaveiro p&uacute;blico</b></td>
    <td>Um conjunto de chaves p&uacute;blicas. Seu chaveiro p&uacute;blico inclui 
      suas pr&oacute;prias chaves p&uacute;blicas.</td>
  </tr>
  <tr> 
    <td><b>codifica&ccedil;&atilde;o</b></td>
    <td>Um m&eacute;todo de misturar informa&ccedil;&atilde;o para torn&aacute;-la 
      ileg&iacute;vel para qualquer um exceto o destinat&aacute;rio intencionado, 
      que deve decifr&aacute;-la para l&ecirc;-la.</td>
  </tr>
  <tr> 
    <td><b>codifica&ccedil;&atilde;o convencional</b></td>
    <td>Codifica&ccedil;&atilde;o que se baseia em uma frase-senha comum ao inv&eacute;s 
      de criptografia por chave p&uacute;blica. O arquivo &eacute; codificado 
      usando uma chave de sess&atilde;o, que codifica usando uma frase-senha que 
      voc&ecirc; deve escolher.</td>
  </tr>
  <tr> 
    <td><b>Compartilhamento Secreto</b></td>
    <td>veja &quot;Divis&atilde;o de Chaves&quot;.</td>
  </tr>
  <tr> 
    <td><b>confi&aacute;vel</b></td>
    <td>Uma chave p&uacute;blica &eacute; dita confi&aacute;vel por voc&ecirc; 
      se ela foi certificada por voc&ecirc; ou por algu&eacute;m que voc&ecirc; 
      designou como um apresentador.</td>
  </tr>
  <tr> 
    <td><b>criptografia por chave p&uacute;blica</b></td>
    <td>Criptografia aonde um par de chaves p&uacute;blico e privado &eacute; 
      usado, e nenhuma seguran&ccedil;a &eacute; necess&aacute;ria no canal em 
      si.</td>
  </tr>
  <tr> 
    <td><b>decifra&ccedil;&atilde;o</b></td>
    <td>Um m&eacute;todo de reajuntar informa&ccedil;&atilde;o codificada de forma 
      a torn&aacute;-la leg&iacute;vel novamente. A chave privada do destinat&aacute;rio 
      &eacute; usada para decifra&ccedil;&atilde;o.</td>
  </tr>
  <tr> 
    <td><b>Divis&atilde;o de chaves ou &quot;compartilhamento secreto&quot;</b></td>
    <td>O processo de dividir uma chave privada em v&aacute;rias partes, e compartilhar 
      estas partes entre um grupo de pessoas. Um n&uacute;mero designado de pessoas 
      deve trazer suas partes da chave e junt&aacute;-las para usar a chave.</td>
  </tr>
  <tr> 
    <td><b>frase-senha</b></td>
    <td>Uma s&eacute;rie de teclas pressionadas que permitem acesso exclusivo 
      &agrave; sua chave privada, que voc&ecirc; usa para assinar e decifrar mensagens 
      de email e anexos de arquivo.</td>
  </tr>
  <tr> 
    <td><b>ID de chave</b></td>
    <td>Um c&oacute;digo leg&iacute;vel que identifica unicamente um par de chaves. 
      Dois pares de chave podem possuir o mesmo ID de usu&aacute;rio, mas ter&atilde;o 
      diferentes IDs de chave.</td>
  </tr>
  <tr> 
    <td><b>ID de usu&aacute;rio</b></td>
    <td>Uma frase de texto que identifica um par de chaves. Por exemplo, um formato 
      comum para o ID de usu&aacute;rio &eacute; o nome do propriet&aacute;rio 
      e seu endere&ccedil;o de email. O ID de usu&aacute;rio ajuda os usu&aacute;rios 
      (tanto o dono quanto colegas) a identificar o propriet&aacute;rio do par 
      de chaves.</td>
  </tr>
  <tr> 
    <td><b>impress&atilde;o digital</b></td>
    <td>Uma cadeia &uacute;nica de n&uacute;meros e caracteres usadas para autenticar 
      chaves p&uacute;blicas. Esta &eacute; a forma prim&aacute;ria de checar 
      pela autenticidade de uma chave. Veja &quot;impress&atilde;o digital de 
      uma chave&quot;.</td>
  </tr>
  <tr> 
    <td><b>impress&atilde;o digital de uma chave</b></td>
    <td>Uma cadeia &uacute;nica de n&uacute;meros e caracteres usados para autenticar 
      chaves p&uacute;blicas. Por exemplo, voc&ecirc; poderia telefonar para o 
      propriet&aacute;rio de uma chave p&uacute;blica e pedir que ele ou ela lesse 
      a impress&atilde;o digital associada com sua chave, de forma que voc&ecirc; 
      pudesse compar&aacute;-la com a impress&atilde;o digital na sua c&oacute;pia 
      da chave p&uacute;blica dele para ver se ambos s&atilde;o iguais. Se a impress&atilde;o 
      digital n&atilde;o for igual, ent&atilde;o voc&ecirc; sabe que possui uma 
      chave falsa.</td>
  </tr>
  <tr> 
    <td><b>ju&iacute;zo de chave</b></td>
    <td>Uma pr&aacute;tica onde um usu&aacute;rio de um sistema de criptografia 
      por chave p&uacute;blica entrega sua chave privada &agrave; uma terceira 
      pessoa, assim permitindo a ela monitorar comunica&ccedil;&otilde;es codificadas.</td>
  </tr>
  <tr> 
    <td><b>meta-apresentador</b></td>
    <td>Um apresentador confi&aacute;vel de apresentadores confi&aacute;veis.</td>
  </tr>
  <tr> 
    <td><b>par de chaves</b></td>
    <td>Uma chave p&uacute;blica e sua chave privada complementar. Em sistemas 
      de criptografia por chave p&uacute;blica, como o programa PGP, cada usu&aacute;rio 
      possui ao menos um par de chaves.</td>
  </tr>
  <tr> 
    <td><b>rede de confian&ccedil;a</b></td>
    <td>Um modelo de confian&ccedil;a distribu&iacute;do usado por PGP para validar 
      a propriedade de uma chave p&uacute;blica onde o n&iacute;vel de confian&ccedil;a 
      &eacute; cumulativo, baseado no conhecimento dos indiv&iacute;duos dos apresentadores.</td>
  </tr>
  <tr> 
    <td><b>subchave</b></td>
    <td>Uma subchave &eacute; uma chave de codifica&ccedil;&atilde;o Diffie-Hellman 
      que &eacute; adicionada como um subconjunto de sua chave mestra. Uma vez 
      que uma subchave &eacute; criada, voc&ecirc; pode expirar ou revog&aacute;-la 
      sem afetar sua chave mestra ou as assinaturas colecionadas nela.</td>
  </tr>
  <tr> 
    <td><b>sum&aacute;rio da mensagem (&quot;message digest&quot;)</b></td>
    <td>Um &quot;destilado&quot; compacto de sua mensagem ou checksum (m&eacute;todo 
      de checagem de erros) de um arquivo. Ele representa sua mensagem, onde se 
      a mensagem for alterada de qualquer forma, um sum&aacute;rio da mensagem 
      diferente seria computado dela.</td>
  </tr>
  <tr> 
    <td><b>texto</b></td>
    <td>Um texto ASCII de 7 bits padr&atilde;o, imprim&iacute;vel.</td>
  </tr>
  <tr> 
    <td><b>Texto ASCII-blindado (ASCII-armored text)</b></td>
    <td>Informa&ccedil;&atilde;o bin&aacute;ria que foi codificada usando um conjunto 
      de caracteres ASCII de 7 bits, padr&atilde;o, e imprim&iacute;vel, para 
      conveni&ecirc;ncia em transportar a informa&ccedil;&atilde;o atrav&eacute;s 
      de sistemas de comunica&ccedil;&atilde;o. No programa PGP, arquivos texto 
      ASCII-blindado possuem a extens&atilde;o padr&atilde;o de nome de arquivos, 
      e s&atilde;o codificados e decodificados usando um formato ASCII radix-64. 
    </td>
  </tr>
  <tr> 
    <td><b>texto cifrado (cyphertext)</b></td>
    <td>Texto puro convertido em um formato secreto atrav&eacute;s do uso de um 
      algoritmo de codifica&ccedil;&atilde;o. Uma chave de codifica&ccedil;&atilde;o 
      pode destravar o texto puro a partir do texto cifrado.</td>
  </tr>
  <tr> 
    <td><b>texto puro</b></td>
    <td>Texto normal, leg&iacute;vel, n&atilde;o codificado e n&atilde;o assinado.</td>
  </tr>
  <tr> 
    <td><b>verifica&ccedil;&atilde;o</b></td>
    <td>O ato de comparar uma assinatura criada com uma chave privada com sua 
      chave p&uacute;blica. A verifica&ccedil;&atilde;o prova que a informa&ccedil;&atilde;o 
      foi realmente enviada pelo assinante, e que a mensagem n&atilde;o foi posteriormente 
      alterada por ningu&eacute;m.</td>
  </tr>
</table>
</body>
</html>
