<HTML>
<head>
<title>PGP = Etwas Wichtiges vorweg</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>
<a href=#vorwort>Vorwort der Herausgeberinnen</a><br>
<a href=#zusammenfassung>Zusammenfassung</a>

<hr>

<a name=vorwort>
<h1>Vorwort der Herausgeberinnen</h1>
</a>
Mit der &Uuml;bersetzung der PGP-Dokumentation ins Deutsche wollen
wir dazu beitragen, da&szlig; auch Menschen, die keine ausreichenden
Englischkenntnisse zum Lesen einer solch komplexen Beschreibung
haben, eine Chance bekommen, Pretty Good Privacy kennenzulernen. Wir
m&ouml;chten mit der Ver&ouml;ffentlichung des vorliegenden deutschen
Handbuches erreichen, da&szlig; dieses hervorragende
Verschl&uuml;sselungsprogramm auch in deutschsprachigen Regionen
nicht nur m&ouml;glichst weit verbreitet, sondern auch angewendet
wird.
<p>
Diese Anleitung hat G&uuml;ltigkeit f&uuml;r fast alle Versionen von PGP,
lediglich die Bedienoberfl&auml;che von MacPGP funktioniert ein wenig anders
als hier beschrieben. Falls sich eine freundliche MacIntosh-Userin findet,
die einen deutschen Einleitungstext geschrieben hat, sind wir aber gerne
dazu bereit, diesen mit aufzunehmen.
<p>
Dies ist eine Vorversion der dritten, aktualisierten und &uuml;berabeiteten
Auflage des Handbuchs. Kommentare senden Sie bitte an <a href
mailto:christopher@nescio.zerberus.de>christopher@nescio.zerberus.de</a>.

<h1>Wir &uuml;ber uns</h1>
Wir, der FoeBuD e.V. in Bielefeld - mit ganzem Namen: Verein zur
F&ouml;rderung des bewegten und unbewegten Datenverkehrs - sind kein
Computerclub im &uuml;blichen Sinne. Bei uns treffen sich nicht nur
Technikinteressierte, sondern Menschen mit unterschiedlichsten
Interessen, die sich in den Bereichen Umwelt, Menschenrechte,
Politik, Wissenschaft, Kunst und Kultur engagieren, M&auml;nner wie
Frauen. Der Verein ist als (vorl&auml;ufig) gemeinn&uuml;tzig anerkannt.
<p>
Die vom FoeBuD betriebene MailBox //BIONIC ist Gr&uuml;ndungsmitglied
in der Arbeitsgemeinschaft Freier MailBoxen e.V. (AGFMB), in deren
Statuten u.a. die Achtung der freien Meinungs&auml;u&szlig;erung, des
Datenschutzes, der Privatsph&auml;re, des Jugendschutzes, der
Menschenw&uuml;rde und der informationellen Selbstbestimmung
verankert sind. Elektronische Post kann mit sehr viel weniger Aufwand
von Unbefugten gelesen - oder auch nur nach bestimmten Stichworten
durchsucht - werden als herk&ouml;mmliche Briefe. Zur Wahrung des
Fernmeldegeheimnisses empfehlen wir deshalb dringend die Verwendung
eines geeigneten Verschl&uuml;sselungsprogrammes, sozusagen als
elektronischen Briefumschlag. PGP ist schnell, hinreichend sicher und
bietet Ihnen die M&ouml;glichkeit, vertrauliche Nachrichten auch mit
Menschen auszutauschen, die sie vorher nicht pers&ouml;nlich
getroffen haben.
<p>
<!-- Hier sollte ein Kommentar zur FUeV und dr Uebernahme des Internets
durch die US-Regierung stehen. xxx -->
Wer mehr &uuml;ber den FoeBuD e.V., die //BIONIC MailBox und unsere
monatliche Veranstaltung PUBLIC DOMAIN wissen m&ouml;chte, findet
dazu Informationen hier:
<ul>
<li> <a href="/index.html">FoeBuD e.V.</a><br>
<li> <a href="/bionic/bionic.html">//BIONIC</a><br>
<li> <a href="/pd/index.html">PUBLIC DOMAIN</a>
</ul>

<p>
Wir w&uuml;nschen Ihnen viel Spa&szlig; beim Lesen der Anleitung und
Erfolg beim Anwenden von Pretty Good Privacy!
<p>
Bielefeld, im November 1994
<p>

<h1>Eine Untersuchung gegen den Autoren des Programms</h1>

Am 14. September 1993 erhielt die Firma LEMCOM Systems (ViaCrypt) aus
Phoenix, Arizona, eine Vorladung des Distriktgerichts von
Nordkalifornien. LEMCOM Systems wurde darin aufgefordert, vor einer
&quot;Grand Jury&quot; eine Zeugenaussage zu machen, und Dokumente
herauszugeben. Philip Zimmermann wurde mitgeteilt, da&szlig; er der
Hauptverd&auml;chtige in einem Ermittlungsverfahren ist, das vom
US-Zollamt in San Jose durchgef&uuml;hrt wird. Diese Tatsache hat in der
Internet-Gemeinde sowohl innerhalb als auch au&szlig;erhalb der USA eine
Welle der Emp&ouml;rung ausgel&ouml;st; Philip Zimmermanns Hauptanwalt hat ein
Spendenkonto betrieben, um die Kosten des Prozesses finanzieren zu
k&ouml;nnen - auf diesem Konto sind Spenden in sechsstelliger <!-- ? -->
H&ouml;he eingegangen.
<p>
Das Verfahren ist inzwischen eingestellt.
<!-- Hier kommt der Brief, den Philip erhalten hat -->
<p>
W&auml;re es zu einem Proze&szlig; gekommen, w&auml;re dies einer der wichtigsten
Prozesse gewesen, die in letzter Zeit um Kryptographie, um den
effizienten Schutz des Briefgeheimnisses und um den freien Flu&szlig;
von Informationen und Ideen im Globalen Dorf nach Ende des kalten
Krieges gef&uuml;hrt wurden. Exportbeschr&auml;nkungen m&uuml;ssen
daf&uuml;r herhalten, die Verf&uuml;gbarkeit von effektiver
kryptographischer Technologie zu beschneiden: Der Zoll vertritt die
Auffassung, da&szlig; die Ver&ouml;ffentlichung eines
kryptographischen Programms im Internet mit seinem Export
gleichzusetzen ist. Philip hat als erster keine Risiken und
M&uuml;hen gescheut, wirklich effektive Werkzeuge zu entwickeln, die
unserer Kommunikation den Schutz vor neugierigen Augen geben, und das
in einer politischen Situation, in der dieser Schutz immer
gr&ouml;&szlig;eren Anfeindungen ausgesetzt ist, in einer Situation,
in der die US-Regierung mit dem Clipper-Chip und Gesetzentw&uuml;rfen
zum digitalen Telefon auf unsere Sorgen und Bef&uuml;rchtungen
antwortet.
<p>
 (Der Clipper Chip dient der Verschl&uuml;sselung von Daten und
Telefongespr&auml;chen. Er ist so konstruiert, da&szlig;
Regierungsbeh&ouml;rden in der Lage sind, alle
clipper-verschl&uuml;sselten Daten zu entschl&uuml;sseln. Eines der
Hauptprobleme dabei ist, da&szlig; dies leider auch bedeutet, da&szlig; jede
Organisation, die bereit ist, genug Geld zur Bestechung auszugeben,
ebenfalls dazu in der Lage ist. Ganz abgesehen von den in &quot;1984&quot;
angedeuteten Folgen.)

<a name=zusammenfassung>
<h1>Zusammenfassung</h1>
</a>

PGP verwendet ein System mit &ouml;ffentlichen Schl&uuml;sseln
f&uuml;r die Verschl&uuml;sselung von E-Mail und von Dateien. Es
erm&ouml;glicht eine sichere Kommunikation zwischen Personen, die
sich nie direkt getroffen haben m&uuml;ssen. Ein abh&ouml;rsicherer
Kanal f&uuml;r den Austausch eines Schl&uuml;ssels ist nicht
erforderlich. PGP bietet viele M&ouml;glichkeiten und ist schnell. Es
hat eine ausgefeilte Schl&uuml;sselverwaltung, bietet digitale
Unterschriften, komprimiert die unverschl&uuml;sselten Daten und hat
eine ergonomische Oberfl&auml;che.
<p>
Informationen zur Lizensierung von PGP, Distribution, Copyrights,
Warenzeichen, Gew&auml;hrleistungen und Exportbeschr&auml;nkungen
enth&auml;lt der Abschnitt <a href=pgp.2.5.html>Rechtsfragen</a>.

<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi"--> auf diese Seite.


<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>
1996-03-06</address>
</BODY>
</HTML>

