<HTML>
<head>
<title>PGP = Schwachstellen</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#placebos>Vertrauen in Placebos und Wundermedikamente?</a><br>

<hr>

Es gibt keine Sicherheit ohne Schwachstellen. Auch PGP ist davon
nicht ausgenommen und bietet einige Ansatzpunkte, wie der Schutz
umgangen werden k&ouml;nnte. Die wichtigsten, an die Sie immer denken
sollten: Ihr privater Schl&uuml;ssel und/oder Ihr geheimes Mantra
werden bekannt; jemand verf&auml;lscht &ouml;ffentliche
Schl&uuml;ssel; Sie l&ouml;schen Ihre Dateien nicht gr&uuml;ndlich
genug; Viren und Trojanische Pferde, unbefugter Zugriff auf Ihren
Rechner, elektromagnetische Ausstrahlungen, Angriffe anderer Nutzer
auf Multi-User-Systemen, &Uuml;berwachung ihres Datenverkehrs und
eventuell auch Kryptoanalyse.
<p>
F&uuml;r eine weitergehende Diskussion ziehen Sie bitte den Abschnitt
<a href=pgp.2.4.html>Angriffsm&ouml;glichkeiten</a>
in Teil II des PGP-Handbuches zu Rate.

<a name=placebos>
<h1>Vertrauen in Placebos und Wundermedikamente?</h1>
</a>

Wenn wir ein Verschl&uuml;sselungsprogramm betrachten, stellt sich
die Frage: Warum sollte ich diesem Produkt vertrauen? Auch den
Quelltext zu untersuchen hilft nicht viel weiter, denn die meisten
Menschen kennen sich in den Grundlagen der Kryptographie nicht genug
aus, um die Sicherheit zu beurteilen. Und selbst wenn, k&ouml;nnen
sie immer noch nicht sicher sein, da&szlig; keine Hintert&uuml;r
eingebaut ist, die sie eventuell &uuml;bersehen.
<p>
In meiner Zeit am College durfte ich eine in dieser Richtung
niederschmetternde Erfahrung machen: Ich erfand ein meiner Meinung
nach geniales Verschl&uuml;sselungssystem. Es funktionierte so,
da&szlig; ein Zufallszahlengenerator Zahlen ausspuckte, die zu den zu
verschl&uuml;sselnden Zeichen addiert wurden. Somit w&auml;re eine
H&auml;ufigkeitsanalyse des entstehenden Textes ausgeschlossen, was
ein Knacken des Codes unm&ouml;glich machen sollte. Einige Jahre
sp&auml;ter entdeckte ich eben dieses Schema in einigen
Einf&uuml;hrungswerken zur Kryptographie. Die Freude wurde jedoch
schnell getr&uuml;bt, als ich erkannte, da&szlig; es dort als
Beispiel f&uuml;r einen leicht knackbaren Code verwendet wurde.
Soviel zu diesem Algorithmus.
<p>
Dieses Beispiel zeigt, wie leicht es ist, einer tr&uuml;gerischen
Sicherheit zu verfallen, wenn es um einen neuen
Verschl&uuml;sselungsalgorithmus geht. Auch wenn es die meisten
Menschen nicht direkt nachvollziehen k&ouml;nnen, ist es extrem
schwer, ein Schema zur Verschl&uuml;sselung zu entwickeln, das einem
ernstgemeinten und mit entsprechendem Hintergrund durchgef&uuml;hrten
Angriff standh&auml;lt. Auch viele kommerzielle Produkte bieten -
aufgrund der verwendeten Rechenvorschriften - keine ernstzunehmende
Sicherheit. Gerade in punkto Sicherheit wird sehr viel minderwertige
Ware verkauft.
<p>
Stellen Sie sich vor, Sie kaufen ein neues Auto, und eine Woche
sp&auml;ter sehen Sie die Aufzeichnung eines Crash-Tests, in dem die
wundersch&ouml;nen Sicherheitsgurte einfach rei&szlig;en. Da kann es
besser sein, gar keine Sicherheitsgurte zu haben, da Sie sich
ansonsten in falscher Sicherheit wiegen. Dasselbe gilt f&uuml;r
Software - wenn Sie sich auf schlechte Software verlassen, um die
Vertraulichkeit Ihrer Daten zu gew&auml;hrleisten, k&ouml;nnen Sie
eine extrem b&ouml;se &Uuml;berraschung erleben. Oder - noch
schlimmer - eventuell bemerken Sie nicht einmal, da&szlig; Ihre Daten
von Unbefugten gelesen wurden, bis es zu sp&auml;t ist.
<p>
Aber auch die Verwendung bew&auml;hrter Algorithmen mu&szlig; keine
Sicherheit bieten, wenn sie nicht konsequent eingesetzt werden. So
empfiehlt beispielsweise die Regierung der USA die Verwendung des
Federal Data Encryption Standard, DES. Zumindest f&uuml;r
kommerzielle Anwendungen - Informationen unter staatlicher
Geheimhaltung d&uuml;rfen damit nicht verschl&uuml;sselt werden. Aber
das ist ein anderes Thema. Bei DES gibt es verschiedene Stufen von
Sicherheit. Die schw&auml;chste, von der die Regierung abr&auml;t,
ist die sogenannte ECB-Verschl&uuml;sselung (Electronic Codebook).
Besser sind Cipher Feedback (CFB) oder auch Cipher Block Chaining
(CBC).
<p>
Leider verwenden die meisten kommerziellen Produkte, die auf DES
basieren, die ECB-Methode. In Gespr&auml;chen, die ich mit einigen
Autoren solcher Software f&uuml;hrte, stellte sich heraus, da&szlig;
sie nie etwas von CBC oder CFB geh&ouml;rt haben, nicht einmal von
m&ouml;glichen Schwachstellen des ECB. Dabei sind die Programme, auf
die Sie sich am wenigsten verlassen sollten, immer noch die, bei
denen der Programmierer verschweigt, wie die Verschl&uuml;sselung
funktioniert. Um fair zu bleiben, mu&szlig; ich aber betonen,
da&szlig; diese Produkte normalerweise nicht von Firmen kommen, die
sich auf Kryptographie spezialisiert haben.
<p>
Und falls Sie jetzt immer noch der eingebauten Verschl&uuml;sselung
von WordPerfect, Lotus 1-2-3, MS Excel, Symphony, Quattro Pro,
Paradox oder MS Word vertrauen - wenden Sie sich an die Firma
AccessData (87 East 600 South, Orem, Utah 84058, USA), dort
k&ouml;nnen Sie f&uuml;r 158 Dollar ein Softwarepaket erhalten, das
ebendiese Systeme entschl&uuml;sselt.(*) Gekauft wird dieses Programm
von Leuten, die ihr Passwort vergessen haben, und von
Strafverfolgungsbeh&ouml;rden. Der Autor des Programms, Eric
Thompson, sagte &uuml;brigens, er habe einige
Verz&ouml;gerungsschleifen eingebaut, damit das Knacken des
Passwortes nicht so einfach aussieht wie es ist. Auch die
PKZIP-Verschl&uuml;sselung ist seiner Aussage nach einfach zu umgehen.
<p>
<hr><i>
 (*)Derartige Programme sind beispielsweise <a
href=ftp://ftp.uni-paderborn.de/pub/SimTel/>hier</a> zu finden. d.&Uuml;.
<p>
</i><hr>
Verschl&uuml;sselungssoftware l&auml;&szlig;t sich mit Medikamenten
vergleichen. In beiden F&auml;llen kann die Wirksamkeit von
gr&ouml;&szlig;ter Bedeutung sein. Ebenso wie Penizillin sieht man es
einer Verschl&uuml;sselungssoftware nicht an, ob sie gut arbeitet.
Jeder kann feststellen, ob sein Textverarbeitungssystem gute Arbeit
leistet, aber woran erkennt der durchschnittliche Anwender, ob seine
kryptographische Software gut verschl&uuml;sselte Dateien liefert?
Ein Laie kann den Unterschied zwischen schlecht oder gut
verschl&uuml;sselten Daten nicht erkennen. Deshalb gibt es auch so
eine Vielzahl schlechter Verschl&uuml;sselungsprogramme, von denen
die meisten Programmierer nicht einmal wissen, wie schlecht ihr
eigenes Produkt ist.
<p>
Bei Verschl&uuml;sselungsprogrammen gibt es viel Kurpfuscherei. Aber
im Gegensatz zu den Leuten, die Patentmedizin verh&ouml;kern, wissen
die meisten Programmierer nicht einmal, da&szlig; sie Quacksalberei
betreiben. Diese Programmierer sind meistens dennoch f&auml;hige
Leute, aber die wenigsten haben auch nur ein einziges
wissenschaftliches Buch &uuml;ber Kryptographie gelesen. Trotzdem
glauben sie, sie k&ouml;nnten gute Verschl&uuml;sselungsprogramme
schreiben. Und warum auch nicht? Verschl&uuml;sselung scheint
zun&auml;chst einmal einfach implementierbar zu sein. Und die
Programme scheinen auch ganz ordentlich zu arbeiten.
<p>
Jeder, der glaubt, er habe ein unknackbares
Verschl&uuml;sselungsverfahren entwickelt, ist entweder ein
unglaublich seltenes Genie, oder er ist naiv und unerfahren.
<p>
Brian Snow, ein hochrangiger Kryptograph der NSA, sagte mir einmal,
er w&uuml;rde keinem Verschl&uuml;sselungsalgorithmus &uuml;ber den
Weg trauen, der von jemandem entwickelt sei, der nicht sehr viel
Erfahrung mit dem Knacken von Verschl&uuml;sselungen hat. Eine
durchaus sinnvolle Einstellung. Im Bereich der kommerziellen
Softwareentwicklung kenne ich fast niemanden, auf den dieses
Kriterium zutrifft. Snow sieht das &auml;hnlich: &quot;Und das macht
unseren Job bei der NSA um einiges einfacher.&quot; Gruselige
Vorstellung.
<p>
Auch die US-Regierung hat Wundermedizin verbreitet. Nach dem zweiten
Weltkrieg verkaufte sie beispielsweise Enigma-Maschinen an
Regierungen von Entwicklungsl&auml;ndern, ohne diesen zu sagen,
da&szlig; die Verschl&uuml;sselung w&auml;hrend des Krieges von den
Briten geknackt worden war.
<p>
&Uuml;brigens wird der Enigma-Algorithmus auch heute noch bei vielen
Unix-Systemen auf der ganzen Welt f&uuml;r die Verschl&uuml;sselung
von Dateien verwendet, unter anderem deswegen, weil die US-Regierung
der Verwendung besserer Algorithmen gesetzliche Schranken gesetzt
hat. Die US-Regierung hat 1977 sogar versucht, die
Ver&ouml;ffentlichung des RSA-Algorithmus zu verhindern. Auch die
Entwicklung abh&ouml;rsicherer Telefontechnik f&uuml;r die
Allgemeinheit hat sie verhindert.
<p>
In j&uuml;ngster Zeit macht Clipper die Runde, ein Verfahren, das
Standard f&uuml;r die Verschl&uuml;sselung von Telefongespr&auml;chen
werden soll - aber unter staatlicher Kontrolle. Der Staat w&auml;re
in der Lage, alle damit verschl&uuml;sselten Gespr&auml;che,
E-Mail-Kontakte und Dateien zu lesen.
<p>
Die Hauptaufgabe der NSA ist Aufkl&auml;rung, haupts&auml;chlich
durch das Abh&ouml;ren und Mitlesen von privater Kommunikation (siehe
hierzu James Bamford, The Puzzle Palace 
(<a href=pgp.2.6.html#Literatur>Literaturverzeichnis hier</a>).
Die NSA hat Unmengen an Wissen und Technik f&uuml;r das Knacken von
Verschl&uuml;sselungen angesammelt. Wenn die Allgemeinheit auch noch
keinen Zugang zu guter Chiffriertechnik hat, wird die Arbeit der NSA
um einiges vereinfacht. Zugleich hat die NSA aber auch die Aufgabe,
Verschl&uuml;sselungsalgorithmen zu beurteilen und zu empfehlen. Hier
wird der Bock zum G&auml;rtner gemacht. Die NSA hat die Verwendung
eines vor ihr entworfenen Verschl&uuml;sselungsalgorithmus empfohlen,
aber ohne seine Funktionsweise offenzulegen - weil das geheim bleiben
m&uuml;sse. Wir sollen einfach so glauben, da&szlig; der Algorithmus
gut ist und ihn verwenden. Dabei wei&szlig; jeder Kryptograph,
da&szlig; ein gut durchdachtes Verschl&uuml;sselungsverfahren in
seinen technischen Details nicht geheim bleiben mu&szlig;, um sicher
zu sein. Nur die konkreten Schl&uuml;ssel m&uuml;ssen geheimgehalten
werden. Kann irgendwer mit Sicherheit sagen, da&szlig; ein von der
NSA entwickeltes Verfahren wirklich sicher ist? Schwer ist es
f&uuml;r die NSA nicht, ein Verschl&uuml;sselungsverfahren zu
entwickeln, das sie allein knacken k&ouml;nnen, wenn sie niemandem
sonst seine Funktionsweise offenlegen. Vielleicht betreibt die NSA
auch absichtlich Quacksalberei.
<p>
Ich bin von der Sicherheit von PGP nicht so &uuml;berzeugt, wie
w&auml;hrend meines Studiums von der Sicherheit meines
&quot;genialen&quot; Verschl&uuml;sselungsverfahrens. W&auml;re ich
von PGP vollkommen &uuml;berzeugt, w&auml;re das ein schlechtes
Zeichen. Aber ich bin ziemlich sicher, da&szlig; PGP keine ins Auge
springenden Schwachstellen hat. Die Algorithmen, die PGP verwendet,
stammen von zivilen Kryptographen mit sehr gutem Ruf, und sie sind
eingehend untersucht worden. Selbstverst&auml;ndlich ist der
komplette Sourcecode erh&auml;ltlich, so da&szlig; jeder, der
programmieren kann (oder einen vertrauensw&uuml;rdigen Bekannten hat,
der dazu in der Lage ist), das System durchleuchten kann. Der
Quellcode ist &uuml;ber Jahre professionell entwickelt worden. Im
&uuml;brigen arbeite ich nicht f&uuml;r die NSA. Ich hoffe, da&szlig;
der Schritt, Vertrauen in PGP zu gewinnen, nicht zu viel
&Uuml;berwindung kostet.



<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.


<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
