<HTML>
<head>
<title>PGP = PGP f&uuml;r Fortgeschrittene</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#[Radix]>Versand von Nachrichten im Radix-64-Format</a><br>
<a href=#PGPPATH>Die Umgebungsvariable f&uuml;r das PGP-Verzeichnis:
<kbd>PGPPATH</kbd></a><br>
<a href=#config.txt>Konfigurierbare Parameter: <kbd>config.txt</kbd> bzw.
<kbd>pgp.config</kbd></a>

<hr>

Das meiste zu diesem Thema steht in Teil II dieses Handbuchs.
Die folgenden Punkte sind
aber wichtig genug, um schon hier angesprochen zu werden.
<p>
<h1><a name=[Radix]>Versand von Nachrichten im Radix-64-Format</a></h1>
<p>
In vielen E-Mail-Systemen ist nur der Versand von ASCII-Text
m&ouml;glich. Bin&auml;rdaten, wie die von PGP normalerweise
erzeugten verschl&uuml;sselten Dateien, k&ouml;nnen dann nicht
versandt werden. PGP kann deshalb bei Bedarf die verschl&uuml;sselten
Daten im Radix-64-Format darstellen, &auml;hnlich dem
Privacy-Enhanced-Mail-Format (PEM) im Internet. Radix-64 stellt
bin&auml;re Daten ausschlie&szlig;lich unter Verwendung druckbarer
6-Bit-ASCII-Zeichen dar, so da&szlig; eine verschl&uuml;sselte
Nachricht wie gew&ouml;hnlicher E-Mail-Text verschickt werden kann.
Radix-64 ist also eine Art &quot;Transport-Verpackung&quot;, die
Schutz vor einer Verst&uuml;mmelung der Nachricht auf dem
Transportweg bietet. Um &Uuml;bertragungsfehler erkennen zu
k&ouml;nnen, wird der Radix-64-Darstellung eine CRC-Summe 
hinzugef&uuml;gt.
<p>
Im Radix-64-Format werden jeweils drei Byte durch vier druckbare
ASCII-Zeichen dargestellt, so da&szlig; die L&auml;nge der Datei um
etwa 33 Prozent zunimmt. Das sieht zun&auml;chst nach einer ziemlich
gro&szlig;en Aufbl&auml;hung der Datei aus, ber&uuml;cksichtigt
werden mu&szlig; aber, da&szlig; PGP Klartextdateien h&auml;ufig um
einen gr&ouml;&szlig;eren Faktor komprimiert, bevor sie
verschl&uuml;sselt werden.
<p>
F&uuml;r eine Radix-64-Darstellung der verschl&uuml;sselten Datei
wird einfach die Option <kbd>a</kbd> beim Programmaufruf
hinzugef&uuml;gt:
<p>
<kbd>
pgp -esa brief.txt Benutzer-ID
</kbd>

<p>
Hier wird <kbd>brief.txt</kbd> unterschrieben, komprimiert,
verschl&uuml;sselt und das Ergebnis im Radix-64-Format in eine Datei
mit dem Namen <kbd>brief.asc</kbd> geschrieben. Diese Datei kann wie
gew&ouml;hnliche E-Mail im Internet oder jedem anderen
E-Mail-Netzwerk verschickt werden. Die Entschl&uuml;sselung einer so
verschickten Nachricht unterscheidet sich nicht von der
Entschl&uuml;sselung einer <kbd>.pgp</kbd>-Datei:
<p>
<kbd>
pgp brief
</kbd>

<p>
PGP sucht hier zuerst nach einer Datei namens <kbd>brief.asc</kbd>
und erst danach nach <kbd>brief.pgp</kbd>. PGP erkennt automatisch,
da&szlig; <kbd>brief.asc</kbd> vor der eigentlichen
Entschl&uuml;sselung erst wieder zur&uuml;ck in Bin&auml;rdarstellung
umgewandelt werden mu&szlig;.
<p>
Im Internet ist der Versand von Nachrichten mit mehr als 50000 Byte
normalerweise nicht m&ouml;glich. L&auml;ngere Texte m&uuml;ssen in
mehrere Teile gesplittet werden, die einzeln verschickt werden. Wenn
beim Verschl&uuml;sseln die Option f&uuml;r Darstellung im Radix-64
Format angegeben wurde, schreibt PGP bei einem langen Text die
verschl&uuml;sselten Daten in mehrere Dateien, deren Namen auf
<kbd>.as1</kbd>, <kbd>.as2</kbd>, <kbd>.as3</kbd> usw. enden. Das PGP
der Empf&auml;ngerin f&uuml;gt diese automatisch wieder zusammen,
wobei beim Aufruf von PGP einfach die erste Datei angegeben wird. Bei
der Entschl&uuml;sselung ignoriert PGP allen Text aus den
Nachrichtenk&ouml;pfen, der nicht zu den Radix-64-Bl&ouml;cken
geh&ouml;rt.
<p>
M&ouml;chte man einen &ouml;ffentlichen Schl&uuml;ssel im
Radix-64-Format verschicken, kann die Option <kbd>a</kbd> auch beim
Befehl f&uuml;r das Extrahieren des Schl&uuml;ssels aus der Datei mit
&ouml;ffentlichen Schl&uuml;sseln angegeben werden.(*)

<hr><i>
 (*)Befehl <kbd>pgp -kxa</kbd> d.&Uuml;.
</i><hr>
Hat man vergessen, die Option <kbd>a</kbd> beim Verschl&uuml;sseln
einer Nachricht oder beim Extrahieren eines Schl&uuml;ssels
anzugeben, kann man die Bin&auml;rdatei auch nachtr&auml;glich in das
Radix-64-Format umwandeln, indem man PGP nur mit der Option
<kbd>-a</kbd> aufruft, ohne Angabe der Option f&uuml;r
Verschl&uuml;sseln oder Unterschreiben:
<p>
<kbd>
pgp -a brief.pgp
</kbd>

<p>
<blockquote><i>
<p>
Um keine Mi&szlig;verst&auml;ndnisse aufkommen zu
lassen: Dieses &quot;Nacharbeiten&quot; <em>mu&szlig;</em> mit der
bereits verschl&uuml;sselten Datei erfolgen, also mit
<kbd>brief.pgp</kbd> in obigem Beispiel. <em>Falsch</em> w&auml;re
die folgende Befehlskombination:
</i>
<pre><kbd>
pgp -es brief.txt Benutzer-ID
pgp -a brief.txt
</kbd></pre>

<i>
Der erste Befehl erzeugt eine verschl&uuml;sselte
Datei <kbd>brief.pgp</kbd>; der zweite Befehl erzeugt eine Datei
<kbd>brief.asc</kbd> im Radix-64-Format, jedoch aus der Klartextdatei
<kbd>brief.txt</kbd>. Da&szlig; <kbd>brief.asc</kbd> nicht
unmittelbar &quot;f&uuml;r das menschliche Auge lesbar&quot; ist,
bedeutet nicht, da&szlig; die Datei verschl&uuml;sselt ist!<p>

</i></blockquote>

<p>
Wenn man eine Datei versenden m&ouml;chte, die zwar unterschrieben,
aber nicht verschl&uuml;sselt ist, komprimiert PGP normalerweise alle
Daten und wandelt sie anschlie&szlig;end gegebenenfalls in das
Radix-64-Format. Handelt es sich bei den Daten um einen Text, ist er
folglich nicht unmittelbar lesbar. Soll der Text jedoch lesbar
bleiben, bietet PGP die M&ouml;glichkeit, nur die Unterschrift im
Radix-64-Format an den Text anzuf&uuml;gen. Empf&auml;ngerinnen einer
solcher Nachricht brauchen also PGP nicht aufzurufen, um den Text zu
lesen. PGP ist hier nur f&uuml;r eine Kontrolle der Unterschrift
erforderlich. N&auml;heres hierzu steht im zweiten Teil des Handbuchs
bei der Erl&auml;uterung des Parameters <kbd>CLEARSIG</kbd> im
Kapitel <a href=pgp.2.2.html#[Clearsig]>config.txt</a>.
<p>
<h1><a name=PGPPATH>Die Umgebungsvariable f&uuml;r das PGP-Verzeichnis:
<kbd>PGPPATH</kbd></a></h1>
<p>
PGP ben&ouml;tigt beim Ver- und Entschl&uuml;sseln mehrere Dateien,
unter anderem die beiden Dateien <kbd>pubring.pgp</kbd> und
<kbd>secring.pgp</kbd> mit &ouml;ffentlichen und geheimen
Schl&uuml;sseln, <kbd>randseed.bin</kbd> (enth&auml;lt die Parameter
f&uuml;r den Zufallszahlengenerator), <kbd>config.txt</kbd>
(Konfigurationsdatei) und <kbd>language.txt</kbd> (enth&auml;lt die
Textmeldungen von PGP, unter Umst&auml;nden in mehreren Sprachen).
Diese Dateien k&ouml;nnen (und sollten) in einem eigenen Verzeichnis
stehen, beispielsweise <kbd>c:\pgp</kbd>. Damit PGP diese Dateien
auch dann findet, wenn es aus einem beliebigen anderen Verzeichnis
aufgerufen wird, mu&szlig; die Umgebungsvariable <kbd>PGPPATH</kbd>
auf das Verzeichnis mit den PGP-Dateien gesetzt werden. Unter MS-DOS
geschieht das mit dem Befehl:
<p>
<kbd>
SET PGPPATH=C:\PGP
</kbd>

<p>
Wenn <kbd>PGPPATH</kbd> so gesetzt ist, benutzt PGP die Datei
<kbd>c:\pgp\pubring.pgp</kbd> als Datei mit den &ouml;ffentlichen
Schl&uuml;sseln (vorausgesetzt, Verzeichnis und Datei existieren).
Mit einem geeigneten Editor kann unter MS-DOS der Befehl <kbd>SET
PGPPATH=</kbd> in die Datei <a name=[autoexec]><kbd>autoexec.bat</kbd></a>
eingetragen werden, so da&szlig;
<kbd>PGPPATH</kbd> automatisch beim Start des Rechners gesetzt wird.
Wenn <kbd>PGPPATH</kbd> nicht definiert ist, sucht PGP die Dateien im
aktuellen Verzeichnis. Das Vorgehen unter Amiga-DOS ist entsprechend:
<kbd>Setenv PGPPATH dh1:pgp/</kbd>, f&uuml;r eine dauerhafte
Einstellung mit anschlie&szlig;endem <kbd>copy env:PGPPATH
envarc:</kbd>.

<a name=config.txt>
<h1>Konfigurierbare Parameter: <kbd>config.txt</kbd> bzw.
<kbd>pgp.config</kbd></h1>
</a>

Die Datei <kbd>config.txt</kbd> (MS-DOS/Unix) bzw.
<kbd>pgp.config</kbd> (Amiga) enth&auml;lt eine Reihe von Parametern,
mit denen PGP den individuellen Bed&uuml;rfnissen angepa&szlig;t
werden kann. <kbd>config.txt</kbd> bzw. <kbd>pgp.config</kbd> stehen
in dem Verzeichnis, das in der Umgebungsvariablen <kbd>PGPPATH</kbd>
angegeben ist.
<p>
In <kbd>config.txt</kbd> kann beispielsweise eingestellt werden, in
welchem Verzeichnis PGP tempor&auml;re Dateien speichert, in welcher
Sprache PGP seine Meldungen ausgibt, oder wie skeptisch sich PGP bei
der Pr&uuml;fung von Unterschriften unter &ouml;ffentlichen
Schl&uuml;sseln verh&auml;lt.
<p>
N&auml;heres &uuml;ber die einstellbaren Parameter steht im zweiten
Teil des Handbuchs.


<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
