<HTML>
<head>
<title>PGP = Spezielle Befehle</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<blockquote><i>
Dieser zweite Teil des Handbuchs beinhaltet spezielle
Themen, die nicht im ersten Teil &quot;Grundlagen&quot; enthalten
sind. Das Lesen dieses Teils ohne Kenntnis des ersten ist nicht sehr
sinnvoll. Andererseits ist die Kenntnis dieses zweiten Teils f&uuml;r
die Benutzung von PGP nicht unbedingt erforderlich.
</i></blockquote>

<hr>

<a href=#auswahlid>Auswahl eines Schl&uuml;ssels &uuml;ber seine
Schl&uuml;ssel-ID</a><br>
<a href=#[abgelunterschr]>Trennung der Unterschrift von der Nachricht</a><br>
<a href=#sigkeep>Entschl&uuml;sselung einer Nachricht und Speicherung
zusammen mit einer Unterschrift</a><br>
<a href=#[ASCII-Computer]>Der Austausch von ASCII-Text zwischen
unterschiedlichen Computern</a><br>
<a href=#notraceplatte>Vermeidung von &quot;Spuren des Klartextes&quot;
auf der Festplatte</a><br>
<a href=#[Anzeigebild]>Anzeige des entschl&uuml;sselten Klartextes
am Bildschirm</a><br>
<a href=#viewonly>Verschl&uuml;sseln einer Nachricht &quot;nur f&uuml;r die
Augen der Empf&auml;ngerin&quot;</a><br>
<a href=#origname>Beibehaltung des originalen Dateinamens des
Klartextes</a><br>
<a href=#keychange>&Auml;ndern der Benutzer-ID und des Mantra</a><br>
<a href=#vertrauen>&Auml;ndern der Vertrauensparameter f&uuml;r einen
&ouml;ffentlichen Schl&uuml;ssel</a><br>
<a href=#[Intakt]>Pr&uuml;fen, ob der Bund mit &ouml;ffentlichen
Schl&uuml;sseln intakt ist</a><br>
<a href=#telefon>Telefonische Kontrolle eines &ouml;ffentlichen
Schl&uuml;ssels</a><br>
<a href=#gross>Ein Wort zu gro&szlig;en Schl&uuml;sselbunden</a><br>
<a href=#filter>PGP als Filterprogramm im Unix-Stil</a><br>
<a href=#batch>Unterdr&uuml;ckung nicht notwendiger Fragen:
<kbd>BATCHMODE</kbd></a><br>
<a href=#force>&quot;Ja&quot; als Standardantwort bei
Best&auml;tigungsabfragen: <kbd>FORCE</kbd></a><br>
<a href=#exitcode>Der Beendigungscode von PGP</a><br>
<a href=#pgppass>Umgebungsvariable f&uuml;r das Mantra:
<kbd>PGPPASS</kbd></a>
<hr>

<a name=auswahlid>
<h1>Auswahl eines Schl&uuml;ssels &uuml;ber seine
Schl&uuml;ssel-ID</h1>
</a>

Bei allen Kommandos, die die Angabe einer Benutzer-ID oder eines
Teils derselben erfordern, kann statt dessen auch die hexadezimale
Schl&uuml;ssel-ID benutzt werden. In diesem Fall mu&szlig; vor der
Schl&uuml;ssel-ID ein <kbd>0x</kbd> geschrieben werden. Beispiel:
<p>
<kbd>
pgp -kv 0x67F7
</kbd>

<p>
listet alle Schl&uuml;ssel, in denen <kbd>67F7</kbd> ein Teil der
Schl&uuml;ssel-ID ist. Diese Option ist vor allem dann praktisch,
wenn es von einer Person zwei verschiedene Schl&uuml;ssel mit ein und
derselben Benutzer-ID gibt. In diesem Fall l&auml;&szlig;t sich mit
Hilfe der Schl&uuml;ssel-ID einer der beiden Schl&uuml;ssel eindeutig
ausw&auml;hlen.

<h1><a name=[abgelunterschr]>Trennung
der Unterschrift von der Nachricht</a></h1>

Normalerweise wird eine Unterschrift in derselben Datei gespeichert
wie der Text, der unterschrieben wird. Dadurch ist die Pr&uuml;fung
einer Unterschrift in den meistens F&auml;llen einfach und bequem
m&ouml;glich. Unter bestimmten Umst&auml;nden ist es aber sinnvoll,
die Unterschrift in einer eigenen Datei, unabh&auml;ngig von der
Textdatei, zu speichern. Hierf&uuml;r dient die Option <kbd>b</kbd>
zusammen mit der Option <kbd>-s</kbd>.
<p>
Beispiel:
<p>
<kbd>
pgp -sb letter.txt
</kbd>

<p>
Hier wird eine Datei <kbd>letter.sig</kbd> erzeugt, die nur die
Unterschrift enth&auml;lt. Der Inhalt der Datei <kbd>letter.txt</kbd>
wird nicht in <kbd>letter.sig</kbd> gespeichert. Wenn die
Unterschrift in einer eigenen Datei (<kbd>letter.sig</kbd> in obigem
Beispiel) erzeugt wurde, m&uuml;ssen beide Dateien (im Beispiel
<kbd>letter.sig</kbd> und <kbd>letter.txt</kbd>) an die
Empf&auml;ngerin geschickt werden. Sie ben&ouml;tigt beide Dateien,
um die Echtheit der Unterschrift zu pr&uuml;fen. Wenn sie die Datei
mit der Unterschrift durch PGP bearbeiten l&auml;&szlig;t, stellt das
Programm fest, da&szlig; diese Datei keinen Text enth&auml;lt, und
fragt die Benutzerin nach dem Namen der Textdatei. Erst danach kann
PGP die Unterschrift pr&uuml;fen. Wenn der Empf&auml;nger bereits
wei&szlig;, da&szlig; Text und Unterschrift in getrennten Dateien
gespeichert sind, kann er auch beide Dateinamen in der Kommandozeile
angeben:
<p>
<kbd>
pgp letter.sig letter.txt
</kbd>

<p>
oder
<p>
<kbd>
pgp letter letter.txt
</kbd>

<p>
In diesem Fall fragt PGP nicht nach dem Namen der Textdatei. Die
Unterschrift in einer eigenen Datei zu speichern, ist dann sinnvoll,
wenn die Unterschriften unabh&auml;ngig vom Text protokolliert werden
sollen. Die abgetrennte Unterschrift ist auch f&uuml;r die Dateien
mit ausf&uuml;hrbaren Programmen (bei MS-DOS: <kbd>.EXE</kbd> und
<kbd>.COM</kbd>) sinnvoll, um eine Viruspr&uuml;fung
durchzuf&uuml;hren. Sie ist auch dann sinnvoll, wenn mehrere Personen
ein Dokument (beispielsweise einen Vertrag) unterschreiben sollen,
ohne da&szlig; die Unterschriften &quot;verschachtelt&quot; werden.
Die Unterschrift jeder einzelnen Person wird unabh&auml;ngig von den
anderen gespeichert. Wenn man eine verschl&uuml;sselte Nachricht
erh&auml;lt, bei der Unterschrift und Text in einer Datei stehen,
kann die Unterschrift auch nachtr&auml;glich vom Text getrennt
werden. Dies geschieht mit der Option <kbd>-b</kbd> bei der
Entschl&uuml;sselung:
<p>
<kbd>
pgp -b letter
</kbd>

<p>
Hier wird <kbd>letter.pgp</kbd> entschl&uuml;sselt. Falls eine
Unterschrift vorhanden ist, wird sie gepr&uuml;ft und in einer
eigenen Datei <kbd>letter.sig</kbd> gespeichert.

<a name=sigkeep>
<h1>Entschl&uuml;sselung einer Nachricht und Speicherung zusammen mit
einer Unterschrift</h1>
</a>

Normalerweise wollen Sie eine verschl&uuml;sselte Nachricht
vollst&auml;ndig entschl&uuml;sseln, die Unterschrift (oder mehrere
verschachtelte Unterschriften) pr&uuml;fen und hierbei eine
&quot;Schicht&quot; nach der anderen abtrennen, bis der originale
Klartext &uuml;brig bleibt. Manchmal wollen Sie aber die Nachricht
nur entschl&uuml;sseln und die Unterschriften bei der Nachricht
belassen. Dies ist beispielsweise dann sinnvoll, wenn Sie die Kopie
einer unterschriebenen Nachricht an eine dritte Person weiterleiten
m&ouml;chten, gegebenenfalls erneut verschl&uuml;sselt. Angenommen,
es kommt eine Nachricht, die Charlie unterschrieben hat,
verschl&uuml;sselt mit dem &ouml;ffentlichen Sch&uuml;ssel des
Empf&auml;ngers. Die Nachricht soll entschl&uuml;sselt und zusammen
mit Charlies Unterschrift an Alice weitergeleitet werden,
gegebenenfalls mit ihrem &ouml;ffentlichen Schl&uuml;ssel
verschl&uuml;sselt. Mit PGP ist das kein Problem. Mit folgendem
Kommando wird eine Nachricht entschl&uuml;sselt, ohne da&szlig; die
Unterschriften abgetrennt werden:
<p>
<kbd>
pgp -d letter
</kbd>

<p>
Hier wird die Datei <kbd>letter.pgp</kbd> entschl&uuml;sselt, und
Unterschriften werden, falls vorhanden, zusammen mit dem
entschl&uuml;sselten Klartext in der Ausgabedatei gespeichert.
<p>
Die Ausgabedatei kann archiviert oder - gegebenenfalls wieder
verschl&uuml;sselt - an eine andere Person weitergeleitet werden.

<h1><a name=[ASCII-Computer]>Der Austausch von ASCII-Text zwischen 
unterschiedlichen Computern</a></h1>

Mit PGP kann jede Art von Klartext verschl&uuml;sselt werden,
irgendwelche Bin&auml;rdaten ebenso wie ASCII-Text. Wahrscheinlich
wird PGP am h&auml;ufigsten f&uuml;r die Verschl&uuml;sselung von
E-Mail benutzt, so da&szlig; der Klartext aus ASCII-Daten besteht.
<p>
ASCII-Text wird auf verschiedenen Computern leicht unterschiedlich
dargestellt. Beispielsweise endet eine Zeile bei MS-DOS mit den
beiden Zeichen f&uuml;r Wagenr&uuml;cklauf und Zeilenvorschub. Bei
Unix endet eine Zeile nur mit dem Zeichen f&uuml;r Zeilenvorschub.
Beim Macintosh endet eine Zeile mit dem Zeichen f&uuml;r
Wagenr&uuml;cklauf, ohne Zeilenvorschub. Traurig, aber wahr.
<p>
Nicht verschl&uuml;sselte ASCII-Daten werden bei E-Mail-Systemen
normalerweise in eine kanonische, maschinenunabh&auml;ngige Form
gebracht, wenn sie zwischen zwei Computern ausgetauscht werden. Bei
kanonischer Textdarstellung besteht ein Zeilenende aus den Zeichen
Wagenr&uuml;cklauf und Zeilenvorschub. Beispielsweise konvertiert das
weit verbreitete KERMIT den ASCII-Text in diese kanonische Form,
bevor der Text an einen anderen Computer gesendet wird, und das
KERMIT auf dem Computer, der den Text empf&auml;ngt, konvertiert ihn
wieder in diejenige Form, die sein Betriebssystem braucht. Dadurch
ist es einfach, Texte zwischen verschiedenen Computern auszutauschen.
<p>
Diese automatische Anpassung der Textdarstellung an das jeweilige
Betriebssystem ist bei verschl&uuml;sselten Nachrichten nicht
m&ouml;glich, weil der Klartext durch die Verschl&uuml;sselung dem
&Uuml;bertragungsprogramm verborgen bleibt. Diese Aufgabe mu&szlig;
das Verschl&uuml;sselungsprogramm &uuml;bernehmen. Deshalb kann man
bei PGP angeben, ob der Klartext als Bin&auml;rdaten oder als
ASCII-Text angesehen werden soll. In letzterem Fall wird der Klartext
vor der Verschl&uuml;sselung in kanonische Form gebracht. Bei der
Entschl&uuml;sselung wird er dann in die Form gebracht, die f&uuml;r
das Betriebssystem des Computers, auf dem entschl&uuml;sselt wird,
geeignet ist.
<p>
Wenn die Option <kbd>t</kbd> beim Verschl&uuml;sseln und / oder
Unterschreiben einer Nachricht mit angegeben wird, konvertiert PGP
den Text vor der Verschl&uuml;sselung bzw. dem Unterschreiben in die
kanonische Form:
<p>
<kbd>
pgp -et message.txt Empf&auml;nger-ID
</kbd>

<p>
Diese Option schaltet PGP automatisch ab, sobald es in der zu
verschl&uuml;sselnden Datei Daten findet, die es nicht als Text
betrachtet. Falls der Klartext aus einem 8-Bit-Zeichensatz besteht,
falls er also mehr Zeichen enth&auml;lt als der ASCII-Standard
f&uuml;r den englischen Zeichensatz, verwendet PGP bei der
Konvertierung in die kanonische Form den Zeichensatz LATIN1 (ISO
8859-1 Latin Alphabet 1). Die Konvertierung h&auml;ngt davon ab, was
als Parameter <kbd>CHARSET</kbd> in der PGP-Konfigurationsdatei
eingetragen ist. LATIN1 ist eine Obermenge von ASCII, mit
diakritischen Zeichen f&uuml;r viele europ&auml;ische Sprachen.

<a name=notraceplatte>
<h1>Vermeidung von &quot;Spuren des Klartextes&quot; auf der
Festplatte</h1>
</a>

Nachdem PGP eine Datei verschl&uuml;sselt hat, kann es bei Bedarf die
Klartext-Datei &uuml;berschreiben und danach l&ouml;schen, so
da&szlig; keine &quot;Spuren&quot; des Klartextes auf der Festplatte
verbleiben. Dies verhindert, da&szlig; der Klartext mit einem
Sektor-Editor oder einem &auml;hnlichen Programm noch gelesen werden
kann. Diese Option ist sinnvoll, um zu vermeiden, da&szlig;
vertrauliche Informationen unkontrolliert auf der Festplatte
verbleiben.
<p>
Um den Klartext nach der Verschl&uuml;sselung und / oder dem
Unterschreiben von der Festplatte zu l&ouml;schen, wird die Option
<kbd>w</kbd> verwendet:
<p>
<kbd>
pgp -esw message.txt Empf&auml;nger-ID
</kbd>

<p>
Hier wird eine verschl&uuml;sselte, unterschriebene Datei
<kbd>message.pgp</kbd> erzeugt, und die Klartext-Datei
<kbd>message.txt</kbd> wird danach &uuml;berschrieben und
gel&ouml;scht. Diese Option sollte mit Vorsicht benutzt werden. Zudem
mu&szlig; betont werden, da&szlig; hierdurch keinerlei Fragmente des
Klartextes gel&ouml;scht werden, die ein Textverarbeitungsprogramm
h&auml;ufig auf der Festplatte ablegt, wenn man einen Text eintippt
und bearbeitet. Die meisten Textverarbeitungsprogramme erzeugen
Backup- und tempor&auml;re Dateien. Au&szlig;erdem wird die
Klartext-Datei nur einmal &uuml;berschrieben. Das ist zwar
ausreichend, um ein Lesen des Klartextes mit den &uuml;blichen
Werkzeugen der Datenwiederherstellung zu verhindern, reicht aber
nicht aus, um einen gezielten und ausgefeilten Leseversuch
abzuwehren, bei dem eine schwache Restmagnetisierung der
&uuml;berschriebenen Daten mittels spezieller Hardware ausgewertet
wird.(*)
<p>
<hr><i>
 (*)Weiteres hierzu steht weiter unten im Abschnitt &quot;Nicht richtig
gel&ouml;schte Dateien&quot;. d.&Uuml;.
</i><hr>

<h1><a name=[Anzeigebild]>Anzeige des entschl&uuml;sselten Klartextes 
am Bildschirm</a></h1>

Um den entschl&uuml;sselten Klartext nur am Bildschirm zu lesen
(&auml;hnlich dem Unix-Kommando more), ohne da&szlig; er in eine
Datei geschrieben wird, kann die Option <kbd>-m</kbd> verwendet
werden:
<p>
<kbd>
pgp -m letter.pgp
</kbd>

<p>
Dieser Befehl zeigt den entschl&uuml;sselten Klartext am Bildschirm
an.(*)
<p>
<hr><i>
 (*)Mit den Tasten <kbd>LEERTASTE</kbd>, <kbd>RETURN</kbd> und
<kbd>B</kbd> kann im Text gebl&auml;ttert werden. Mit <kbd>Q</kbd>
wird das Lesen beendet. d.&Uuml;.
<p>
</i><hr>
Im Abschnitt <a href=pgp.2.2.html#[Pager]>Auswahl eines
Programms f&uuml;r die Textanzeige am Bildschirm</a>
erfahren Sie, wie Sie ein externes
Anzeigeprogramm einbinden, das das Lesen komfortabler macht.

<a name=viewonly>
<h1>Verschl&uuml;sseln einer Nachricht &quot;nur f&uuml;r die Augen
der Empf&auml;ngerin&quot;</h1>
</a>

Um festzulegen, da&szlig; die Empf&auml;ngerin den
entschl&uuml;sselten Klartext <em>nur</em> am Bildschirm lesen, ihn
aber nicht in eine Datei schreiben kann, wird die Option
<kbd>-m</kbd> beim Verschl&uuml;sseln verwendet:
<p>
<kbd>
pgp -sem message.txt Empf&auml;nger-ID
</kbd>

<p>
Wenn die Empf&auml;ngerin eine so verschl&uuml;sselte Nachricht mit
ihrem privaten Schl&uuml;ssel und ihrem Mantra entschl&uuml;sselt,
wird der Klartext nur auf ihrem Bildschirm angezeigt, aber nicht auf
der Festplatte gespeichert. Die Textanzeige erfolgt auf dem
Bildschirm so, wie zuvor im Abschnitt <a
href=#[Anzeigebild]>Anzeige des
entschl&uuml;sselten Klartextes am Bildschirm</a> beschrieben. 
Wenn der Empf&auml;nger
die Nachricht ein zweites Mal lesen will, mu&szlig; er die Nachricht
erneut entschl&uuml;sseln.
<p>
Diese Option ist der sicherste Weg, um zu verhindern, da&szlig;
vertrauliche Nachrichten versehentlich als Klartext auf der
Festplatte des Empf&auml;ngers liegenbleiben. Diese Option wurde in
PGP auf Anfrage eines Benutzers eingebaut, der seiner Liebsten intime
Nachrichten schicken wollte, aber bef&uuml;rchtete, da&szlig; sie
unabsichtlich eine entschl&uuml;sselte Nachricht auf dem Computer
ihres Ehemanns liegen lassen k&ouml;nnte.(*)
<p>
<hr><i>
 (*)Es ist nat&uuml;rlich trotzdem m&ouml;glich, durch ein Umlenken der
Ausgabe den entschl&uuml;sselten Text in eine Datei zu speichern. Der
Zweck der Option liegt darin, da&szlig; dies nicht unabsichtlich
geschieht. d.&Uuml;.
</i><hr>

<a name=origname>
<h1>Beibehaltung des originalen Dateinamens des Klartextes</h1>
</a>

Normalerweise gibt PGP der Datei mit dem entschl&uuml;sselten
Klartext den gleichen Namen wie der Datei mit dem
verschl&uuml;sselten Text, aber ohne Suffix. Ein anderer Name
f&uuml;r die Klartext-Datei kann mit der Option <kbd>-o</kbd>
festgelegt werden. Bei den meisten E-Mail-Nachrichten ist dies
sinnvoll, weil man so den Dateinamen bei der Entschl&uuml;sselung
festlegen kann und typische Nachrichten meist unbrauchbare
urspr&uuml;ngliche Dateinamen wie <kbd>an_phil.txt</kbd> oder
<kbd>krypt.msg</kbd> haben.
<p>
Wenn PGP eine Klartext-Datei verschl&uuml;sselt, f&uuml;gt es den
originalen Dateinamen dem Klartext vor der Komprimierung bei.
Normalerweise verwendet PGP diesen originalen Dateinamen bei der
Entschl&uuml;sselung nicht, aber bei Bedarf kann PGP angewiesen
werden, der entschl&uuml;sselten Klartext-Datei diesen Namen zu
geben. Das ist sinnvoll, wenn PGP dazu benutzt wird, Dateien zu ver-
und entschl&uuml;sseln, deren Name von Bedeutung ist.
<p>
Um den originalen Namen der Klartext-Datei bei der
Entschl&uuml;sselung zu erhalten, kann die Option <kbd>-p</kbd>
verwendet werden:
<p>
<kbd>
pgp -p verschl&uuml;sselte-datei
</kbd>

<p>
Ich benutze diese Option normalerweise nicht, weil andernfalls
ungef&auml;hr die H&auml;lfte der an mich gerichteten
E-Mail-Nachrichten den gleichen Dateinamen wie <kbd>an_phil.txt</kbd>
oder <kbd>prz.txt</kbd> h&auml;tten.

<a name=keychange>
<h1>&Auml;ndern der Benutzer-ID und des Mantra</h1>
</a>

Ab und zu kann es erforderlich sein, das Mantra zu &auml;ndern,
beispielsweise dann, wenn jemand beim Eintippen des Mantra zugeschaut
hat. Oder die Benutzer-ID mu&szlig; ge&auml;ndert werden, sei es
wegen einer Heirat oder wegen einer ge&auml;nderten E-Mail-Adresse.
Oder es soll dem Schl&uuml;ssel eine zweite oder dritte Benutzer-ID
hinzugef&uuml;gt werden, um mehrere E-Mail-Adressen oder
Berufsbezeichnungen einzutragen. Mit PGP k&ouml;nnen einem
Schl&uuml;ssel mehrere Benutzer-IDs hinzugef&uuml;gt werden, und jede
dieser IDs kann f&uuml;r die Auswahl des Schl&uuml;ssel aus dem Bund
mit &ouml;ffentlichen Schl&uuml;sseln verwendet werden. Die eigene
Benutzer-ID und das Mantra k&ouml;nnen mit folgendem Kommando
ge&auml;ndert werden:
<p>
<kbd>
pgp -ke Benutzer-ID [Schl&uuml;sselbund]
</kbd>

<p>
PGP fragt dann nach der neuen Benutzer-ID und dem neuen Mantra. Wenn
der optionale Parameter <kbd>Schl&uuml;sselbund</kbd> angegeben wird,
mu&szlig; es sich um einen Bund mit &ouml;ffentlichen Schl&uuml;sseln
handeln, nicht mit geheimen. Der Parameter <kbd>Benutzer-ID</kbd>
mu&szlig; die eigene ID sein. PGP erkennt dies daran, da&szlig; diese
ID sowohl im Bund mit &ouml;ffentlichen Schl&uuml;sseln als auch im
Bund mit geheimen Schl&uuml;sseln auftaucht. Beide Dateien werden
ge&auml;ndert, auch wenn ein Bund mit &ouml;ffentlichen
Schl&uuml;sseln als Parameter angegeben wurde.

<a name=vertrauen>
<h1>&Auml;ndern der Vertrauensparameter f&uuml;r einen
&ouml;ffentlichen Schl&uuml;ssel</h1>
</a>

Manchmal m&uuml;ssen die Vertrauens-Einstellungen f&uuml;r einen
&ouml;ffentlichen Schl&uuml;ssel ge&auml;ndert werden. Was diese
Vertrauensparameter sind, steht in Teil I des Handbuchs im Abschnitt
<a href=pgp.1.5.html#[G&uuml;ltigkeit]>Wie
&uuml;berpr&uuml;ft PGP, welche Schl&uuml;ssel g&uuml;ltig
sind?</a>. Mit
folgendem Befehl k&ouml;nnen die Vertrauensparameter f&uuml;r einen
&ouml;ffentlichen Schl&uuml;ssel ge&auml;ndert werden:
<p>
<kbd>
pgp -ke Benutzer-ID [Schl&uuml;sselbund]
</kbd>

<p>
Wenn der optionale Parameter <kbd>Schl&uuml;sselbund</kbd> angegeben
wird, mu&szlig; es ein Bund mit &ouml;ffentlichen Schl&uuml;sseln
sein, nicht mit geheimen Schl&uuml;sseln.

<h1><a name=[Intakt]>Pr&uuml;fen, ob der Bund mit &ouml;ffentlichen
Schl&uuml;sseln intakt ist</a></h1>

Normalerweise pr&uuml;ft PGP automatisch jeden Schl&uuml;ssel und
jede Unterschrift, die einem Bund mit &ouml;ffentlichen
Schl&uuml;sseln hinzugef&uuml;gt werden, und pa&szlig;t automatisch
die Vertrauenseinstellungen und G&uuml;ltigkeitswerte an. Theoretisch
pa&szlig;t es die G&uuml;ltigkeitswerte f&uuml;r alle betroffenen
Schl&uuml;ssel an, wenn ein Schl&uuml;ssel dem Bund mit
&ouml;ffentlichen Schl&uuml;sseln hinzugef&uuml;gt oder aus ihm
gel&ouml;scht wird. Manchmal m&ouml;chte man aber auch dann eine
umfassende Analyse haben, wenn keine &Auml;nderungen an dem
Schl&uuml;sselbund erforderlich sind: Pr&uuml;fen der
Best&auml;tigung(en) der einzelnen Schl&uuml;ssel, Pr&uuml;fen der
Vertrauensparameter, Neuberechnung der G&uuml;ltigkeitswerte und
Vergleich des eigenen, absolut vertrauensw&uuml;rdigen
Schl&uuml;ssels mit der Sicherheitskopie auf einer
schreibgesch&uuml;tzten Diskette. Es ist sinnvoll, diese
Integrit&auml;tspr&uuml;fung in regelm&auml;&szlig;igen
Abst&auml;nden durchzuf&uuml;hren, um sicherzustellen, da&szlig; der
Bund mit &ouml;ffentlichen Schl&uuml;sseln wirklich intakt ist. Mit
der Option <kbd>-kc</kbd> f&uuml;hrt PGP eine vollst&auml;ndige
Analyse des Bunds mit &ouml;ffentlichen Schl&uuml;sseln aus:
<p>
<kbd>
pgp -kc
</kbd>

<p>
Mit folgendem Befehl pr&uuml;ft PGP die Unterschriften f&uuml;r einen
bestimmten &ouml;ffentlichen Schl&uuml;ssel:
<p>
<kbd>
pgp -kc Benutzer-ID [schl&uuml;sselbund]
</kbd>

<p>
Weitere Informationen dar&uuml;ber, wie der eigene Schl&uuml;ssel mit
einer Sicherheitskopie verglichen wird, stehen bei der Beschreibung
des Parameters <kbd>BAKRING</kbd> im Abschnitt <a
href=pgp.2.2.html>Die Konfigurationsdatei</a>.
<p>
Eine komplette &Uuml;berpr&uuml;fung des Schl&uuml;sselbunds kann
auch mit dem Befehl <kbd>pgp -km</kbd> durchgef&uuml;hrt werden,
hierbei zeigt PGP auch die Vertrauensketten an.

<a name=telefon>
<h1>Telefonische Kontrolle eines &ouml;ffentlichen
Schl&uuml;ssels</h1>
</a>

Es kann vorkommen, da&szlig; man einen &ouml;ffentlichen
Schl&uuml;ssel bekommt, der nicht von einer anderen
vertrauensw&uuml;rdigen Person best&auml;tigt ist. Dann stellt sich
die Frage, wie sich die Echtheit dieses Schl&uuml;ssels feststellen
l&auml;&szlig;t. Der beste Weg hierf&uuml;r ist die Kontrolle des
Schl&uuml;ssels &uuml;ber einen anderen Kanal als den, &uuml;ber den
der Schl&uuml;ssel geschickt wurde. <em>Wenn man die Person
kennt</em>, der der &ouml;ffentliche Schl&uuml;ssel geh&ouml;rt, und
<em>wenn man auch ihre Stimme am Telefon erkennt</em>, besteht eine
einfache und bequeme L&ouml;sung des Problems darin, sie anzurufen,
und den Schl&uuml;ssel im Gespr&auml;ch zu kontrollieren(*). Hierzu
braucht man sich nicht m&uuml;hsam den ganzen ASCII-dargestellten
Schl&uuml;ssel vorzulesen. Es reicht, den
verh&auml;ltnism&auml;&szlig;ig kurzen Fingerabdruck des
Schl&uuml;ssels zu vergleichen. Den Fingerabdruck eines
Schl&uuml;ssel gibt PGP mit der Option <kbd>-kvc</kbd> aus:
<p>
<kbd>
pgp -kvc Benutzer-ID [schl&uuml;sselbund]
</kbd>

<hr><i>
 (*)Die Frage, unter welchen Voraussetzungen die telefonische Kontrolle
eines Schl&uuml;ssels wirklich zuverl&auml;ssig m&ouml;glich ist, ist
zusammen mit der Frage, wann man f&uuml;r die Echtheit eines fremden
Schl&uuml;ssel mit der eigenen Unterschrift b&uuml;rgen kann, das
wahrscheinlich schwierigste, aber auch interessanteste Problem bei
PGP. So taucht in den Foren von MailBoxnetzen immer wieder die Frage
auf, ob sich die telefonische Kontrolle eines Schl&uuml;ssels auch
dann durchf&uuml;hren l&auml;&szlig;t, wenn sich die
Gespr&auml;chspartner nicht kennen. Wir halten das nicht f&uuml;r
m&ouml;glich. F&uuml;r weitere Betrachtungen zu dem Problem der
Schl&uuml;sselkontrolle sei auf die FAQs verwiesen. d.&Uuml;.
<p>
</i><hr>

<p>
PGP zeigt die Benutzer-ID zusammen mit dem 16 Byte langen
Fingerabdruck an. Wenn beide Gespr&auml;chspartnerinnen diesen
PGP-Befehl ausf&uuml;hren, k&ouml;nnen sie den Schl&uuml;ssel anhand
des Fingerabdruck kontrollieren.
<p>
Wenn die Echtheit sowohl des eigenen &ouml;ffentlichen
Schl&uuml;ssels als auch des &ouml;ffentlichen Schl&uuml;ssels des
Gespr&auml;chspartners &uuml;berpr&uuml;ft ist, kann die Echtheit der
Schl&uuml;ssel wechselseitig durch eine Unterschrift best&auml;tigt
werden. Dies ist ein sicherer und komfortabler Weg, um mit dem Aufbau
eines Netzes vertrauensw&uuml;rdiger Schl&uuml;ssel innerhalb eines
Kreises von Freunden und Freundinnen zu beginnen.

<a name=gross>
<h1>Ein Wort zu gro&szlig;en &ouml;ffentlichen
Schl&uuml;sselbunden</h1>
</a>

PGP ist urspr&uuml;nglich entwickelt worden, um kleine
Schl&uuml;sselbunde mit ein paar hundert Schl&uuml;sseln zu
verwalten. Mit der Zeit ist PGP aber sehr verbreitet geworden, so
da&szlig; viele Leute nun geradezu riesige Schl&uuml;sselbunde
verwenden.(*) Hierf&uuml;r ist PGP gegenw&auml;rtig noch nicht
ausgelegt. F&uuml;r die Aufnahme einiger Tausend Schl&uuml;ssel in
Ihren pers&ouml;nlichen Schl&uuml;sselbund kann PGP erhebliche Zeit
brauchen.
<p>
<hr><i>
 (*)Es gibt beispielsweise in Hamburg einen Keyserver, auf dem mehrere
Megabyte an &ouml;ffentlichen Schl&uuml;sseln liegen. d.&Uuml;.
<p>
</i><hr>
Vielleicht m&ouml;chten Sie einen riesigen &quot;importierten&quot;
Schl&uuml;sselbund Ihrem eigenen hinzuf&uuml;gen, obwohl Sie
eigentlich nur an ein paar Dutzend Schl&uuml;sseln interessiert sind.
Wenn das alles ist, was Sie mit so einem riesigen Schl&uuml;sselbund
anstellen m&ouml;chten, gibt es einen effizienteren Weg: Extrahieren
Sie die wenigen f&uuml;r Sie interessanten Schl&uuml;ssel aus dem
gro&szlig;en Bund und f&uuml;gen Sie diese Schl&uuml;ssel Ihrem
eigenen Bund hinzu.
<p>
Die richtige L&ouml;sung w&auml;re nat&uuml;rlich, PGP so zu
verbessern, da&szlig; es geeignete Datenbanktechniken f&uuml;r die
Handhabung gro&szlig;er Schl&uuml;sselbunde verwendet. Doch solange
dies nicht geschehen ist, m&uuml;ssen Sie entweder kleinere Dateien
verwenden oder sich mit Geduld wappnen.

<a name=filter>
<h1>PGP als Filterprogramm im Unix-Stil</h1>
</a>

Unix-Fans sind es gew&ouml;hnt, &quot;pipes&quot; zu verwenden, um
Daten zwischen zwei Programmen auszutauschen. Der Output eines
Programms kann mittels einer &quot;pipe&quot; als Input in ein
zweites Programm gelenkt werden. Damit dies funktioniert, m&uuml;ssen
die Programme ihre Daten aus dem standard input lesen und in den
standard output schreiben. PGP kann in dieser Form arbeiten. Falls
Ihnen schleierhaft ist, was obiges zu bedeuten hat, werden Sie diese
M&ouml;glichkeit wahrscheinlich auch nicht brauchen, so da&szlig; Sie
diesen Abschnitt &uuml;berlesen k&ouml;nnen. Wenn die Option
<kbd>-f</kbd> verwendet wird, arbeitet PGP als Unix-Filter. Beispiel:
<p>
<kbd>
pgp -feast Benutzer-ID &lt;inputfile &gt;outputfile
</kbd>

<p>
Diese Option kann die Verwendung von PGP zusammen mit
E-Mail-Programmen vereinfachen.
<p>
Wenn man PGP als Unix-Filter verwendet, m&ouml;glicherweise in einem
Unix-Script oder in einer MS-DOS-Batchdatei, kann es sinnvoll sein,
die Umgebungsvariable <kbd>PGPPASS</kbd> zu verwenden, um zu
verhindern, da&szlig; PGP bei jedem Aufruf das Mantra abfragt.
<kbd>PGPPASS</kbd> ist weiter unten beschrieben.

<a name=batch>
<h1>Unterdr&uuml;ckung nicht notwendiger Fragen:
<kbd>BATCHMODE</kbd></h1>
</a>

Wird in der PGP-Befehlszeile <kbd>BATCHMODE</kbd> angegeben, stellt
PGP w&auml;hrend des Programmablaufes keinerlei unn&ouml;tige Fragen.
Beispiel:
<p>
<kbd>
pgp +batchmode verschl&uuml;sselte_datei
</kbd>

<p>
Dies ist sinnvoll, wenn PGP aus Unix Shell-Scripts oder aus einer
MS-DOS-Batchdatei aufgerufen wird. Manche PGP-Befehle f&uuml;r die
Schl&uuml;sselverwaltung brauchen in jedem Fall Eingaben durch die
Benutzerin. Sie sollten deshalb in Shell-Scripts vermieden werden.
<p>
<kbd>BATCHMODE</kbd> kann auch bei der Pr&uuml;fung der Echtheit
einer Unterschrift verwendet werden. Ist die Unterschrift nicht in
Ordnung, wird als Beendigungscode 1 zur&uuml;ckgegeben. Bei einer
intakten Unterschrift gibt PGP den Wert 0 zur&uuml;ck.

<a name=force>
<h1>&quot;Ja&quot; als Standardantwort bei Best&auml;tigungsabfragen:
<kbd>FORCE</kbd></h1>
</a>

<kbd>FORCE</kbd> veranla&szlig;t PGP, &quot;ja&quot; als
Standardantwort anzunehmen, wenn es danach fragt, ob eine bereits
existierende Datei &uuml;berschrieben werden soll, oder ob ein
&ouml;ffentlicher Schl&uuml;ssel aus einem Schl&uuml;sselbund mit
<kbd>-kr</kbd> entfernt werden soll. Beispiel:
<p>
<kbd>
pgp +force verschl&uuml;sselte_datei
</kbd>

<p>
oder:
<p>
<kbd>
pgp -kr +force smith
</kbd>

<p>
<kbd>FORCE</kbd> kann praktisch sein, wenn PGP aus einer
MS-DOS-Batchdatei bzw. einem Unix-Script aufgerufen wird.

<a name=exitcode>
<h1>Der Beendigungscode von PGP</h1>
</a>

Um den Betrieb von PGP aus Unix-Scripten oder MS-DOS-Stapeldateien zu
unterst&uuml;tzen, gibt PGP eine Statusmeldung an die aufrufende
Shell zur&uuml;ck. Ein Beendigungscode von Null bedeutet, da&szlig;
kein Fehler auftrat; jeder andere Wert signalisiert einen Fehler.
Jeder Fehler erzeugt einen anderen Code.(*)

<hr><i>
(*) Eine Liste der m&ouml;glichen Fehlercodes finden Sie <a
href=pgp.errors.html>hier</a>.
</i><hr>

<a name=pgppass>
<h1>Umgebungsvariable f&uuml;r das Mantra: <kbd>PGPPASS</kbd></h1>
</a>

Normalerweise fragt PGP das Mantra genau zu dem Zeitpunkt ab, wenn
ein geheimer Schl&uuml;ssel ben&ouml;tigt wird. Das Mantra kann aber
auch in der Umgebungsvariablen <kbd>PGPPASS</kbd> gespeichert werden.
Wenn <kbd>PGPPASS</kbd> definiert ist, versucht PGP, ihren Wert als
Mantra f&uuml;r den Zugriff auf einen geheimen Schl&uuml;ssel zu
verwenden. Ist das in <kbd>PGPPASS</kbd> gespeicherte Mantra nicht
korrekt, fragt PGP nach dem richtigen Mantra.
<p>
Unter MS-DOS k&ouml;nnte das Mantra so gesetzt werden:
<p>
<kbd>
SET PGPPASS=Zaphod Beeblebrox wird Bundespr&auml;sident
</kbd>

<p>
Die Eingabe eines Mantra w&auml;hrend des Laufes von PGP ist dann
nicht mehr erforderlich, vorausgesetzt, da&szlig; &quot;Zaphod
Beeblebrox wird Bundespr&auml;sident&quot; wirklich das richtige
Mantra ist.
<p>
Die Verwendung von <kbd>PGPPASS</kbd> ist einerseits gef&auml;hrlich,
macht aber andererseits die Arbeit mit PGP wesentlich einfacher, wenn
man regelm&auml;&szlig;ig gr&ouml;&szlig;ere Mengen
verschl&uuml;sselter Nachrichten erh&auml;lt.
<p>
Die Auswertung der Umgebungsvariablen <kbd>PGPPASS</kbd> habe ich auf
vielfachen Wunsch hin in PGP aufgenommen. Die Verwendung von
<kbd>PGPPASS</kbd> ist aber gef&auml;hrlich, weil das Mantra dann
nicht nur in Ihrem Ged&auml;chtnis, sondern auch irgendwo im Speicher
Ihres Rechner steht. Leichtsinnig w&auml;re es, das Mantra in einer
Datei auf demselben Rechner zu speichern, auf dem auch Ihre Datei
<kbd>secring.pgp</kbd> steht. Nicht nur sehr leichtsinnig, sondern
einfach dumm w&auml;re es, das Mantra in einer Batchdatei, am Ende
gar in <kbd>autoexec.bat</kbd>, zu speichern. Jedermann k&ouml;nnte
sich in der Mittagspause an Ihren Rechner setzen, und sowohl Ihr
Mantra als auch Ihren geheimen Schl&uuml;sselbund mitgehen lassen.
<p>
Die Gef&auml;hrlichkeit von <kbd>PGPPASS</kbd> kann nicht stark genug
betont werden. Bevor Sie sich &uuml;berlegen, ob Sie
<kbd>PGPPASS</kbd> trotzdem verwenden, sollten Sie auf jeden Fall die
Abschnitte <a href=pgp.2.4.html#[Manipulation]>Probleme bei
Mehrplatzcomputern</a>,
und <a href=pgp.1.5.html#[ManiSchutz]>&Ouml;ffentliche
Schl&uuml;ssel vor Manipulation sch&uuml;tzen</a>, genau lesen.
<p>
Falls Sie <kbd>PGPPASS</kbd> unbedingt brauchen, ist es am
sichersten, das Kommando zum Setzen von <kbd>PGPPASS</kbd>
unmittelbar vor der Benutzung von PGP einzutippen und unmittelbar
nach der Benutzung von PGP <kbd>PGPPASS</kbd> wieder zu l&ouml;schen
oder den Computer auszuschalten. Sie sollten <kbd>PGPPASS</kbd> auf
keinen Fall verwenden, wenn andere Personen Zugang zu Ihrem Computer
haben. Es k&ouml;nnte jemand vorbeikommen und Ihr Mantra ganz einfach
durch Abfragen der Umgebungsvariablen herausfinden.
<p>
<blockquote><i>
<p>
PGP stellt noch weitere, weniger bedenkliche
Methoden zur Verf&uuml;gung, mit denen die Eingabe des Mantras
automatisiert werden kann. Auch diese sind Sicherheitsrisiken, aber
kleinere.
</i></blockquote>

<p>
<blockquote><i>
Das Mantra kann mit der Option <kbd>-z</kbd> in der
Befehlszeile &uuml;bergeben werden:
</i></blockquote>

<p>
<blockquote><kbd>
pgp -m "-zZaphod Beeblebrox wird
Bundespr&auml;sident"<p>
geheim.pgp
</kbd></blockquote>

<p>
<blockquote><i>
Oder es wird in eine (vor anderen Benutzern
gesch&uuml;tzte) Datei geschrieben und der Pfad und der Dateiname
dieser Datei in der Umgebungsvariablen <kbd>PGPPASSFD</kbd>
gespeichert.
</i></blockquote>



<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
