<HTML>
<head>
<title>PGP = Der Umgang mit Schl&uuml;sseln</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#generieren>Einen RSA-Schl&uuml;ssel generieren</a><br>
<a href=#aufnehmen>Einen Schl&uuml;ssel in den Schl&uuml;sselbund
aufnehmen</a><br>
<a href=#entfernen>Einen Schl&uuml;ssel oder eine Benutzer-ID aus dem
Schl&uuml;sselbund entfernen</a><br>
<a href=#inhalt>Inhaltsangabe des Schl&uuml;sselbunds</a><br>
<a href=#extract>Einen Schl&uuml;ssel in eine eigene Datei kopieren</a><br>
<a href=#[ManiSchutz]>&Ouml;ffentliche Schl&uuml;ssel vor Manipulation
sch&uuml;tzen</a><br>
<a href=#unterschreibfrem>Wie untersucht PGP, welche Schl&uuml;ssel
g&uuml;ltig sind?</a><br>
<a href=#sign>Einen Schl&uuml;ssel unterschreiben</a><br>
<a href=#diebstahl>Private Schl&uuml;ssel vor Diebstahl
sch&uuml;tzen</a><br>
<a href=#zurueckziehen>Einen Schl&uuml;ssel zur&uuml;ckziehen</a><br>
<a href=#privatverloren>Ich habe meinen privaten Schl&uuml;ssel verloren,
was jetzt?</a>

<hr>

Schon zu Zeiten von Julius C&auml;sar war der Umgang mit
Schl&uuml;sseln die delikateste Angelegenheit der Kryptographie.
Einer der gr&ouml;&szlig;ten Vorteile von PGP ist die hochentwickelte
Schl&uuml;sselverwaltung.

<a name="generieren">
<h1>Einen RSA-Schl&uuml;ssel generieren</h1>
</a>

Um Ihr eigenes Schl&uuml;sselpaar zu erzeugen, geben Sie folgenden
Befehl ein:
<p>
<kbd>
pgp -kg
</kbd>

<p>
Nach der Eingabe dieses Befehls fragt PGP nach der
Schl&uuml;sselgr&ouml;&szlig;e. PGP bietet einige m&ouml;gliche
Schl&uuml;sselgr&ouml;&szlig;en als Auswahlm&ouml;glichkeiten an, 384
Bit &quot;f&uuml;r den Hausgebrauch&quot;, 512 Bit &quot;f&uuml;r
normale Anwendungen&quot; oder 1024 Bit &quot;f&uuml;r
milit&auml;rische Sicherheit&quot;.
<p>
<blockquote><i>
Die Werte f&uuml;r die
Schl&uuml;sselgr&ouml;&szlig;en sind allerdings nur als Anhaltspunkte
anzusehen. Sie k&ouml;nnen auch direkt eingeben, welche
Gr&ouml;&szlig;e Ihr Schl&uuml;ssel haben soll. Je gr&ouml;&szlig;er
der Schl&uuml;ssel ist, desto sicherer ist die Verschl&uuml;sselung,
aber auch umso langsamer. Die meisten Anwender verwenden 1024 oder
512 Bit.
</i></blockquote>

<p>
Anschlie&szlig;end m&ouml;chte PGP eine User-ID wissen, d.h. einen
Namen, der angibt, zu wem der Schl&uuml;ssel eigentlich geh&ouml;ren
soll. Vorzugsweise sollte der gesamte Name verwendet werden, da so
weniger Verwechslungsm&ouml;glichkeiten entstehen. Eingeb&uuml;rgert
hat sich die Methode, hinter dem Realnamen in &lt;spitzen
Klammern&gt; eine E-Mail-Adresse anzugeben, also z.B.:
<pre><kbd>
Patrick Lenz &lt;MASTER@random.zer.sub.org&gt;
Johanna Wiesm&uuml;ller &lt;smb4423@rz.uni-sonstwo.de&gt;
</kbd></pre>

<p>
Sollten Sie keine E-Mail-Adresse haben, verwenden Sie irgend etwas
anderes, was sicherstellt, da&szlig; die angegebene ID einmalig ist,
beispielsweise Ihre Telefonnummer:
<p>
<kbd>
Kai Fliemann &lt;V+49-4711-123456&gt;
</kbd>

<p>
Nun fragt PGP Sie nach einem Mantra, mit dem Ihr privater
Schl&uuml;ssel gesch&uuml;tzt werden soll. Hierbei handelt es sich um
die gr&ouml;&szlig;ere Ausgabe eines Passwortes, die beliebig lang
sein darf. Ohne dieses Mantra ist Ihr privater Schl&uuml;ssel
praktisch wertlos. Dieses Mantra d&uuml;rfen Sie auf keinen Fall
vergessen, sonst haben Sie keine M&ouml;glichkeit, wieder an Ihren
privaten Schl&uuml;ssel zu kommen.
<p>
<blockquote><i>
Au&szlig;erdem gilt das &Uuml;bliche: Das Mantra
nicht aufschreiben, kein kurzes oder anderweitig leicht zu ratendes
Mantra verwenden (&quot;Alea iacta est&quot; w&auml;re viel zu
simpel, auch &quot;Ich liebe Moni!&quot; sollte nicht verwendet
werden), und das Mantra nicht &uuml;ber ein Netzwerk eintippen.
Normalerweise erscheint das Mantra nie am Bildschirm, es sei denn,
die Konfiguration wurde entsprechend ge&auml;ndert.
</i></blockquote>

<p>
PGP unterscheidet beim Mantra zwischen Gro&szlig;- und
Kleinschreibung. Neben Buchstaben kann das Mantra auch Ziffern,
Satzzeichen usw. enthalten. Sollten Sie es tats&auml;chlich
vorziehen, kein Mantra zu verwenden, dr&uuml;cken Sie einfach
<kbd>RETURN</kbd>. Das halte ich aber f&uuml;r eine sehr schlechte
Idee.
<p>
Um das Schl&uuml;sselpaar zu erzeugen, braucht PGP gro&szlig;e,
wirklich zuf&auml;llige Zufallszahlen. Diese werden nun abgeleitet
aus den Zeitabst&auml;nden zwischen einigen Tastendr&uuml;cken, um
die Sie gebeten werden. Tippen Sie einfach ein wenig Zufallstext in
st&auml;ndig wechselnder Geschwindigkeit. PGP sagt Ihnen, wieviel Sie
tippen m&uuml;ssen.
<p>
Anschlie&szlig;end k&ouml;nnen Sie erst einmal Kaffeetrinken gehen,
die Schl&uuml;sselerzeugung ist ein langsamer Proze&szlig;. Aber sie
wird ja nur einmal ausgef&uuml;hrt.
<p>
Die frisch erzeugten Schl&uuml;ssel kommen in die Bunde mit
&ouml;ffentlichen bzw. geheimen Schl&uuml;sseln. Von dort aus kann
der &ouml;ffentliche Schl&uuml;ssel sp&auml;ter (mit der Option
<kbd>-kx</kbd>) in eine eigene Datei kopiert werden, die Sie dann
weitergeben k&ouml;nnen. So k&ouml;nnen Ihre Freunde und Bekannten
Ihren &ouml;ffentlichen Schl&uuml;ssel zu ihren Dateien
hinzuf&uuml;gen.
<p>
Den privaten Schl&uuml;ssel sollten Sie nat&uuml;rlich niemals
weitergeben. Auch sollten Sie darauf achten, Ihr Schl&uuml;sselpaar
selbst zu erzeugen und keine Schl&uuml;ssel f&uuml;r Freunde zu
erstellen. Der private Schl&uuml;ssel sollte nicht auf einem Rechner
liegen, der f&uuml;r andere Benutzerinnen zug&auml;nglich ist, auch
wenn er durch ein Mantra gesch&uuml;tzt ist.

<a name="aufnehmen">
<h1>Einen Schl&uuml;ssel in den Schl&uuml;sselbund aufnehmen</h1>
</a>

Um einen &ouml;ffentlichen Schl&uuml;ssel in den eigenen Bund mit
&ouml;ffentlichen Schl&uuml;sseln aufzunehmen, benutzen Sie folgenden
Aufruf:
<p>
<kbd>
pgp -ka Datei [Schl&uuml;sselbund]
</kbd>

<p>
Die [eckigen Klammern] kennzeichnen eine Eingabe, die nicht unbedingt
erforderlich ist; die Klammern selbst d&uuml;rfen nicht mit
eingegeben werden.
<p>
Ohne Angabe wird <kbd>pubring.pgp</kbd> bei &ouml;ffentlichen bzw.
<kbd>secring.pgp</kbd> bei privaten Schl&uuml;sseln verwendet.
<p>
<kbd>Datei</kbd> ist diejenige Datei, die den oder die neuen
Schl&uuml;ssel enth&auml;lt, <kbd>Schl&uuml;sselbund</kbd> die Datei,
die den &ouml;ffentlichen Schl&uuml;sselbund enth&auml;lt.
<p>
Wird PGP mit diesem Befehl aufgerufen, dann pr&uuml;ft es
zun&auml;chst, ob der Schl&uuml;ssel schon bekannt ist. In diesem
Fall wird er nicht ein weiteres Mal eingebunden, sondern auf neue
Unterschriften und/oder Benutzer-IDs untersucht, die gegebenenfalls
in den Schl&uuml;sselbund aufgenommen werden. PGP durchsucht die
komplette Datei und bearbeitet alle darin enthaltenen Schl&uuml;ssel
auf diese Art und Weise. Was unterschriebene Schl&uuml;ssel sind,
wird weiter unten erl&auml;utert.

<a name="entfernen">
<h1>Einen Schl&uuml;ssel oder eine Benutzer-ID aus dem
Schl&uuml;sselbund entfernen</h1>
</a>

Der Befehl hierf&uuml;r lautet
<p>
<kbd>
pgp -kr Benutzer-ID [Schl&uuml;sselbund]
</kbd>

<p>
Wird ein Schl&uuml;ssel gefunden, der zu der angegebenen ID
pa&szlig;t, fragt PGP, ob Sie diesen entfernen m&ouml;chten, bzw.
wenn der Schl&uuml;sel mehrere IDs hat, ob Sie ihn ganz entfernen
m&ouml;chten oder nur die eine oder andere ID. Geben Sie keine
Schl&uuml;sseldatei an, verwendet PGP <kbd>pubring.pgp</kbd>.(*)
<p>
<hr><i>
 (*)Sie m&uuml;ssen nicht die vollst&auml;ndige Benutzer-ID angeben. Es
gen&uuml;gt bereits ein kurzer Textauszug aus der ID, z.B. der
Nachname. Dies gilt &uuml;brigens f&uuml;r alle Befehle, bei denen
die Benutzer-ID anzugeben ist, mit Ausnahme der Eingabe einer neuen
ID bei der Schl&uuml;sselgenerierung und dem &Auml;ndern der ID
(<kbd>pgp -kg</kbd> und <kbd>pgp -ke</kbd>). d.&Uuml;.
</i><hr>

<a name="inhalt">
<h1>Inhaltsangabe des Schl&uuml;sselbunds</h1>
</a>

Diese erhalten Sie mit dem Befehl
<p>
<kbd>
pgp -kv[v] [Benutzer-ID] [Schl&uuml;sselbund]
</kbd>

<p>
Geben Sie eine Benutzer-ID an, werden alle Schl&uuml;ssel
aufgelistet, die den angegebenen Text enthalten, ansonsten alle
Schl&uuml;ssel der Datei (siehe Abb. 1). Geben Sie keinen
Schl&uuml;sselbund an, wird <kbd>pubring.pgp</kbd> verwendet.
Verwenden Sie die Option <kbd>-kvv</kbd>, werden zus&auml;tzlich zu
den Schl&uuml;sseln alle Unterschriften ausgegeben.

<a name="extract">
<h1>Einen Schl&uuml;ssel in eine eigene Datei kopieren</h1>
</a>

Um einen Schl&uuml;ssel in eine eigene Datei zu kopieren (die Sie
beispielsweise weitergeben k&ouml;nnen), verwenden Sie den Befehl
<p>
<kbd>
pgp -kx Benutzer-ID [Zieldatei] [Schl&uuml;sselbund]
</kbd>

<p>
Wird die Angabe der Zieldatei weggelassen, fragt PGP, wohin Sie den
Schl&uuml;ssel kopieren m&ouml;chten. Bei dieser Operation bleibt der
Schl&uuml;sselbund vollst&auml;ndig, der Schl&uuml;ssel wird nur
kopiert.
<p>
Ist der Schl&uuml;ssel unterschrieben, dann werden die Unterschriften
ebenfalls mitkopiert. Wollen Sie den Schl&uuml;ssel als Text
verschicken (beispielsweise im Internet, Mausnetz oder Bitnet oder
auch als &quot;Anh&auml;ngsel&quot; an eine Nachricht), benutzen Sie
den Befehl
<p>
<kbd>
pgp -kxa Benutzer-ID [Zieldatei] [Schl&uuml;sselbund]
</kbd>

<h1><a name=[ManiSchutz]>&Ouml;ffentliche Schl&uuml;ssel vor Manipulation 
sch&uuml;tzen</a></h1>

PGP bietet ein Verschl&uuml;sselungssystem, das mit &ouml;ffentlichen
Schl&uuml;sseln arbeitet. Diese brauchen nicht vor Entdeckung
gesch&uuml;tzt zu werden. Im Gegenteil, je weiter sie verbreitet
sind, desto besser. Andererseits ist es sehr wichtig, bei
&ouml;ffentlichen Schl&uuml;sseln sicherzugehen, von wem sie stammen.
Hier liegt wahrscheinlich die gr&ouml;&szlig;te Schwachstelle eines
jeden Systems mit &ouml;ffentlichen Schl&uuml;sseln. Lassen Sie uns
ein kleines Desaster basteln und anschlie&szlig;end kl&auml;ren, wie
sich derartige Situationen mit PGP vermeiden lassen.

<h3>Eine dumme Situation</h3>

Nehmen wir an, Sie wollen Alice eine eher private Nachricht schicken.
Dazu holen Sie sich aus einer &ouml;ffentlichen Quelle Alices
&ouml;ffentlichen Schl&uuml;ssel, verschl&uuml;sseln die Nachricht
damit und senden sie &uuml;ber eine oder mehrere MailBoxen an Alice.
<p>
So weit, so gut, aber leider hat, was keiner wu&szlig;te, Charlie
eine M&ouml;glichkeit gefunden, um sich selbst auf dem Weg
einzuh&auml;ngen. (Das ist nicht weiter schwierig.) Charlie hat also
eine M&ouml;glichkeit, den gesamten E-Mail-Verkehr von und zu Alice
abzufangen, zu ver&auml;ndern oder einfach mitzulesen. Er ersetzt den
von Alice ver&ouml;ffentlichten Schl&uuml;ssel durch einen
&ouml;ffentlichen Schl&uuml;ssel, den er selbst erzeugt hat. Da
dieser Schl&uuml;ssel nat&uuml;rlich die ID von Alice tr&auml;gt,
verwenden Sie ihn, Charlie f&auml;ngt die Nachricht ab, liest sie und
schickt sie dann entweder - mit Alices wirklichem &ouml;ffentlichen
Schl&uuml;ssel codiert - weiter, ver&auml;ndert sie eventuell
zwischendurch, oder schickt sie &uuml;berhaupt nicht weiter. Da er
den privaten Schl&uuml;ssel f&uuml;r den Schl&uuml;ssel hat, von dem
Sie glauben, er sei Alices, kann er dies tun. Alice erhielt
nat&uuml;rlich ebenfalls einen falschen Schl&uuml;ssel, als sie Ihren
erhalten wollte, so da&szlig; auch das Unterschreiben von Nachrichten
ohne Probleme zu f&auml;lschen ist.

<h3>PGPs Ausweg</h3>

Es gibt nur einen Ausweg aus diesem Dilemma: &ouml;ffentliche
Schl&uuml;ssel m&uuml;ssen vor derartigen Angriffen gesch&uuml;tzt
werden. Wenn Alice Ihnen ihren &ouml;ffentlichen Schl&uuml;ssel
direkt in die Hand gedr&uuml;ckt hat, stellt das kein Problem dar,
aber wenn Sie in der Schweiz wohnen und Alice in Norwegen, kann das
etwas problematisch sein.
<p>
Vielleicht kennen Sie aber jemanden, dem Sie vertrauen und der
zuf&auml;llig gerade nach Norwegen in Urlaub f&auml;hrt. Diesem
netten Menschen k&ouml;nnten Sie dann ja Ihren &ouml;ffentlichen
Schl&uuml;ssel mitgeben, und er w&uuml;rde Ihnen den von Alice
bringen. Falls Alice den Menschen nicht zuf&auml;llig ebenfalls gut
kennt, kann sie zwar immer noch nicht sicher sein, da&szlig; der
Schl&uuml;ssel, den sie hat, von Ihnen ist, aber Sie k&ouml;nnen
relativ sicher sein.
<p>
Nun ist es aber eher unpraktisch, zu allen E-Mail-Bekanntschaften
Freunde hinzuschicken oder selber hinzufahren, um Schl&uuml;ssel
auszutauschen. Daher bietet PGP die M&ouml;glichkeit,
Schl&uuml;ssel/Benutzer-Zuordnungen zu unterschreiben. Nehmen wir an,
Sie kennen au&szlig;er Alice auch noch deren Halbbruder David. David
hat Sie letzten Sommer besucht und bei der Gelegenheit seinen
&ouml;ffentlichen Schl&uuml;ssel dagelassen. Unterschreibt David nun
den &ouml;ffentlichen Schl&uuml;ssel von Alice, k&ouml;nnen Sie -
wenn Sie ihm nicht zutrauen, da&szlig; er einen falschen oder
zweifelhaften Schl&uuml;ssel unterschreiben w&uuml;rde - davon
ausgehen, da&szlig; der Schl&uuml;ssel authentisch ist.
<p>
David w&uuml;rde also Alices &ouml;ffentlichen Schl&uuml;ssel
unterschreiben, und Alice k&ouml;nnte diesen unterschriebenen
Schl&uuml;ssel versenden. Charlie kann zwar den Schl&uuml;ssel
abfangen und durch seinen eigenen ersetzen, er kann aber nicht Davids
Unterschrift unter diesen Schl&uuml;ssel setzen. Auch wenn er einen
von David signierten Schl&uuml;ssel hat, den David ihm unterschrieben
hat, n&uuml;tzt ihm das nichts, da eine Unterschrift immer eine
Zuordnung von ID und Schl&uuml;ssel best&auml;tigt.
<p>
Es w&auml;re sogar m&ouml;glich, da&szlig; eine weithin bekannte und
allgemein als vertrauensw&uuml;rdig eingestufte Person sich darauf
spezialisiert, derartige Unterschriften zu leisten.(*) Diese Person
k&ouml;nnte also als Keyserver oder &quot;Beglaubigungsstelle&quot;
arbeiten. Jeder, der sich an diesem Konzept beteiligen m&ouml;chte,
braucht nur den &ouml;ffentlichen Schl&uuml;ssel dieser Instanz (der
nat&uuml;rlich auf extrem vertrauensw&uuml;rdigen Kan&auml;len zu ihm
kommen mu&szlig;) zu kennen und kann damit alle Unterschriften
&uuml;berpr&uuml;fen.
<p>
<hr><i>
 (*)Bei RIPEM ist etwas derartiges von einer Zentralautorit&auml;t
vorgesehen. d.&Uuml;.
</i><hr>

Dieses Konzept ist vor allem f&uuml;r gro&szlig;e, zentral gesteuerte
Einrichtungen, wie Betriebe oder staatliche Verwaltungsapparate
interessant. PGP zielt mehr auf ein dezentrales Beglaubigungssystem,
in dem jeder Benutzer die Schl&uuml;ssel derjenigen Leute, die er
pers&ouml;nlich kennt oder die er auf Kongressen oder sonstwo trifft
(und &uuml;ber deren Identit&auml;t er sicher ist), unterschreibt.
Das spiegelt eher den nat&uuml;rlichen Umgang mit Mitmenschen wider
und bietet jedem die M&ouml;glichkeit, selbst zu entscheiden, wem er
vertraut, wenn es um glaubw&uuml;rdige Unterschriften geht.
<p>
<em>Bitte beachten Sie dieses Konzept!</em>
<p>
Auch wenn es unwichtig erscheint: Diese ganze Geschichte ist im
Endeffekt die Achillesferse des ganzen Systems. F&uuml;r vertrauliche
Nachrichten (und wenn Sie l&auml;ngere Zeit E-Mail benutzen, werden
Sie mit Sicherheit vertrauliche Nachrichten schreiben) sollten Sie
niemals einen Schl&uuml;ssel verwenden, von dem Sie nicht sicher sein
k&ouml;nnen, von wem er stammt.
<p>
Von der Echtheit eines Schl&uuml;ssels k&ouml;nnen Sie &uuml;berzeugt
sein, wenn Sie ihn direkt von seinem Besitzer bekommen haben, oder
wenn er von einer Person unterschrieben ist, der Sie vertrauen, und
von der Sie einen Schl&uuml;ssel haben, der mit Sicherheit echt ist.
<p>
Und: Unterschreiben Sie <em>niemals</em> einen Schl&uuml;ssel, von
dem Sie nicht absolut und hundertprozentig sicher sein k&ouml;nnen,
da&szlig; er von der Person stammt, deren ID Sie unterzeichnen. Mit
der Unterschrift b&uuml;rgen Sie mit Ihrem guten Namen f&uuml;r die
Echtheit des Schl&uuml;ssels. Unterschreiben Sie keine
Schl&uuml;ssel, weil Sie jemanden gut kennen, der diese
Schl&uuml;ssel unterschrieben hat, sondern nur dann, wenn Sie
wirklich selber unabh&auml;ngig sicher sind und sein k&ouml;nnen,
da&szlig; der Schl&uuml;ssel echt ist. Unterschreiben Sie
vorzugsweise nur Schl&uuml;ssel, die Sie direkt vom Besitzer erhalten
haben.(*) Eine Unterschrift unter einen Schl&uuml;ssel zu setzen,
setzt eine viel gr&ouml;&szlig;ere Sicherheit in punkto
Eigent&uuml;merschaft voraus als das Verwenden eines Schl&uuml;ssels.
Weitere Erl&auml;uterungen dazu finden Sie im zweiten Teil dieser
Anleitung.
<p>
<hr><i>
 (*)Eine weitere M&ouml;glichkeit der Echtheitskontrolle ist die
&Uuml;berpr&uuml;fung des Fingerabdrucks eines Schl&uuml;ssels. Auch
diese setzt selbstverst&auml;ndlich voraus, da&szlig; die
Identit&auml;t der Schl&uuml;sselinhaberin bekannt ist. Weitere
Informationen zum Fingerabdruck finden Sie im zweiten Teil des
Handbuchs. d.&Uuml;.
</i><hr>
Denken Sie auch daran, da&szlig; eine Unterschrift unter einem
Schl&uuml;ssel nichts dar&uuml;ber aussagt, wie vertrauensw&uuml;rdig
die Person ist, deren Schl&uuml;ssel Sie unterschrieben haben,
sondern da&szlig; die Unterschrift nur daf&uuml;r b&uuml;rgt,
da&szlig; dieser Schl&uuml;ssel wirklich zu der Person geh&ouml;rt.
Einen Schl&uuml;ssel als echt anzusehen ist eine Sache, dem Besitzer
des Schl&uuml;ssels zu vertrauen, eine andere.
<p>
Auch ist Vertrauen nicht unbedingt &uuml;bertragbar: Ich vertraue
einem Freund und bin mir sicher, da&szlig; er nicht l&uuml;gt. Wenn
er nun sicher ist, da&szlig; der US-Pr&auml;sident nicht l&uuml;gt,
mu&szlig; ich nicht notwendigerweise davon ausgehen, da&szlig; das
stimmt. Wenn ich Davids Unterschrift unter Alices Schl&uuml;ssel
vertraue und David Alices Unterschrift unter Charlies Schl&uuml;ssel
vertraut, brauche ich noch lange nicht Charlies Schl&uuml;ssel als
echt anzusehen.
<p>
Daher ist es sinnvoll, unter seinem eigenen Schl&uuml;ssel
einigerma&szlig;en viele Unterschriften zu sammeln und den so
signierten Schl&uuml;ssel m&ouml;glichst &ouml;ffentlich zu
verbreiten. Gute Methoden zum Verbreiten eines Schl&uuml;ssels sind
beispielsweise entsprechende Foren in Computernetzen oder die
&quot;public key server&quot; im Internet. Unterschreiben Sie einen
Schl&uuml;ssel, dann sollten Sie diesen mit Unterschrift an den
Besitzer schicken.
<p>
PGP &uuml;berwacht selbstt&auml;tig, welche Schl&uuml;ssel in Ihrem
Bund ausreichend mit Unterschriften best&auml;tigt sind, die von
Leuten geleistet wurden, die Sie als vertrauensw&uuml;rdig eingestuft
haben. Sie m&uuml;ssen PGP nur mitteilen, welche Leute Sie als
vertrauensw&uuml;rdig einstufen. Haben Sie selbst diese
Schl&uuml;ssel unterschrieben und somit f&uuml;r Ihr PGP voll
best&auml;tigt, k&ouml;nnen Sie mit Hilfe einer oder mehrerer
Unterschriften unter einem Schl&uuml;ssel, den Sie neu kriegen,
diesen direkt als best&auml;tigt einstufen lassen. Wie gesagt,
vollautomatisch. Weitere Informationen zum Unterschreiben fremder
Schl&uuml;ssel finden Sie im Abschnitt <a
href=#unterschreibfrem>Wie untersucht PGP, welche
Schl&uuml;ssel g&uuml;ltig sind?</a>.

<h3>Die Schl&uuml;ssel und andere Leute</h3>

Stellen Sie sicher, da&szlig; niemand au&szlig;er Ihnen Zugriff auf
Ihren Bund mit &ouml;ffentlichen Schl&uuml;sseln hat. Die
&Uuml;berpr&uuml;fung von Unterschriften h&auml;ngt davon ab, welche
&ouml;ffentlichen Schl&uuml;ssel bereits als vertrauensw&uuml;rdig
eingestuft sind. Daher sollten Sie nicht nur auf Ihren privaten
Schl&uuml;ssel aufpassen, sondern auch beim Umgang mit Ihrer privaten
Sammlung &ouml;ffentlicher Schl&uuml;ssel Vorsicht walten lassen. Das
hei&szlig;t nicht unbedingt, die Datei davor zu sch&uuml;tzen,
da&szlig; sie gefunden werden kann, aber auch das kann Sinn machen.
Schlie&szlig;lich geht es niemanden etwas an, wem Sie vertrauen.
<p>
Da der eigene &ouml;ffentliche Schl&uuml;ssel als Aufh&auml;nger
aller Vertrauensketten derjenige ist, der am besten gesch&uuml;tzt
sein mu&szlig;, bietet PGP die M&ouml;glichkeit, diesen mit einer
Sicherheitskopie zu vergleichen, die auf einem
schreibgesch&uuml;tzten Medium (Diskette mit Schreibschutz,
Lochstreifen, CD) gespeichert sein sollte. F&uuml;r n&auml;here
Informationen lesen Sie bitte die Beschreibung des Kommandos <kbd>pgp
-kc</kbd> im zweiten Teil.
<p>
PGP geht normalerweise davon aus, da&szlig; Sie Ihre Schl&uuml;ssel
sorgsam verwalten und vor herumstreunenden Kindern und
B&ouml;sewichten sch&uuml;tzen. Wenn jemand an Ihre
Schl&uuml;sselbunde herankommt und sie manipulieren kann, wird er
aller Wahrscheinlichkeit nach dasselbe mit dem PGP-Programm tun
k&ouml;nnen und es so ver&auml;ndern, da&szlig; alle
Schutzmechanismen wirkungslos sind.
<p>
Eine zugegebenerma&szlig;en eher umst&auml;ndliche Methode, die
Sammlung &ouml;ffentlicher Schl&uuml;ssel vor Manipulation zu
sch&uuml;tzen, ist die, die Schl&uuml;sselbunde mit dem eigenen
(privaten) Schl&uuml;ssel zu unterzeichnen. Beispielsweise
k&ouml;nnten Sie mit der Option <kbd>-sb</kbd> eine abgel&ouml;ste
Unterschrift erzeugen (siehe Abschnitt <a
href=pgp.2.1.html#[abgelunterschr]>Trennung einer Unterschrift von einer
Nachrichgt</a>). Leider m&uuml;&szlig;ten Sie
dann immer noch eine glaubw&uuml;rdige Kopie Ihres eigenen
Schl&uuml;ssels zur Hand haben, um die Unterschrift pr&uuml;fen zu
k&ouml;nnen. Dem Schl&uuml;ssel in der signierten Datei k&ouml;nnen
Sie nicht vertrauen, da ein Mensch, der diesen Schl&uuml;ssel
f&auml;lscht, ebensogut eine neue Unterschrift erzeugen kann.

<h1><a name=[G&uuml;ltigkeit]>Wie untersucht PGP,</a>
<a name=unterschreibfrem>welche Schl&uuml;ssel g&uuml;ltig sind?</a></h1>

Vor diesem Kapitel lesen Sie bitte das vorige: &quot;&Ouml;ffentliche
Schl&uuml;ssel vor Manipulation sch&uuml;tzen&quot;
<p>
PGP &uuml;berpr&uuml;ft, welche &ouml;ffentlichen Schl&uuml;ssel
Ihrer Sammlung als g&uuml;ltig eingestuft sind. Dazu m&uuml;ssen Sie
PGP mitteilen, welchen Leuten Sie genug Vertrauen entgegenbringen, um
ihre Unterschriften als g&uuml;ltige Verifikationen f&uuml;r neue
Schl&uuml;ssel einzustufen. Hiervon ausgehend kann PGP neu
hinzukommende Schl&uuml;ssel direkt auf ihre G&uuml;ltigkeit hin
pr&uuml;fen. Und nat&uuml;rlich k&ouml;nnen Sie selbst auch
Schl&uuml;ssel unterschreiben.
<p>
PGP verwendet zwei verschiedene Kriterien, um Schl&uuml;ssel
einzustufen, bitte bringen Sie sie nicht durcheinander:
<ol>
<li> Geh&ouml;rt der Schl&uuml;ssel wirklich zu der in der ID
angegebenen Person?
<li> Ist diese Person glaubw&uuml;rdig genug, andere Schl&uuml;ssel zu
best&auml;tigen?
</ol>
Die Antwort auf die erste Frage berechnet PGP, wobei die Antwort auf
die zweite Frage f&uuml;r andere Benutzer zu Rate gezogen wird. Die
Antwort auf die zweite Frage kann PGP nicht selbst&auml;ndig finden,
sondern Sie m&uuml;ssen sie geben. Geben Sie bei Frage 2 f&uuml;r
einige ausgew&auml;hlte Benutzer als Antwort &quot;Ja&quot; oder
&quot;Na ja, einigerma&szlig;en&quot;, dann kann PGP Frage 1 f&uuml;r
andere Schl&uuml;ssel bejahen, die von diesen ausgew&auml;hlten
Benutzern unterschrieben wurden.
<p>
Schl&uuml;ssel, die von vertrauensw&uuml;rdigen Personen
unterschrieben wurden, werden von PGP als echt eingestuft. Um als
vertrauensw&uuml;rdig gelten zu k&ouml;nnen, mu&szlig; ein
Schl&uuml;ssel von PGP als echt angesehen werden, also entweder von
Ihnen selbst oder anderen vertrauensw&uuml;rdigen Personen signiert
sein.
<p>
Sie m&uuml;ssen aber nicht allen Leuten gleichweit vertrauen. PGP
bietet die M&ouml;glichkeit, verschiedene Stufen des Vertrauens zu
vergeben. Ihre Einstufung einer Person in Bezug auf
Glaubw&uuml;rdigkeit sollte nicht nur Ihre Einsch&auml;tzung der
allgemeinen Zuverl&auml;ssigkeit dieser Person widerspiegeln, sondern
auch Ihre Einsch&auml;tzung dar&uuml;ber, wie gut die Person das
Prinzip der Unterschriften verstanden hat und wie ernst sie die damit
verbundene Verantwortung nimmt. Sie k&ouml;nnen einer Person die
Vertrauensstufen &quot;ich wei&szlig; nicht&quot;, &quot;nein&quot;,
&quot;meistens ja&quot; oder &quot;ja&quot; geben. Diese Information
wird mit dem Schl&uuml;ssel zusammen in Ihrer Sammlung gespeichert,
aber wenn sie einen Schl&uuml;ssel aus Ihrem Schl&uuml;sselbund
herauskopieren, wird diese Angabe nicht mitkopiert. Ihre private
Meinung geht schlie&szlig;lich niemanden etwas an, wenn Sie sie nicht
ausdr&uuml;cklich mitteilen wollen.
<p>
Wenn PGP einen Schl&uuml;ssel auf seine G&uuml;ltigkeit hin
untersucht, betrachtet es die Vertrauenslevel aller Schl&uuml;ssel,
mit denen dieser Schl&uuml;ssel unterschrieben wurde. Sie k&ouml;nnen
einstellen, wie viele Unterschriften von welcher Glaubw&uuml;rdigkeit
gebraucht werden, um einen Schl&uuml;ssel zu best&auml;tigen. In der
Standardeinstellung h&auml;lt PGP einen Schl&uuml;ssel f&uuml;r echt,
wenn er von einer mit &quot;ja&quot; eingestellten Unterschrift
geziert wird oder wenn er zwei Unterschriften mit der Einstellung
&quot;meistens ja&quot; tr&auml;gt.
<p>
Der eigene &ouml;ffentliche Schl&uuml;ssel gilt
definitionsgem&auml;&szlig; als vertrauensw&uuml;rdig und echt, seine
Unterschrift reicht immer aus, um einen Schl&uuml;ssel als echt zu
best&auml;tigen.
<p>
Mit der Zeit werden Sie einige Schl&uuml;ssel sammeln, die Sie als
mehr oder weniger vertrauensw&uuml;rdig einstufen. Andere Leute, die
teilweise dieselben Schl&uuml;ssel haben werden, werden andere
Einsch&auml;tzungen vergeben. Und mit der Zeit werden alle Benutzer
ihre Schl&uuml;ssel mit immer mehr Unterschriften verteilen. Dadurch
ist das so gesponnene Vertrauensnetz sehr viel weniger
gef&auml;hrdet, durch eine Stelle zu zerrei&szlig;en, die
schw&auml;cher ist, als vorher angenommen.
<p>
Dieses dezentrale Konzept ist nicht das einzig m&ouml;gliche. Es
g&auml;be auch die M&ouml;glichkeit, Schl&uuml;ssel von einer
zentralen Instanz unterschreiben zu lassen, und bei einigen
verwandten Verfahren wird das auch gemacht, beispielsweise bei
Privacy Enhanced Mail (PEM). Dieses Schema basiert auf einer
vorgegeben Hierarchie, in der andere Leute festlegen, wem Sie zu
vertrauen haben. PGP geht den anderen Weg, bei dem Sie diese
Entscheidung selber f&auml;llen m&uuml;ssen. PGP ist f&uuml;r Leute,
die ihren Fallschirm selber zusammenlegen.

<a name="sign">
<h1>Einen Schl&uuml;ssel unterschreiben</h1>
</a>

Mit dem folgenden Befehl wird ein Schl&uuml;ssel unterschrieben:
<p>
<kbd>
pgp -ks Benutzer-ID [-u eigene_ID]
</kbd>

<p>
<blockquote><i>
Sie sollten eine solche Unterschrift nur leisten,
wenn Sie sicher sind, da&szlig; Sie den Sinn und die Funktionsweise
von Unterschriften unter Schl&uuml;sseln verstanden haben. Verstehen
Sie diesen Warnhinweis bitte nicht als Arroganz von Leuten, die
meinen, immer alles besser zu wissen. Wir haben in Diskussionen in
verschiedenen Foren h&auml;ufig feststellen m&uuml;ssen, da&szlig;
die Frage, welche Voraussetzungen erf&uuml;llt sein m&uuml;ssen,
damit man einen Schl&uuml;ssel unterschreiben kann, das
wahrscheinlich schwierigste Thema bei PGP ist. Auf keinen Fall
sollten Sie mit Unterschriften unter PGP-Schl&uuml;sseln so
gro&szlig;z&uuml;gig sein, wie manche Prominente ihre Autogramme
verteilen. Es geht hier nicht um Unterschriften im Sinne von
Autogrammen f&uuml;r Sammler, sondern um Unterschriften unter
elektronische Dokumente.
</i></blockquote>

<a name=diebstahl>
<h1>Private Schl&uuml;ssel vor Diebstahl sch&uuml;tzen</h1>
</a>

Sch&uuml;tzen Sie sowohl Ihren privaten Schl&uuml;ssel als auch Ihr
Mantra sorgf&auml;ltig. Sollte Ihr privater Schl&uuml;ssel jemals das
Licht der gro&szlig;en, weiten Welt erblicken oder auch nur mit einem
Anderen fremdgehen, dann sollten Sie m&ouml;glichst schnell
m&ouml;glichst vielen Leuten davon erz&auml;hlen, nach
M&ouml;glichkeit allen, die den &ouml;ffentlichen Schl&uuml;ssel
haben. Viel Gl&uuml;ck dabei. M&ouml;glichst bevor irgend jemand
Unsinn damit anstellt, wie z.B. Schl&uuml;ssel damit zu
unterschreiben oder in Ihrem Namen auf Nachrichten zu antworten.
<p>
Das erste, was Sie tun sollten, um Ihren Schl&uuml;ssel zu
sch&uuml;tzen, ist, den Schl&uuml;ssel selbst immer unter Kontrolle
zu haben. Das hei&szlig;t, Sie sollten ihn nicht auf einem Computer
lassen, wo er dem Zugriff anderer Personen ausgesetzt ist. Wenn Sie
keine M&ouml;glichkeit dazu haben, weil sie beispielsweise Ihren
gesamten E-Mail-Verkehr von einer Unix-Maschine im B&uuml;ro aus
abwickeln, sollten Sie Ihren Schl&uuml;ssel immer auf einer
schreibgesch&uuml;tzten Diskette mit sich tragen und von da aus
arbeiten. Vergessen Sie dabei Ihre Sicherheitskopie nicht. Einen
privaten Sch&uuml;ssel auf einem solchen System, insbesondere auf
einem vernetzten Rechner, aufzubewahren, ist nicht gerade sinnvoll.
Und Sie sollten PGP erst recht nicht &uuml;ber ein Netzwerk oder ein
Modem benutzen. Es w&auml;re zu einfach, Ihr Mantra mitzuschneiden.
<p>
Und was f&uuml;r Passw&ouml;rter allgemein gilt: Sie sollten Ihr
Mantra auf gar keinen Fall irgendwo aufschreiben und am Monitor,
unter der Tastatur oder sonst irgendwo an Ihrem Arbeitsplatz, in der
Aktentasche oder an welchem Ort auch immer aufbewahren, an den jeder
potentielle Eindringling gelangen kann. Das Sicherste ist immer noch,
es einfach im Kopf zu behalten.
<p>
Und: Bewahren Sie immer eine Sicherheitskopie Ihres privaten
Schl&uuml;ssels auf. Wenn Ihre Festplatte einmal den Geist aufgibt
und Sie ohne Ihren <kbd>secring.pgp</kbd> dastehen, k&ouml;nnen Sie
die ganze an Sie geschickte Post nicht mehr lesen.
<p>
Hier kommen wir bei einem Problem der dezentralen Methode zur
Schl&uuml;sselverifikation an: Da es keine Zentrale gibt, die
Schl&uuml;ssel best&auml;tigt, gibt es auch keine, die vor unsicher
gewordenen, da m&ouml;glicherweise in fremde H&auml;nde gefallenen
Schl&uuml;sseln, warnt. Sie k&ouml;nnen nur die Meldung, da&szlig;
Ihr Schl&uuml;ssel m&ouml;glicherweise bekannt wurde, m&ouml;glichst
weit verbreiten und darauf hoffen, da&szlig; diese Nachricht auch bei
allen Leuten ankommt, die davon erfahren sollten.
<p>
Sollte der Fall der F&auml;lle eintreten, sollte also sowohl Ihr
privater Schl&uuml;ssel als auch Ihr Mantra in fremde H&auml;nde
fallen, dann sollten Sie ein sogenanntes &quot;key compromise
certificate&quot; ausstellen. Dies ist eine Urkunde, die besagt,
da&szlig; Ihr Schl&uuml;ssel auf keinen Fall mehr verwendet werden
darf. Wenn Sie eine solche Urkunde ausstellen wollen, rufen Sie PGP
mit der Option <kbd>-kd</kbd> und Ihrer eigenen Schl&uuml;ssel-ID
auf. PGP macht dann Ihren &ouml;ffentlichen Schl&uuml;ssel
unbrauchbar und gibt Ihnen die M&ouml;glichkeit, mit <kbd>pgp -kxa
ID</kbd> die Urkunde in eine Datei zu packen, die Sie an die gesamte
Menschheit schicken sollten. Oder zumindest an den Teil, der Ihren
Schl&uuml;ssel haben k&ouml;nnte. Am besten schicken Sie Ihren neuen
Schl&uuml;ssel direkt mit. Siehe auch das n&auml;chste Kapitel.

<a name=zurueckziehen>
<h1>Einen Schl&uuml;ssel zur&uuml;ckziehen</h1>
</a>

Nehmen wir an, Ihr Schl&uuml;ssel ist mit dem passenden Mantra in
fremde H&auml;nde gefallen. Das sollten Sie der ganzen Welt
erz&auml;hlen. Nicht, um bedauert zu werden, sondern damit niemand
mehr diesem Schl&uuml;ssel vertraut. Daf&uuml;r m&uuml;ssen Sie eine
Schl&uuml;ssel-R&uuml;ckrufurkunde ausstellen. Der Befehl
hierf&uuml;r lautet:
<p>
<kbd>
pgp -kd Ihre-ID
</kbd>

<p>
Diese Urkunde tr&auml;gt dann auch noch Ihre Unterschrift und kann
wie zuvor der &ouml;ffentliche Schl&uuml;ssel verschickt werden.
Nat&uuml;rlich ist der Sicherheitsverlust des Schl&uuml;ssels nicht
der einzig denkbare Grund daf&uuml;r, ihn zur&uuml;ckzuziehen. In
allen F&auml;llen jedoch ist das Vorgehen dasselbe.

<a name="privatverloren">
<h1>Ich habe meinen privaten Schl&uuml;ssel verloren, was jetzt?</h1>
</a>

Normalerweise lassen sich Schl&uuml;ssel mit der Option
<kbd>-kd</kbd> zur&uuml;ckziehen. Da hierbei aber eine Unterschrift
n&ouml;tig ist, kann der Befehl nicht mehr aufgerufen werden, wenn
der private Schl&uuml;ssel verlorengeht. Also, was dann? Sie
k&ouml;nnen Ihren Schl&uuml;ssel nicht mehr auf dem oben genannten
Weg zur&uuml;ckziehen, Sie k&ouml;nnen aber auch keine mit dem
&ouml;ffentlichen Schl&uuml;ssel verschl&uuml;sselten Nachrichten
lesen. F&uuml;r zuk&uuml;nftige Versionen von PGP ist geplant, auch
in diesem Fall einen Mechanismus in Gang setzen zu k&ouml;nnen, der
den Schl&uuml;ssel mit Hilfe von als glaubw&uuml;rdig eingestuften
Personen unbrauchbar macht, aber wir reden im Moment &uuml;ber das
Jetzt. Und da bleibt Ihnen wohl keine andere M&ouml;glichkeit als
die, alle User zu bitten, Ihren Schl&uuml;ssel nicht mehr zu
verwenden.
<p>
Diese Nachricht sollten Sie von denselben Leuten unterschreiben
lassen, die auch Ihren Schl&uuml;ssel signiert haben. Die anderen
User k&ouml;nnen dann Ihren Schl&uuml;ssel mit dem Befehl
<p>
<kbd>
pgp -kd Ihre-ID
</kbd>

<p>
abschalten. Hierbei wird allerdings keine
Schl&uuml;ssel-R&uuml;ckrufurkunde ausgestellt und der Schl&uuml;ssel
kann mit demselben Befehl auch wieder angeschaltet werden.



<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.



<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
