<HTML>
<head>
<title>PGP = PGP installieren und bedienen</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#installation>Die Installation</a><br>
<a href=#bedienung>Bedienung PGPs</a><br>
 <a href=#kurzanleitung>Kurzanleitung am Bildschirm</a><br>
 <a href=#verschluesseln>Verschl&uuml;sseln einer Nachricht</a><br>
 <a href=#mehrfverschl>Verschl&uuml;sseln einer Nachricht f&uuml;r mehrere
Empf&auml;nger</a><br>
 <a href=#unterschr>Unterschreiben einer Nachricht</a><br>
 <a href=#unterschruversch>Unterschreiben und Verschl&uuml;sseln</a><br>
 <a href=#konvent>Konventionelle Verschl&uuml;sselung</a><br>
 <a href=#entschl>Entschl&uuml;sselung und Pr&uuml;fung der
Unterschrift</a><br>
 <a href=#zufall>Erzeugen einer Datei mit Zufallszahlen</a>

<hr>

<a name="installation">
<h1>Die Installation</h1>
</a>

Die MS-DOS-Version von PGP 2.6.2i ist in einer komprimierten
Archiv-Datei namens <kbd>pgp262i.zip</kbd> enthalten. (K&uuml;nftige Versionen von PGP
werden Namen in der Form <kbd>pgpxy.zip</kbd> haben, wobei
<kbd>xy</kbd> f&uuml;r die Versionsnummer x.y steht.) Diese
Archivdatei kann mit dem MS-DOS Sharewareprogramm PKUNZIP ausgepackt
werden oder unter Unix mit dem Kommando unzip. Zu dem Programmpaket
geh&ouml;rt eine Datei namens <kbd>readme.doc</kbd>, die man auf
jeden Fall vor der Installation von PGP lesen sollte. Diese Datei
enth&auml;lt die aktuellsten Informationen dar&uuml;ber, was in der
jeweiligen Version von PGP neu ist, und Informationen &uuml;ber die
anderen Dateien des Programmpakets. Details zur Installation auf
verschiedenen Rechnern und Betriebssystemen stehen in der Datei
<kbd>setup.doc</kbd>.
<p>
Wenn bereits PGP 1.0 installiert ist, sollte diese Version
gel&ouml;scht werden, weil sie von niemandem mehr verwendet wird. Wer
die alte Version trotzdem behalten m&ouml;chte, sollte die
Programmdatei in pgp1.exe umbenennen, um Namenskonflikte mit der
neuen Version zu vermeiden.(*)
<p>
<hr><i>
 (*)Version 1.0 ist nicht kompatibel mit Version 2.x. Beispielsweise
m&uuml;ssen neue Schl&uuml;ssel erzeugt werden. N&auml;heres hierzu
steht <a href=pgp.2.6.html#kompatibel>hier</a>. d.&Uuml;.
</i><hr>

F&uuml;r die Installation unter MS-DOS wird <kbd>pgpxy.zip</kbd>
einfach in ein geeignetes Verzeichnis auf der Festplatte kopiert
(z.B. <kbd>c:\pgp</kbd>) und mit pkunzip ausgepackt. F&uuml;r eine
bequem nutzbare Installation sollte auch die <kbd>autoexec.bat</kbd>
ge&auml;ndert werden. N&auml;heres hierzu steht im Abschnitt <a
href=pgp.1.6.html#PGPPATH>PGPPATH</a>.(*) Dies kann aber auch sp&auml;ter
erfolgen, wenn man ein wenig mit PGP gespielt und dieses Handbuch
durchgelesen hat.
<p>
<hr><i>
 (*)Matthias Jordan hat ein Programm namens XP-PGP geschrieben, das die
Installation und Einbindung in das Programm CrossPoint von Peter
Mandrella &uuml;bernimmt. d.&Uuml;.
</i><hr>
<blockquote><i>
<p>
Der deutsche Sprachkit, bestehend aus dem
Handbuch, den Dateien <kbd>config.txt</kbd>, <kbd>language.txt</kbd>,
<kbd>de.hlp</kbd>, <kbd>readme.de</kbd> und <kbd>setup.de</kbd>,
befindet sich in einer Datei namens <kbd>pgp-germ.zip</kbd>. Der
Sprachkit sollte <em>nach</em> dem eigentlichen Programmpaket
installiert werden, damit die Dateien <kbd>language.txt</kbd> und
<kbd>config.txt</kbd> in ihrer deutschen Version auf der Festplatte
vorhanden sind. Die Dateien <kbd>readme.de</kbd> und
<kbd>setup.de</kbd> sind nicht immer auf demselben Stand wie ihre
englischen &Auml;quivalente, weil wir als &Uuml;bersetzer nicht bei
jeder &Auml;nderung eine aktuelle Version der englischen Originale
<kbd>readme.doc</kbd> und <kbd>setup.doc</kbd> zugeschickt bekommen.
Dehalb ist es ratsam, neben den deutschen Dateien auch die englischen
durchzulesen.
</i></blockquote>

<p>
Der erste Schritt nach der Installation (und dem Lesen dieses
Handbuches) ist die Generierung eines Schl&uuml;sselpaares mit dem
Befehl
<p>
<kbd>
pgp -kg
</kbd>

<p>
Die Installation unter Unix und VAX/VMS unterscheidet sich kaum von
der MS-DOS-Installation, jedoch mu&szlig; m&ouml;glicherweise der
Quellcode neu compiliert werden. Hierf&uuml;r ist ein Unix-Makefile
dem Quellcode beigef&uuml;gt.
<p>
Genaueres zur Installation steht in der Datei <kbd>setup.doc</kbd>.
Dort ist im einzelnen beschrieben, was im PGP-Verzeichnis stehen
mu&szlig;, was in die <kbd>autoexec.bat</kbd> einzutragen ist und wie
PKUNZIP benutzt wird.

<a name="bedienung">
<h1>Bedienung von PGP</h1>
</a><a name=kurzanleitung>
<h2>Kurzanleitung am Bildschirm</h2>
</a>

Mit dem Kommando
<p>
<kbd>
pgp -h
</kbd>

<p>
gibt PGP einen &quot;Kurz&uuml;berblick&quot; &uuml;ber die
m&ouml;glichen Befehle.
<p>
Abh&auml;ngig davon, ob eine Datei namens <kbd>pgp.hlp</kbd>
vorhanden ist oder nicht, wird der Befehl unterschiedlich
ausgef&uuml;hrt. Ist <kbd>pgp.hlp</kbd> nicht vorhanden, erscheint
eine etwa 15 Zeilen umfassende &quot;Superkurzanleitung&quot; am
Bildschirm. Wenn die Datei <kbd>pgp.hlp</kbd> vorhanden ist, wird ihr
Inhalt am Bildschirm angezeigt. Im Text kann mit den Tasten
<kbd>LEERTASTE</kbd>, <kbd>RETURN</kbd> und <kbd>B</kbd>
gebl&auml;ttert werden. Mit <kbd>Q</kbd> wird das Programm beendet.
<p>
<blockquote><i>
Falls die Datei <kbd>de.hlp</kbd> vorhanden und
in der Datei <kbd>config.txt</kbd> der Eintrag <kbd>language=de</kbd>
enthalten ist, wird der Hilfstext auf deutsch angezeigt. Details zu
<kbd>config.txt</kbd> finden Sie <a href=pgp.2.2.html>hier</a>. Die
hier angegebenen Tasten gelten nat&uuml;rlich nur, wenn in der
<kbd>config.txt</kbd> kein spezielles Anzeigeprogramm eingestellt
wurde. d.&Uuml;.
</i></blockquote>

<a name="verschluesseln">
<h2>Verschl&uuml;sseln einer Nachricht</h2>
</a>

Das Verschl&uuml;sseln einer Nachricht mit dem &ouml;ffentlichen
Schl&uuml;ssel der Empf&auml;ngerin geschieht mit folgendem Befehl:
<p>
<kbd>
pgp -e textdatei Benutzer-ID
</kbd>

<p>
Dieser Befehl erzeugt eine Datei namens <kbd>textdatei.pgp</kbd>, die
den verschl&uuml;sselten Text enth&auml;lt. Beispiel:
<p>
<kbd>
pgp -e brief.txt Alice
</kbd>

<p>
oder
<p>
<kbd>
pgp -e brief.txt "Alice S"
</kbd>

<p>
Im ersten Beispiel durchsucht PGP den Bund mit den &ouml;ffentlichen
Schl&uuml;sseln nach einer ID, die das Wort &quot;Alice&quot;
enth&auml;lt. Im zweiten Beispiel wird nach IDs gesucht, die
&quot;Alice S&quot; enthalten. Leerstellen in der ID-Angabe
k&ouml;nnen nur benutzt werden, wenn die Angabe f&uuml;r die ID in
Anf&uuml;hrungszeichen eingeschlossen wird. Bei der Suche wird nicht
zwischen Gro&szlig;- und Kleinbuchstaben unterschieden. Wenn PGP eine
passende ID findet, wird deren Schl&uuml;ssel f&uuml;r das
Chiffrieren der Datei <kbd>brief.txt</kbd> verwendet. Die Datei mit
dem verschl&uuml;sselten Text hei&szlig;t <kbd>brief.pgp</kbd>.
<p>
PGP versucht, die Datei mit dem Klartext zu komprimieren, bevor es
sie verschl&uuml;sselt. Dies erh&ouml;ht erheblich den Schutz gegen
eine Kryptoanalyse. Au&szlig;erdem ist die verschl&uuml;sselte Datei
in der Regel kleiner als die originale Klartextdatei.
<p>
Wenn die verschl&uuml;sselte Datei per E-Mail versandt werden soll,
kann es sinnvoll sein, sie in druckbaren ASCII-Zeichen im
Radix-64-Format darzustellen. Dies ist m&ouml;glich durch
Hinzuf&uuml;gen der Option <kbd>-a</kbd> (siehe Abschnitt <a
href=pgp.1.6.html#[Radix]>Versand von Nachrichten im Radix-64-Format</a>).

<a name="mehrfverschl">
<h2>Verschl&uuml;sseln einer Nachricht f&uuml;r mehrere
Empf&auml;nger</h2>
</a>

Wenn dieselbe Nachricht an mehrere Empf&auml;ngerinnen verschickt
werden soll, kann sie so verschl&uuml;sselt werden, da&szlig; alle
Empf&auml;ngerinnen dieselbe verschl&uuml;sselte Nachricht
entschl&uuml;sseln k&ouml;nnen. Beim Verschl&uuml;sseln kann man
hierf&uuml;r mehrere Benutzerinnen-IDs angeben. Beispiel:
<p>
<kbd>
pgp -e brief.txt Alice Bob Carol
</kbd>

<p>
Die durch dieses Kommando erzeugte Datei <kbd>letter.pgp</kbd> kann
sowohl von Alice als auch von Bob und Carol entschl&uuml;sselt
werden. Es k&ouml;nnen beliebig viele Empf&auml;nger angegeben werden.

<a name="unterschr">
<h2>Unterschreiben einer Nachricht</h2>
</a>

Der folgende Befehl unterschreibt eine Datei mit dem geheimen
Schl&uuml;ssel:
<p>
<kbd>
pgp -s textdatei [-u Benutzer-ID]
</kbd>

<p>
<blockquote><i>
Die eckigen Klammern kennzeichnen jeweils eine
Eingabe, die nicht unbedingt erforderlich ist; die Klammern selbst
d&uuml;rfen nicht mit eingegeben werden.
</i></blockquote>

<p>
Der obige Befehl erzeugt eine Datei namens <kbd>textdatei.pgp</kbd>.
<p>
Beispiel:
<p>
<kbd>
pgp -s brief.txt -u Bob
</kbd>

<p>
Hier sucht PGP in dem Schl&uuml;sselbund <kbd>secring.pgp</kbd> nach
einer ID, in der die Zeichenfolge &quot;Bob&quot; vorkommt.
Gro&szlig;- und Kleinbuchstaben werden bei der Suche nicht
unterschieden. Wenn PGP einen geheimen Schl&uuml;ssel mit passender
ID findet, wird dieser Schl&uuml;ssel f&uuml;r die Unterschrift
verwendet. Die Datei, die den Text mit der Unterschrift enth&auml;lt,
hei&szlig;t <kbd>brief.pgp</kbd>.
<p>
Wird <kbd>-u Benutzer-ID</kbd> nicht angegeben, dann verwendet PGP
den ersten Schl&uuml;ssel aus <kbd>secring.pgp</kbd> f&uuml;r die
Unterschrift.(*)
<p>
<hr><i>
 (*)In der Regel wird <kbd>secring.pgp</kbd> nur einen einzigen geheimen
Schl&uuml;ssel enthalten, so da&szlig; <kbd>-u Benutzer-ID</kbd>
nicht angegeben werden mu&szlig;. Weiterhin besteht die
M&ouml;glichkeit, bei Verwendung mehrerer Schl&uuml;ssel den als
Standard zu verwendenden Schl&uuml;ssel in der Datei
<kbd>config.txt</kbd> anzugeben. d.&Uuml;.
</i><hr>

<a name=unterschruversch>
<h2>Unterschreiben und Verschl&uuml;sseln</h2>
</a>

Der folgende Befehl unterschreibt zuerst die Klartextdatei mit dem
geheimen Schl&uuml;ssel der Absenderin und verschl&uuml;sselt dann
die Daten mit dem &ouml;ffentlichen Schl&uuml;ssel der
Empf&auml;ngerin:
<p>
<kbd>
pgp -es textdatei Empf&auml;ngerin-ID [-u Benutzer-ID]
</kbd>

<p>
Die mit dem obigen Befehl erzeugte Datei, die den unterschriebenen
und anschlie&szlig;end verschl&uuml;sselten Text enth&auml;lt,
erh&auml;lt den Namen <kbd>textdatei.pgp</kbd>. Der f&uuml;r die
Unterschrift verwendete geheime Schl&uuml;ssel wird automatisch in
<kbd>secring.pgp</kbd> mit Hilfe der Benutzer-ID herausgesucht. Der
&ouml;ffentliche Schl&uuml;ssel der Empf&auml;ngerin wird aus
<kbd>pubring.pgp</kbd> herausgesucht. Wenn in der Befehlszeile keine
Empf&auml;nger-ID angegeben wird, fragt PGP nach.
<p>
Wird die Benutzer-ID nicht angegeben, verwendet PGP den ersten
geheimen Schl&uuml;ssel aus <kbd>secring.pgp</kbd> f&uuml;r die
Unterschrift. Ebenso wie beim Parameter <kbd>-e </kbd>allein versucht
PGP auch hier, den Klartext zu komprimieren.
<p>
Wenn die verschl&uuml;sselte Datei per E-Mail versendet werden soll,
kann es sinnvoll sein, sie in druckbaren ASCII-Zeichen im
Radix-64-Format darzustellen. Dies ist m&ouml;glich durch
Hinzuf&uuml;gen der Option <kbd>-a</kbd> (siehe Abschnitt <a
href=pgp.1.6.html#[Radix]>Versand von Nachrichten im Radix-64-Format</a>).
<p>
Mehrere Empf&auml;ngerinnen k&ouml;nnen durch einfaches
Hinzuf&uuml;gen ihrer IDs in der Befehlszeile angegeben werden.

<a name="konvent">
<h2>Konventionelle Verschl&uuml;sselung</h2>
</a>

Manchmal kann es vorkommen, da&szlig; man eine Datei nach einer
herk&ouml;mmlichen Methode mit einem einzelnen Schl&uuml;ssel
verschl&uuml;sseln m&ouml;chte. Sinnvoll ist das beispielsweise
f&uuml;r die Verschl&uuml;sselung einer Archivkopie von Daten, die
einfach nur gespeichert, aber nicht an andere Leute verschickt werden
soll. Der Befehl hierf&uuml;r lautet:
<p>
<kbd>
pgp -c textdatei
</kbd>

<p>
Der Inhalt der Datei mit dem Namen <kbd>textdatei</kbd> wird
verschl&uuml;sselt und in eine Datei mit dem Namen
<kbd>textdatei.pgp</kbd> geschrieben. &Ouml;ffentliche
Schl&uuml;ssel, Schl&uuml;sselbunde, Benutzer-IDs usw. werden nicht
verwendet. PGP fragt bei obigem Befehl nach einem Mantra, mit dem die
Datei verschl&uuml;sselt werden soll. Dieses Mantra braucht nicht
dasselbe zu sein, mit dem der geheime Schl&uuml;ssel gesichert ist,
und es <em>sollte</em> auch nicht dasselbe sein. PGP versucht, die
Daten vor der Verschl&uuml;sselung zu komprimieren.

<a name="entschl">
<h2>Entschl&uuml;sselung und Pr&uuml;fung der Unterschrift</h2>
</a>

Mit folgendem Befehl wird eine verschl&uuml;sselte Datei
entschl&uuml;sselt und/oder eine Unterschrift gepr&uuml;ft:
<p>
<kbd>
pgp verschl&uuml;sselte_datei [-o klartext_datei]
</kbd>

<p>
Die [eckigen Klammern] kennzeichnen eine Eingabe, die nicht unbedingt
erforderlich ist; die Klammern selbst d&uuml;rfen nicht mit
eingegeben werden.
<p>
PGP geht davon aus, da&szlig; das Suffix des Namens von
<kbd>verschl&uuml;sselte_datei</kbd> <kbd>.pgp</kbd> ist. Der
optionale Parameter <kbd>klartext_datei</kbd> gibt an, in welcher
Datei die entschl&uuml;sselten Daten gespeichert werden sollen. Fehlt
diese Angabe, wird der Name von <kbd>verschl&uuml;sselte_datei</kbd>
ohne Suffix f&uuml;r die Klartextdatei verwendet. Falls
<kbd>verschl&uuml;sselte_datei</kbd> eine Unterschrift enth&auml;lt,
wird sie automatisch gepr&uuml;ft. Die Benutzer-ID der
Unterschreibenden wird am Bildschirm angezeigt.
<p>
PGP bearbeitet <kbd>verschl&uuml;sselte_datei</kbd> vollautomatisch.
Die Datei kann sowohl nur verschl&uuml;sselt als auch nur
unterschrieben oder auch unterschrieben und verschl&uuml;sselt sein.
PGP verwendet die in <kbd>verschl&uuml;sselte_datei</kbd>
gespeicherte Schl&uuml;ssel-ID, um aus dem Bund mit den geheimen
Schl&uuml;sseln denjenigen herauszusuchen, f&uuml;r den
<kbd>verschl&uuml;sselte_datei</kbd> verschl&uuml;sselt wurde. Falls
<kbd>verschl&uuml;sselte_datei</kbd> eine Unterschrift enth&auml;lt,
verwendet PGP die zusammen mit der Unterschrift gespeicherte
Schl&uuml;ssel-ID, um aus dem Bund mit &ouml;ffentlichen
Schl&uuml;sseln denjenigen herauszusuchen, mit dem die Unterschrift
gepr&uuml;ft werden kann. Falls all diese Schl&uuml;ssel vorhanden
sind, ist w&auml;hrend der Entschl&uuml;sselung keine weitere Eingabe
erforderlich, ausgenommen das Mantra, mit dem der geheime
Schl&uuml;ssel gesichert ist.
<p>
Falls <kbd>verschl&uuml;sselte_datei</kbd> konventionell
verschl&uuml;sselt wurde (also mit der Option <kbd>-c</kbd>), fragt
PGP bei der Entschl&uuml;sselung nach dem Mantra, mit dem die Datei
verschl&uuml;sselt wurde.

<a name="zufall">
<h2>Erzeugen einer Datei mit Zufallszahlen</h2>
</a>

Seit der Version 2.6.2 bietet pgp die M&ouml;glichkeit, den internen
Generator f&uuml;r <a href=pgp.2.3.html#zufall>Pseudozufallszahlen</a> auch
dazu zu verwenden, eine Datei mit kryptographisch zuverlaessigen
Zufallszahlen zu erstellen. Dazu dient der Aufruf<p>
<kbd>
pgp +makerandom=&lt;bytes&gt; &lt;filename&gt;
</kbd>
<p>
der eine Datei <kbd>filename</kbd> mit <kbd>bytes</kbd>
pseudozuf&auml;lligen Bytes erzeugt.

<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
