<HTML>
<head>
<title>PGP = Rechtsfragen</title>
</head>
<body>

<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<hr>
<a href=#copyright>Warenzeichen, Copyright, Garantie</a><br>
<a href=#patent>Patentrechte auf die Algorithmen</a><br>
<a href=#Lizenz>Lizensierung und Vertrieb</a><br>
<a href=#deutschland>Zur rechtlichen Situation der Verschl&uuml;sselung in
Deutschland</a><br>
<a href=#export>Exportkontrolle in den USA</a><br>

<hr>

<a name=copyright>
<h1>Warenzeichen, Copyright, Garantie</h1>
</a>

&quot;Pretty Good Privacy&quot;, &quot;Phil's Pretty Good
Software&quot;, und &quot;Pretty Good&quot; als Warenzeichen f&uuml;r
Computerhard- und Software sind Warenzeichen von Philip Zimmermann
und von Phil's Pretty Good Software. PGP ist (c) copyright by Philip
R. Zimmermann 1990-1993. Philip Zimmermann hat auch das Copyright
f&uuml;r das PGP-Handbuch und f&uuml;r &Uuml;bersetzungen von
Handbuch und Software in andere Sprachen.
<p>
MS-DOS und MS Windows sind eingetragene Warenzeichen der Firma
Microsoft. Amiga ist eingetragenes Warenzeichen der Firma Escom.
MacIntosh und Apple MacIntosh sind eingetragene Warenzeichen der Firma
Apple.
<p>
Das MIT kann ein Copyright auf die spezielle Zusammenstellung auf
ihrer ftp-Site beanspruchen. Dieses &quot;compilation copyright&quot;
beinhaltet keine Rechte am Programm, der Dokumentation oder sonstigen
begleitenden Dateien.
<p>
Der Autor &uuml;bernimmt keine Haftung f&uuml;r Sch&auml;den, die aus
der Nutzung der Software entstehen, auch dann nicht, wenn die
Sch&auml;den aus Fehlern der Software resultieren. Der Autor macht
keine Angaben &uuml;ber die Verkaufbarkeit der Software oder ihre
Brauchbarkeit f&uuml;r bestimmte Anwendungen. Die Software wird nur
in der bestehenden Form zur Verf&uuml;gung gestellt, ohne jede
explizite oder implizite Garantie.

<a name=patent>
<h1>Patentrechte auf die Algorithmen</h1>
</a>

Das Verschl&uuml;sselungsverfahren RSA wurde am MIT entwickelt. Dem
MIT wurde ein Patent auf RSA erteilt (U.S. patent #4,405,829, erteilt
am 20. September 1983). Eine kalifornische Firma namens Public Key
Partners (PKP) besitzt die alleinigen Rechte an diesem Patent
f&uuml;r den Verkauf und die Lizensierung des
RSA-Verschl&uuml;sselungsverfahrens.
<p>
F&uuml;r Anwender au&szlig;erhalb der USA sei angemerkt, da&szlig;
das US-Patent auf RSA nur innerhalb der USA(*) gilt und da&szlig; es
kein RSA-Patent in anderen L&auml;ndern gibt. US-Bundesbeh&ouml;rden
k&ouml;nnen RSA nutzen, weil die Entwicklung von RSA staatlich durch
Zusch&uuml;sse der National Science Foundation und der US-Navy
finanziert wurde. Die Verwendung von PGP durch Stellen der
US-Regierung unterliegt jedoch Einschr&auml;nkungen, die sich aus
meiner Einigung mit ViaCrypt ergeben. Hierzu sp&auml;ter mehr.

<hr><i>
 (*)und Kanada d.&Uuml;.
</i><hr>

Ich schrieb PGP vollst&auml;ndig selbst, mit einer eigenst&auml;ndig
entwickelten Implementierung des RSA-Algorithmus. Vor der
Ver&ouml;ffentlichung von PGP erhielt ich das Rechtsgutachten eines
Patentanwalts mit gro&szlig;er Erfahrung bei Softwarepatenten. Ich
bin &uuml;berzeugt, da&szlig; die Art, in der ich PGP
ver&ouml;ffentlicht habe, keinen Versto&szlig; gegen das Patentrecht
darstellt.
<p>
PKP erhielt nicht nur die ausschlie&szlig;lichen Patentrechte
f&uuml;r RSA, sondern auch die ausschlie&szlig;lichen Rechte f&uuml;r
drei andere Patente f&uuml;r asymmetrische
Verschl&uuml;sselungsverfahren, die an der Stanford University mit
Bundeszusch&uuml;ssen entwickelt wurden. Im Prinzip entscheidet damit
in den USA eine einzige Firma &uuml;ber die Verwendung von public key
Verschl&uuml;sselungssystemen. PKP beansprucht sogar das Patentrecht
an dem grundlegenden Konzept der Kryptographie mit &ouml;ffentlichen
Schl&uuml;sseln, unabh&auml;ngig davon, wie intelligent auch immer
ein neuer Algorithmus sein wird, der unabh&auml;ngig von PKP
entwickelt werden k&ouml;nnte. Ich halte ein derart umfassendes
Monopol f&uuml;r gef&auml;hrlich, weil ich der Meinung bin, da&szlig;
Kryptographie mit &ouml;ffentlichen Schl&uuml;sseln einen zentralen
Beitrag zum Schutz der B&uuml;rgerrechte und der Privatsph&auml;re in
unserer immer mehr verkabelten Gesellschaft leisten kann. Zumindest
setzt das Monopol von PKP diese lebenswichtige Technologie dem Risiko
der Einflu&szlig;nahme durch die Regierung aus.
<p>
Seit der Version 2.5 (vertrieben vom MIT, dem Inhaber des originalen
Patentes auf RSA) verwendet die Freeware-Version von PGP die
RSAREF-Routinen, die innerhalb der USA f&uuml;r nichtkommerzielle
Anwendungen benutzt werden d&uuml;rfen.
<p>
Die PGP Version 2.0 entstand aus der gemeinsamen Arbeit eines
internationalen Programmierteams, das unter meiner Leitung
Verbesserungen gegen&uuml;ber der ersten Version implementierte.
Diese Version wurde von Branko Lancaster in Holland und von Peter
Gutmann in Neuseeland ver&ouml;ffentlicht, au&szlig;erhalb der
Reichweite des Patentgesetzes der USA. Obwohl es nur in Europa und
Neuseeland ver&ouml;ffentlicht wurde, verbreitete sich PGP spontan in
die USA, ohne da&szlig; ich oder das Entwicklungsteam etwas damit zu
tun gehabt h&auml;tten.
<p>
Das bei PGP ebenfalls verwendete blockorientierte
Verschl&uuml;sselungsverfahren IDEA unterliegt in Europa einem
Patent, das der ETH Z&uuml;rich und einer Schweizer Firma namens
Ascom Systec AG geh&ouml;rt. Die Patentnummer ist PCT/CH91/00117. Die
US-Patentnummer ist US005214703, die europ&auml;ische Patentnummer
lautet EP 0 482 154 B1. F&uuml;r die nicht-kommerzielle Verwendung
von IDEA werden keine Lizenzgeb&uuml;hren verlangt. Die Ascom-Tech AG
hat eine Lizenz f&uuml;r die nicht-kommerzielle Nutzung von IDEA bei
PGP erteilt. In den USA m&uuml;ssen staatliche und kommerzielle
Anwenderinnen eine lizensierte PGP-Version von ViaCrypt beziehen,
diese schlie&szlig;t eine Lizenz f&uuml;r IDEA mit ein.
<p>
Die Verwendung der IDEA-Routinen aus PGP in anderen, kommerziellen
Produkten ist ohne eine Lizenz von Ascom Tech nicht erlaubt.
Weitere Informationen finden Sie auf dem Server der Firma Ascom Systec AG
<a href=http://www.ascom.ch/systec/security/page1.htm>hier</a>.
<p>
Die bei PGP verwendeten ZIP-Kompressionsroutinen stammen aus
Freeware-Quellcode und werden mit Erlaubnis des Autors verwendet. Mir
sind keine Patente bekannt, die f&uuml;r die Kompressionsalgorithmen
erteilt worden w&auml;ren, aber Sie k&ouml;nnen diese Frage gerne
selbst genauer untersuchen. Ascom hat vor kurzem seine Politik
bez&uuml;glich der kommerziellen Nutzung au&szlig;erhalb der USA
ge&auml;ndert, hierbei scheint noch einiges in Bewegung zu sein.(*)

<hr><i>
 (*)Laut Aussage der Ascom-Tech bezog sich die Lizenz lediglich auf die
nicht-kommerzielle Nutzung von IDEA in PGP. Offensichtlich lag ein
Mi&szlig;verst&auml;ndnis vor.
</i><hr>

<h1><a name=Lizenz>Lizensierung und Vertrieb</a></h1>

PGP 2.6 ist in den USA unter den Bedingungen der RSAREF Lizenz vom
Massachusetts Institute of Technology erh&auml;ltlich. Ich stelle
mich niemandem in den Weg, der die Freeware-Versionen von PGP frei
verbeitet oder verwendet, ohne mir daf&uuml;r etwas zu bezahlen,
vorausgesetzt, dies dient privaten, nicht-kommerziellen Zwecken.
Kommerzielle Anwender in den USA wenden sich bitte an ViaCrypt in
Phoenix, Arizona, Telefon-Nummer V+1-602-944-0773. Alle Hinweise auf
Copyright, Patente und gesch&uuml;tzte Handelsnamen m&uuml;ssen bei
der Verbreitung PGPs erhalten bleiben, die Dokumentation mu&szlig;
mitverbreitet werden.
<p>
Unabh&auml;ngig von den komplizierten und teilweise
&uuml;berlappenden Beschr&auml;nkungen und Bedingungen der
verschiedenen Patent- und Urheberrechte (RSA, RSAREF und IDEA), die
verschiedene Institutionen haben, gilt eine weitere Beschr&auml;nkung
auf die Benutzung von PGP, die sich aus meiner Einigung mit ViaCrypt
ergibt: Die Freeware-Version darf nur privat und nichtkommerziell
genutzt werden.(*)

<hr><i>
 (*)Kommerzielle Anwender au&szlig;erhalb der USA und Kanadas sollten
sich mit Ascom Tech in Verbindung setzen.
</i><hr>

Ich mu&szlig;te im Sommer 1993 ein Abkommen mit ViaCrypt
schlie&szlig;en, das dieser Firma die exklusiven Rechte an einer
kommerziellen Version von PGP gibt, um Unternehmen einen rechtlich
abgesicherten Weg zu bieten, PGP zu verwenden, ohne von PKP wegen
Patentrechtsverletzungen belangt zu werden. Um PGP auf lange Sicht
als Standard etablieren zu k&ouml;nnen, mu&szlig;te das juristische
Stigma, das mit der Verwendung von RSA verbunden war, beseitigt
werden. ViaCrypt besa&szlig; bereits eine Lizenz von PKP, Produkte
herzustellen, zu benutzen und zu vertreiben, die RSA verwenden.
ViaCrypt bot sich als Weg aus der Illegalit&auml;t an, in der PGP
vorher operierte. Sie konnten eine kommerzielle Version von PGP
verkaufen, wenn ich ihnen die Lizenz dazu geben w&uuml;rde. Um PGP
eine Zukunft im kommerziellen Sektor zu bieten, habe ich diesen Weg
eingeschlagen. Das war notwendig, um PGP das &Uuml;berleben zu
sichern.
<p>
PGP ist keine Shareware, es ist Freeware, ver&ouml;ffentlicht als
gesellschaftliche Dienstleistung. Da&szlig; PGP kostenlos ist,
ermutigt viele Menschen, PGP auch zu verwenden. Dies wird hoffentlich
gr&ouml;&szlig;ere soziale Auswirkungen haben, woraus sich ein
gro&szlig;er Bekanntheitsgrad und eine weite Verbreitung von RSA
ergeben k&ouml;nnte.
<p>
Scheuen Sie sich nicht, das vollst&auml;ndige PGP-Paket soweit wie
m&ouml;glich zu verbreiten. Geben Sie es allen Ihren Freunden. Wenn
Sie Zugang zu MailBoxen haben, stellen Sie PGP in m&ouml;glichst
allen MailBoxen &ouml;ffentlich zur Verf&uuml;gung. Auch den
Quellcode k&ouml;nnen Sie beliebig verbreiten. Die ausf&uuml;hrbare
PGP-Version 2.6 f&uuml;r MS-DOS steht zusammen mit der Dokumentation,
einigen &ouml;ffentlichen Schl&uuml;sseln, darunter mein eigener,
sowie Unterschriften unter das Programm in einer Datei namens
<kbd>PGP26[MIT].ZIP</kbd>.(*) Die Quelldateien f&uuml;r MS-DOS sind
in einer Datei namens <kbd>pgp26src.zip</kbd> enthalten.

<hr><i>
 (*)Aufgrund der Exportbestimmungen der USA, die die Ausfuhr dieses
Paketes verbieten, bietet es sich an, PGP262I.ZIP zu verwenden.
Hiermit lassen sich au&szlig;erdem auch nach dem 1. September 1994
noch Nachrichten schreiben, die von der 2.3a gelesen werden
k&ouml;nnen. d.&Uuml;.
</i><hr>

PGP darf unter keinen Umst&auml;nden ohne die Dokumentation
verbreitet werden. Das schlie&szlig;t bei der Version 2.6 die
englische Anleitung und die RSAREF-Lizenz mit ein.
<p>
Kostenlose Kopien und Updates von PGP finden Sie weltweit in
tausenden von MailBoxen und anderen &ouml;ffentlich zug&auml;nglichen
Archiven, wie ftp-Servern im Internet. Der Ursprung von PGP ist das
MIT, speziell der ftp-Server <kbd>net-dist.mit.edu</kbd> im
Verzeichnis <kbd>/pub/PGP</kbd>. Mich selbst brauchen Sie nicht nach
PGP zu fragen, insbesondere, wenn Sie au&szlig;erhalb der USA und
Kanadas wohnen.
<p>
Nach all der Arbeit an PGP m&ouml;chte ich noch anmerken, da&szlig;
ich gegen Fanpost nichts einzuwenden habe, allein schon, um seine
Popularit&auml;t absch&auml;tzen zu k&ouml;nnen. Teilen Sie mir mit,
was Sie von PGP halten und wieviele Ihrer Freunde es verwenden.
Hinweise auf Fehler und Verbesserungsvorschl&auml;ge sind
nat&uuml;rlich ebenfalls gerne gesehen. In k&uuml;nftigen
PGP-Versionen werden Ihre Anregungen m&ouml;glicherweise
ber&uuml;cksichtigt werden.
<p>
Das PGP-Projekt wurde nicht finanziell gef&ouml;rdert und hat mir
beinahe die Haare vom Kopf gefressen. Sie d&uuml;rfen deshalb nicht
mit einer Antwort auf Ihren Brief rechnen, es sei denn, Sie legen
einen frankierten R&uuml;ckumschlag bei. Lieber antworte ich auf
E-Mail. Bitte schreiben Sie auf Englisch, weil meine
Fremdsprachenkenntnisse begrenzt sind. Wenn Sie mich anrufen, und ich
bin nicht da, probieren Sie am besten etwas sp&auml;ter noch einmal.
R&uuml;ckrufe auf Ferngespr&auml;che mache ich in der Regel nicht, es
sei denn, Sie akzeptieren ein R-Gespr&auml;ch. Falls Sie mich
f&uuml;r l&auml;ngere Zeit brauchen: Ich stehe als Berater auf
entsprechender finanzieller Basis zu Verf&uuml;gung und antworte auch
auf derartige Anfragen.
<p>
Die ungelegenste Post, die ich bekomme, stammt von Menschen, die mir
in der besten Absicht ein paar Dollar schicken mit der Bitte, ihnen
PGP zuzusenden. Ich mache das nicht, um rechtlichen Problemen mit PKP
aus dem Weg zu gehen. Noch schlechter ist es, wenn so eine Anfrage
aus dem Ausland kommt. In dem Fall w&uuml;rde ich es riskieren, die
US-amerikanischen Gesetze &uuml;ber den Export von Kryptographie zu
verletzen. Aber auch wenn es keine rechtliche Auseinandersetzung um
PGP g&auml;be: Normalerweise reicht das Geld in so einem Brief nicht
aus, um den Zeitaufwand zu rechtfertigen, den ich mit dem Versand
h&auml;tte. Ich bin nicht darauf eingerichtet, im Nebenberuf
preiswertes Versandhaus zu spielen. Andererseits kann ich das Geld
auch nicht einfach behalten, weil es als Honorar f&uuml;r eine
Leistung gedacht ist. Um das Geld aber zur&uuml;ckzuschicken,
mu&szlig; ich mich in mein Auto setzen, zum Postamt fahren und
Briefmarken kaufen. Normalerweise kommen diese Anfragen ohne
frankierten R&uuml;ckumschlag. Als n&auml;chstes mu&szlig; ich mir
die Zeit nehmen, eine freundliche Antwort zu schreiben, da&szlig; ich
dem Wunsch der Absender nicht nachkommen kann. Wenn ich die
Beantwortung zur&uuml;ckstelle und den Brief einfach auf meinen
Schreibtisch lege, kann es passieren, das er innerhalb von Minuten
unter Papierstapeln vergraben wird, und erst Monate sp&auml;ter
wieder ans Tageslicht kommt. Wenn Sie all diese kleinen
Unbequemlichkeiten mit der Anzahl der Anfragen multiplizieren, wird
Ihnen das Problem klar. Reicht es nicht, da&szlig; PGP nichts kostet?
Wie sch&ouml;n w&auml;re es, wenn diese Leute versuchen w&uuml;rden,
PGP aus irgendeiner der unz&auml;hligen vorhandenen Quellen zu
beziehen. Wenn Sie kein Modem haben, fragen Sie in Ihrem
Bekanntenkreis. Wenn Sie keine Bezugsquelle finden, k&ouml;nnen Sie
mich kurz anrufen.(*)

<hr><i>
 (*)In Deutschland ist als Ansprechpartner der <a
href="/index.html">FoeBuD e.V.</a> geeignet:
FoeBuD e.V., Marktstra&szlig;e 18, 33602 Bielefeld. Montags bis
freitags von 17 bis 19h auch telefonisch unter 0521-175254.
</i><hr>

Wer immer freiwillig an der Verbesserung von PGP mitarbeiten
m&ouml;chte, m&ouml;ge mir das mitteilen. PGP k&ouml;nnte weitere
Arbeit durchaus vertragen. Ein paar Optionen wurden
zur&uuml;ckgestellt, um PGP ohne zu gro&szlig;e Verz&ouml;gerung
ver&ouml;ffentlichen zu k&ouml;nnen. Viele Leute haben ihre Zeit
damit verbracht, PGP auf Unix f&uuml;r Sun Sparcstations, auf Ultrix,
auf VAX/VMS, auf den Amiga und auf den Atari ST zu portieren.
Vielleicht k&ouml;nnen auch Sie dabei helfen, PGP auf weitere
Maschinen zu portieren. Aber schreiben Sie mir, bevor Sie mit einer
Portierung oder Verbesserung von PGP anfangen, um doppelte Arbeit
oder die Verwendung veralteter Versionen der Quellcodes zu vermeiden.
<p>
Es gibt so viele fremdsprachige &Uuml;bersetzungen von PGP, da&szlig;
die meisten Sprachkits nicht im Standardpaket von PGP enthalten sind,
um Speicherplatz zu sparen. Einzelne Sprachkits k&ouml;nnen Sie aus
einer gro&szlig;en Zahl unabh&auml;ngiger Quellen beziehen.
H&auml;ufig sind es die gleichen Quellen, bei denen Sie auch das
eigentliche PGP-Paket finden. Diese Kits enthalten &uuml;bersetzte
Versionen von <kbd>language.txt</kbd>, <kbd>pgp.hlp</kbd> und vom
Handbuch. Falls Sie daran denken, PGP in Ihre Muttersprache zu
&uuml;bersetzen, setzen Sie sich mit mir in Verbindung, damit Sie die
neuesten Informationen und Standardisierungsrichtlinien bekommen, und
um herauszufinden, ob es bereits eine &Uuml;bersetzung in Ihre
Sprache gibt. Wenn Sie ein Sprachkit f&uuml;r eine bestimmte Sprache
suchen, probieren Sie es am besten in den entsprechenden
Internetgruppen oder fragen sie Mike Johnson (<kbd>&lt;mpj@csn.org&gt;</kbd>).
<p>
Wenn Sie Usenet-Anschlu&szlig; haben, beobachten Sie die Newsgroups
<kbd>sci.crypt</kbd> und die PGP-spezielle Newsgroup
<kbd>alt.security.pgp</kbd>, um Ank&uuml;ndigungen von neuen
PGP-Versionen zu erhalten. Wenn sie PGP suchen, versuchen Sie es
zun&auml;chst via ftp bei <kbd>net-dist.mit.edu</kbd>. Oder fragen
Sie Mike Johnson (<kbd>&lt;mpj@csn.org&gt;</kbd>) nach einer Liste
von ftp-Sites und BBS-Nummern.

<blockquote><i>
Bitte beachten Sie bei obigen Ausf&uuml;hrungen,
da&szlig; es die US-Regierung als illegalen Export betrachtet, wenn
Sie von au&szlig;erhalb der USA PGP, andere Programme oder Daten, die
den Exportbeschr&auml;nkungen unterliegen von einem US-amerikanischen
ftp-Server oder einer US-amerikanischen MailBox kopieren.
M&ouml;glicherweise gef&auml;hrden Sie damit sogar einen
amerikanischen MailBoxbetreiber. Nach einer Meldung in
<kbd>alt.security.pgp</kbd> wurde in den USA schon gegen einen
MailBoxbetreiber ermittelt, der PGP &ouml;ffentlich angeboten hat.
<p>
In Deutschland ist zu erwarten, da&szlig; neue
Versionen von PGP nach kurzer Zeit, in der der Sourcecode auf
offensichtliche Manipulationen gepr&uuml;ft wird, in der //BIONIC zu
finden sein werden. Diese MailBox ist erreichbar unter der Nummer
0521-68000, Loginname <kbd>PGP</kbd>, kein Passwort. Wieder mal ein
bi&szlig;chen Werbung in eigener Sache... Weiterhin auch in der HIT,
0681-399426, Username <kbd>SAUGER</kbd>, im Brett
<kbd>/BINAER/SAUGER</kbd>, letztere Adresse gilt allerdings nur
f&uuml;r die MS-DOS-Version. Die Amiga-Version wird in
s&auml;mtlichen Boxen, die das Aminet f&uuml;hren, weitergegeben
werden, im FrAS in gr&ouml;&szlig;eren Abst&auml;nden wohl auch. Mit
kurzer zeitlicher Verz&ouml;gerung werden Sie neue PGP-Versionen auch
auf ftp-Servern au&szlig;erhalb der USA finden.
<p>
Die aktuelle Version von PGP (2.6.3i) finden Sie beispielsweise
<a href=ftp://ftp.ifi.uio.no/pub/pgp/src/pgp263is.tar.gz>hier</a> bzw. in
der MS-DOS-Version <a
href=ftp://ftp.ifi.uio.no/pub/pgp/src/pgp263is.zip>hier</a>, die fertig
kompilierten Programme finden Sie ebenfalls in Norwegen, und zwar f&uuml;r
<a href=ftp://ftp.ifi.uio.no/pub/pgp/pc/msdos/pgp263ix.zip>MSDOS</a>,
<a href=ftp://ftp.ifi.uio.no/pub/pgp/pc/os2/pgp263i-os2.zip>OS/2</a>,
<a href=ftp://ftp.ifi.uio.no/pub/pgp/atari/pgp263i-atari.zip>Atari</a>,
<a href=ftp://ftp.ifi.uio.no/pub/pgp/amiga/PGPAmiga-2.6.3is.lha>Amiga</a>
und <a href=ftp://ftp.ifi.uio.no/pub/pgp/mac/macpgp263i.sit.hqx>Apple
MacIntosh</a>.



</i></blockquote>

Bei k&uuml;nftigen Versionen von PGP kann sich unter Umst&auml;nden
das Datenformat von Nachrichten, Unterschriften, Schl&uuml;sseln oder
Schl&uuml;sseldateien &auml;ndern, wenn dadurch wichtige neue
Funktionen erm&ouml;glicht werden. Daraus k&ouml;nnen sich Probleme
mit der Kompatibilit&auml;t zur gegenw&auml;rtig aktuellen Version
ergeben. Diese Versionen werden m&ouml;glicherweise
Konvertierungsprogramme f&uuml;r alte Schl&uuml;ssel enthalten, aber
Nachrichten, die mit alten PGP-Versionen erzeugt wurden, werden nicht
unbedingt kompatibel zu den neuen Versionen von PGP sein.

<a name=deutschland>
<h1>Zur rechtlichen Situation der Verschl&uuml;sselung in Deutschland</h1>
</a>

Wir sind selbst keine Juristen und haben auch noch von keinem Juristen ein
umfassendes Statement zum Thema Verschl&uuml;sselung bekommen k&ouml;nnen.
Anscheinend ist derzeit der Einsatz von Kryptographie problemlos
m&ouml;glich, der Export unterliegt nur wenigen Einschr&auml;nkungen, welche
L&auml;nder hiervon betroffen sind, k&ouml;nnen wir nicht genau sagen.
Interessant d&uuml;rfte es jedenfalls sein, folgende Antwort der
Bundesregierung auf eine kleine Anfrage der Bundestagsfraktion der
Gr&uuml;nen zu lesen:



<h2>Kleine Anfrage des Abgeordneten Dr. Manuel Kiper und der Fraktion 
BUENDNIS 90/DIE GRUENEN</h2>

Sicherheit in der Informationstechnik und Kryptierung<br>
BT-Drucksache Nr. 13/3932

<p>Die Bedeutung der Sicherheit der Informationstechnik (IT-Sicherheit) wird
h&auml;ufig betont. Die Praxis zeigt jedoch, da&szlig; Probleme von
gro&szlig;er Wichtigkeit nicht angegangen und grunds&auml;tzliche Fragen
nicht gestellt werden. In besonderem Ma&szlig;e tritt dies bei solchen
technischen Teilbereichen zutage, die wie die Kryptographie nicht allein der
Herstellung von IT-Sicherheit dienen k&ouml;nnen, sondern den Interessen
staatlicher Sicherheit untergeordnet werden.

<p>Die Bundesregierung bereitet derzeit die Einf&uuml;hrung einer
elektronischen Unterschrift vor. Elektronische Daten werden dabei durch eine
Verschl&uuml;sselung &quot;versiegelt&quot;. Gleichzeitig wird auf diese
Weise die Nutzung von kryptographischen Verfahren in gro&szlig;em Umfang
begonnen. Pl&auml;ne seitens der EU-Kommission zu &auml;hnlichen Verfahren
sind bekannt geworden, die US- Regierung hat ihrerseits erste
&Uuml;berlegungen einer Neuausrichtung ihrer Kryptographie-Politik bekannt
gegeben. Die Antwort der Bundesregierung auf eine Anfrage zur Kryptographie
(BT-Drs. 13/1889) sind damit nicht l&auml;nger aktuell.

<p>Der bislang nicht gew&auml;hrleistete Schutz pers&ouml;nlicher Daten, die
auf elektronischem Weg verschickt werden, kann mit den
Kryptierungsinitiativen vorangetrieben werden. Damit wird gleichzeitig die
Frage nach einer internationalen Abstimmung notwendig, wenn Nutzung wie
Handel mit Kryptiersystemen keinen k&uuml;nstlich errichteten Barrieren
ausgesetzt werden sollen.

<p>IT-Sicherheit besteht jedoch aus weit mehr als nur Kryptierung. Die wenig 
erhellende Antwort der Bundesregierung auf eine Kleine Anfrage zum BSI (BT-
Drs. 13/3408) macht es notwendig, verschiedene Bereiche der IT-Sicherheit 
erneut zu thematisieren.


<h3>Vorbemerkung der Bundesregierung:</h3>

Die Bundesregierung hat die Entwicklung sicherer kryptografischer Verfahren
fuer staatliche Zwecke bereits seit den 50er-Jahren mit erheblichen Mitteln
gef&ouml;rdert. Die Ergebnisse sind zwischenzeitlich auch weitgehend in den
zivilen Anwendungsbereich eingeflossen.

<p>Sichere kryptografische Verfahren f&uuml;r Zwecke der 
<ul>
<li> digitalen Signatur (elektronischen Unterschrift),
<li> Identifikation/Authentisierung und Zugriffskontrolle (z.B. als
&quot;digitaler Ausweis&quot; in Netzen) und
<li> Verschl&uuml;sselung
</ul>
sind die Grundvoraussetzung f&uuml;r wirksame Datensicherheit und wirksamen
Datenschutz beim Einsatz von lnformationstechnik mit weltweiter Vernetzung.
Die daf&uuml;r erforderliche Technik steht zur Verf&uuml;gung.

<p>Die Bundesregierung pr&uuml;ft zur Zeit, in welchem Umfang k&uuml;nftig
ein elektronisches Dokument mit digitaler Signatur einem Schriftdokument mit
eigenh&auml;ndiger Unterschrift rechtlich gleichgestellt werden soll.

<p>Im uebrigen wird auf die BT-Drucksache 13/1889 verwiesen.

<hr> 
<i>
1.  Gibt es offizielle Kontakte zwischen Mitarbeitern des Bundesamtes
f&uuml;r Sicherheit in der Informationstechnik (BSI) und Mitarbeitern der
National Security Agency (NSA)? Wenn ja, in welchen Gremien, zu welchem
Zweck und wann und aus welchem Anla&szlig; fand die letzte Begegnung statt?

<p>2.  Welche offiziellen Kontakte gab es zwischen der NSA und Mitarbeitern
der ehemaligen Zentralstelle f&uuml;r das Chiffrierwesen (ZfCh) und in
welchem Umfang werden diese heute vom BSI weitergepflegt?
</i>

<p>zu 1. und 2<br>

Wie das BSI und seine Vorg&auml;ngerbeh&ouml;rden ist die NSA f&uuml;r die
Entwicklung und Zulassung von Verschl&uuml;sselungssystemen im staatlichen
Geheimschutzbereich zust&auml;ndig. Es fand und findet deshalb ein
regelm&auml;&szlig;iger multilateraler Erfahrungsaustausch statt. Die letzte
Begegnung erfolgte am 1. M&auml;rz 1996 im Rahmen der Zusammenarbeit des BSI
mit NIST, NSA und den entsprechenden Beh&ouml;rden Kanadas,
Gro&szlig;britanniens, Frankreichs und der Niederlande zur Weiterentwicklung
der Europ&auml;ischen IT-Sicherheitskriterien (ITSEC) zu gemeinsamen
Kriterien (Common Criteria).

<i>
<p>3.  Mit welchen Unternehmen hat die ZfCh bei der Entwicklung von
Verschl&uuml;sselungstechnik zusammengearbeitet bzw. mit welchen arbeitet
das BSI heute zusammen?
</i>

<p>Zu 3.<br>
ZfCh bzw.  BSI arbeiteten/arbeiten grunds&auml;tzlich mit allen deutschen 
Kryptoherstellern zusammen.

<i>
<p>4.  Gab bzw. gibt es dabei eine Zusammenarbeit mit verschiedenen Firmen, 
sowie Herstellern von Ger&auml;ten und Systemen zur Elektronischen 
Kampff&uuml;hrung (EloKa)? Wenn ja, zu welchem Zweck?
</i>

<p>Zu 4.<br>
Ja, die Zusammenarbeit diente vor allem der Entwicklung von 
Kryptoger&auml;ten f&uuml;r den Bereich des staatlichen Geheimschutzes.

<i>
<p>5.  Trifft es zu, da&szlig; f&uuml;r das BSI ein neuer
leistungsf&auml;higer Gro&szlig;rechner beschafft werden soll? Wenn ja:
F&uuml;r welche Zwecke wird dieser Rechner ben&ouml;tigt?
</i>

<p>zu 5.<br> 
Ja. Er soll der Entwicklung und Untersuchung kryptographischer Algorithmen
(z. B. zur Verschl&uuml;sselung oder digitalen Signatur) dienen.

<i>
<p>6.  In welchem Umfang unterliegt der Export von
Verschl&uuml;sselungssystemen in der Bundesrepublik
Exportbeschr&auml;nkungen und in welchem Umfang ist das BSI an der Erteilung
von Exportlizenzen fachlich beteiligt bzw. war die vormalige ZfCh daran
beteiligt?
</i>

<p>Zu 6.<br>

Verschl&uuml;sselungssysteme sind in Deutschland, ebenso wie z.B. in den
&uuml;brigen Mitgliedstaaten der EU, wegen ihrer doppelten
Verwendungsf&auml;higkeit in weitem Umfang einer Ausfuhrgenehmigungspflicht
unterworfen. Die entsprechenden Ausr&uuml;stungen, Baugruppen, Bestandteile,
einschl&auml;gige Pr&uuml;f-, Test-, Herstellungseinrichtungen,
Datenverarbeitungsprogramme und Technologie sind in der Ausfuhrliste -
Anlage zur Au&szlig;enwirtschaftsverordnung - im Teil 1 C Abschnitt 5 Teil 2
&quot;Informationssicherheit&quot; - im einzelnen aufgef&uuml;hrt. Die
Genehmigungsbeh&ouml;rde ist angewiesen, bis auf wenige Ausnahmen - z.B. 
bei Bankautomaten - alle Antr&auml;ge auf Genehmigung solcher Ausfuhren dem
BSI zur fachlichen Begutachtung vorzulegen. Diese Begutachtung erfolgte
fr&uuml;her durch die ZfCh.

<i>
<p>7.  Beabsichtigt die Bundesregierung regulative &Auml;nderungen bei der
Vergabe von Exportlizenzen?
</i>

<p>Zu 7.<br>

Das deutsche Exportkontrollsystem ist sowohl in seinen Rechtsnormen als auch
in der administrativen Handhabung im Zuge der Harmonisierung durch die
EG-Verordnung &uuml;ber die Ausfuhrkontrolle von G&uuml;tern mit doppeltem
Verwendungszweck, g&uuml;ltig ab 1.7.1995, angepasst worden.  Weitere
Anpassungen k&ouml;nnen aufgrund von Abstimmungen in Internationalen Gremien
erforderlich werden. Zur Zeit sind keine konkreten &Auml;nderungen in
Vorbereitung.

<i>
<p>8.  Ist der Bundesregierung eine Einflu&szlig;nahme von f&uuml;r
Kryptierungsfragen zust&auml;ndigen Beh&ouml;rden auf die Entwicklung von
Kryptiersystemen bekannt?
</i>

<p>zu 8.<br>
Das BSI nimmt Einflu&szlig; auf die Entwicklung von 
Verschl&uuml;sselungssystemen fuer den staatlichen Geheimschutzbereich, 
damit diese den dortigen besonderen Sicherheitsanforderungen 
entsprechen.

<i>
<p>9.  Ist der Bundesregierung eine Einflu&szlig;nahme von f&uuml;r
Kryptierungsfragen zust&auml;ndigen Beh&ouml;rden auf die
Exportf&auml;higkeit von Kryptiersystemen bekannt?
</i>

<p>Zu 9.<br>

Im Rahmen der Entscheidung &uuml;ber Ausfuhrantr&auml;ge sind die jeweils
unterschiedlichen Interessen sorgf&auml;ltig abzuw&auml;gen. Dabei hat die
Genehmigungbeh&ouml;rde den Sachverhalt unter Ber&uuml;cksichtigung aller
Interessen aufzukl&auml;ren. Auf Wunsch der Hersteller k&ouml;nnen
entwicklungsbegleitende Beratungen mit dem Ziel der Erf&uuml;llung der
rechtlichen Voraussetzungen fuer die Exportf&auml;higkeit von Systemen
erfolgen.

<i>
<p>10. Ist der Bundesregierung die Ansicht von Kryptierexperten bekannt,
bestimmte Verschl&uuml;sselungsstandards und -systeme seien durch
Einflu&szlig;nahme von f&uuml;r Kryptierungsfragen zust&auml;ndigen
Beh&ouml;rden, insbesondere der NSA, aufgeweicht worden und wie bewertet sie
diese Ansicht?
</i>

<p>Zu 10.<br>

Die restriktive Exportkontrollpolitik der USA auf dem Gebiet der 
Verschl&uuml;sselungstechnik ist allgemein bekannt; die Beratungspraxis des 
BSI gegen&uuml;ber der &ouml;ffentlichen Verwaltung und der deutschen 
Privatwirtschaft wahrt daher Zur&uuml;ckhaltung in der Empfehlung von 
derartigen Produkten US-amerikanischer Provenienz.

<i>
<p>11. Ist der Bundesregierung bekannt, aus welchem Grund die International 
Standards Organisation (ISO) ihren Gliederungen - Technical Commitees - 
die Normung von Kryptieralgorithmen verboten hat? Wenn ja, welche 
Position hat die Bundesregierung dabei vertreten?
</i>

<p>Zu 11.<br>

Nein.  Nach Auffassung der Bundesregierung ist Normung grunds&auml;tzlich
eine Angelegenheit der wirtschaftlich Beteiligigten.

<i>
<p>12. Wie bewertet die Bundesregierung Berichte, da&szlig; der
Softwarehersteller Lotus zur Erlangung einer Exportlizenz in den USA
f&uuml;r die neue Version 4.0 seines Produktes Lotus Notes 24 der 64 Bits
des Kryptierschschl&uuml;ssels US-Beh&ouml;rden bekannt geben mu&szlig;te?
</i>

<p>Zu 12.<br>

Es wird auf die Antwort zu Frage 10. verwiesen.

<i>
<p>13. Ist diese Software bei Bundesbeh&ouml;rden im Einsatz? Wenn ja, bei
welchen?
</i>

<p>Zu 13.<br>

Vollst&auml;ndige statistische Angaben hierzu liegen der Bundesregierung
nicht vor und k&ouml;nnen von ihr in der f&uuml;r die Beantwortung einer
Kleinen Anfrage zur Verf&uuml;gung stehenden Zeit nicht erhoben werden.

<i>
<p>14. Hat die Bundesregierung bei der Beratung der Erfordernisse einer 
gesetzlichen Regelung kryptographischer Verfahren seit Mitte 1995 
Fortschritte gemacht? Wenn ja, welche?
</i>

<p>Zu 14.<br>

Nein.

<i>
<p>15. Beabsichtigt die Bundesregierung, bei den angek&uuml;ndigten
gesetzlichen Regelungen einer elektronischen Unterschrift, die funktional
einem Verschl&uuml;sselungssystem gleichkommt, die Systeme einer
Lizensierung zu unterwerfen? Wenn ja, nach welchen Kriterien soll die
Lizensierung geschehen, vor allem auch im Hinblick auf die Sicherheit der
Systeme?
</i>

<p>zu 15.<br>

Die Bundesregierung pr&uuml;ft zur Zeit, in welcher Weise eine elektronische
Unterschrift (digitale Signatur) in das Gef&uuml;ge der Schriftformen des
BGB und der Vorschriften &uuml;ber den Urkundsbeweis eingef&uuml;gt werden
kann.  Dabei wird auch gepr&uuml;ft, ob die m&ouml;gliche gesetzliche
Anerkennung von Verfahren der digitalen Signatur davon abh&auml;ngig gemacht
werden soll, da&szlig; die Verfahren bestimmten Sicherheitsanforderungen
entsprechen, und ob die Erf&uuml;llung der Sicherheitsanforderungen vom BSI
oder einer vom BSI anerkannten Stelle nach &ouml;ffentlichen Kriterien
gepr&uuml;ft und best&auml;tigt werden soll.

<i>
<p>16. Welches Modell einer Schl&uuml;sselverwaltung strebt die
Bundesregierung dabei an?
</i>

<p>Zu 16.<br>

Eine Entscheidung f&uuml;r ein bestimmtes Modell ist noch nicht getroffen. 
Denkbar w&auml;re beispielsweise, da&szlig; die Beglaubigung
(Zertifizierung) der Signaturschl&uuml;ssel durch zugelassene
Zertifizierungsinstanzen im freien Wettbewerb erfolgen soll. Voraussetzung
f&uuml;r die Zulassung einer Zertifizierungsinstanz k&ouml;nnte sein,
da&szlig; diese die erforderliche Zuverl&auml;ssigkeit aufweist und
nachweislich bestimmte technisch-organisatorische Sicherheitsvorkehrungen
getroffen hat.

<i>
<p>17. Beabsichtigt die Bundesregierung bei den genannten Systemen eine
Beschr&auml;nkung der Schl&uuml;ssellaenge?
</i>

<p>Zu 17.<br>

Nein.

<i>
<p>18. H&auml;lt es die Bundesregierung f&uuml;r notwendig, die Nutzung von
bestimmten Kryptosystemen einzuschr&auml;nken bzw. zu verbieten?

<p>19. Wie realistisch ist nach Ansicht der Bundesregierung die Annahme, eine 
Beschr&auml;nkung von Kryptiersystemen auf einige zugelassene sichere die 
Abh&ouml;rmoeglichkeiten fuer Strafverfolgungsbeh&ouml;rden und 
Nachrichtendienste?
</i>

<p>Zu 18. und 19.<br>

Die Bundesregierung pr&uuml;ft das Erfordernis einer gesetzlichen Regelung
des Einsatzes von Verschl&uuml;sselungssystemen. Diese Pr&uuml;fung ist
bislang nicht abgeschlossen.

<i>
<p>20. Wie passen nach Ansicht der Bundesregierung ihre Pl&auml;ne einer
Regelung der elektronischen Unterschrift zu den Pl&auml;nen sowohl auf
EU-Ebene als auch den unterschiedlichen Pl&auml;nen zur Kryptographie auf der
Ebene der OECD-Staaten, und sieht die Bundesregierung Probleme bei der
Abstimmung?
</i>

<p>Zu 20.<br>

Die Entwicklung in den europ&auml;ischen bzw. internationalen Gremien
befindet sich derzeit im Fluss, so da&szlig; es f&uuml;r eine Bewertung der
verschiedenen Aktionen noch zu fr&uuml;h ist.

<i>
<p>21. Wie bewertet die Bundesregierung den Standpunkt der
US-Administration, bei Export und Nutzung von asymmetrischen
Kryptiersystemen auf solche Systeme hinzuwirken, die sicherstellen,
da&szlig; Strafverfolgungsbeh&ouml;rden und Geheimdienste sowohl eingehende
als auch ausgehende elektronische Kommunikation in bestimmten F&auml;llen
entschl&uuml;sseln k&ouml;nnen?
</i>

<p>Zu 21.<br>

Die Bundesregierung pr&uuml;ft derzeit, welche Auswirkungen das Konzept der
US-Administration auf den internationalen Waren- und Dienstleistungsverkehr
hat und welche Schl&uuml;sse daraus f&uuml;r die Politik der
Bundesregierung abzuleiten sind.

<i>
<p>22. Welche Ministerien, Beh&ouml;rden und &Auml;mter des Bundes sind zum
gegenw&auml;rtigen Stand &uuml;ber das Internet erreichbar, in welcher Weise
diese Systeme mit den &uuml;brigen DV-Systemen der jeweiligen Einrichtungen
verbunden und wie wird dabei die Sicherheit und Integrit&auml;t dieser
Systeme gew&auml;hrleistet?
</i>

<p>Zu 22.<br>

Vollst&auml;ndige statistische Angaben hierzu liegen der Bundesregierung
nicht vor und k&ouml;nnen von ihr in der f&uuml;r die Beantwortung einer
Kleinen Anfrage zur Verf&uuml;gung stehenden Frist nicht erhoben werden.

<p>Soweit Rechner an das Internet angeschlossen sind, haben sie entweder
keine oder eine &uuml;ber Gateways realisierte Verbindung mit den
&uuml;brigen DV-Systemen der jeweiligen Einrichtungen.

<p>Verf&uuml;gbarkeit, Vertraulichkeit und Integrit&auml;t von an das
Internet angeschlossenen Rechnern und lokalen Netzen bzw. der dort
verarbeiteten Daten werden durch eine der folgenden Ma&szlig;nahmen
gew&auml;hrleistet:

<ul>
<li>   Es werden Einzelarbeitspl&auml;tze benutzt, die nicht mit anderen
lokalen Rechnern vernetzt sind.
<li> Die Erreichbarkeit &uuml;ber das Internet ist auf wenige Dienste
beschr&auml;nkt (insbesondere Elektronischer Dokumentenaustausch), wobei
die Gateway-Rechner nur das Protokoll f&uuml;r den zugelassenen Dienst/die
zugelassenen Dienste akzeptieren.
<li> Zuk&uuml;nftig werden zunehmend Firewalls zum Einsatz kommen.
</ul>

<i>
<p>23. Zwischen welchen Beh&ouml;rden findet ein Datenaustausch statt und wie
wird dieser gesichert? In welchem Umfang hat das BSI Sicherheitskonzepte
daf&uuml;r erarbeitet?
</i>

<p>Zu 23.<br>

Datenaustausch findet zwischen denjenigen Beh&ouml;rden statt, deren
gesetzliche Aufgaben eine Zusammenarbeit erfordern. Die Anforderungen an
Verf&uuml;gbarkeit, Vertraulichkeit und Integrit&auml;t sind dabei sehr
unterschiedlich. Daher sind auch die erforderlichen
Sicherheitsma&szlig;nahmen verschieden. Die Bundesbeh&ouml;rden
verf&uuml;gen &uuml;ber IT- Sicherheitskonzepte, in denen die IT-Verfahren
untersucht und die jeweiligen Sicherheitsma&szlig;nahmen dargestellt werden.
Das BSI hat sowohl f&uuml;r die Sicherung der Vertraulichkeit beim
Datenaustausch zwischen Beh&ouml;rden, wie auch zur Absicherung von
Internet-Zug&auml;ngen Sicherheitskonzeptionen entwickelt.

<i>
<p>24. Hat es bei einem derartigen Datenaustausch Sicherheitsanalysen durch
den Bundesrechnungshof gegeben und zu welcher Bewertung ist dieser gekommen?
</i>

<p>Zu 24.<br>

Es gab verschiedene Sicherheitsanalysen mit unterschiedlichen 
Ergebnissen.

<i>
<p>25. Ist ein Ministerium, eine Beh&ouml;rde oder ein Amt im
Verantwortungsbereich des Bundes jemals Opfer eines &quot;Hackers&quot;
geworden? Wenn ja, um welche Beh&ouml;rde handelte es sich, wurde ein
Angreifer indentifiziert, ein Verfahren eingeleitet und zu welchem Ergebnis
kam dies? Wurden ueberdies Daten manipuliert oder zerst&ouml;rt?
</i>

<p>Zu 25.<br> 

Der Bundesregierung ist nicht bekannt, da&szlig; Hacker nachweislich in eine
der genannten Stellen eingedrungen sind.

<i>
<p>26. Ist der Bundesregierung die amerikanische Software &quot;PROMIS&quot;
(Prosecutor´s Management System) bekannt und ist sie in ihrem
Verantwortungsbereich im Einsatz? Wenn ja, zu welchem Zweck und bei welcher
Beh&ouml;rde?
</i>

<p>Zu 26.<br> 

Nein.

<i>
<p>27. Hat die Bundesregierung f&uuml;r die Beschaffung von Software
Richtlinien, in denen IT-Sicherheitsaspekte ber&uuml;cksichtigt werden?
</i>

<p>Zu 27.<br> 

Ja, bereichsspezifisch.

<i>
<p>28. Gibt es Bereiche, in denen nur sicherheitsgepr&uuml;fte Software zum
Einsatz kommt? Wenn ja, welche?
</i>

<p>Zu 28.<br>

Nein.

<i>
<p>29. Ist der Bundesregierung in einer Einrichtung des Bundes jemals ein 
Softwareprodukt zur Kenntnis gelangt, das ein unerkl&auml;rliches 
Sicherheitsloch - eine Sicherheits-trapdoor - auswies? Wenn ja, um welche 
Software handelte es sich?
</i>

<p>Zu 29.<br>

Nein.

<i>
<p>30. Lassen sich derartige Sicherheitsl&ouml;cher nach Erkenntnissen des
BSI ohne Kenntnis des Quellcodes systematisch aufsp&uuml;ren? Wenn ja, mit
welchem Aufwand?
</i>

<p>Zu 30.<br> 

Zum Aufsp&uuml;ren solcher Sicherheitsl&uuml;cken ist die Inspektion
wesentlicher Teile des Quellcodes unerl&auml;sslich; jedoch ist dies allein
nicht ausreichend.  Manche Sicherheitsl&uuml;cken sind erst im sogenannten
Object-Code zu erkennen; somit sind Compiler und Libraries der angewandten
Programmiersprachen ebenfalls zu untersuchen. Arbeitet man nur auf der Basis
einfacher Tests, so ergeben sich mehr zuf&auml;llige Aussagen.  Bestenfalls
kann ein vermutetes Sicherheitsloch best&auml;tigt oder widerlegt werden;
die Abwesenheit von Sicherheitsl&ouml;chern nachzuweisen, kann dagegen nur
mit einer eingehenden Analyse von Quell- und Object-Code erfolgen. Dabei ist
der Einsatz bestimmter Pr&uuml;fwerkzeuge zwingend.

<i>
<p>31. Trifft es nach Kenntnis der Bundesregierung zu, da&szlig;
bundesdeutsche &quot;Hacker&quot;, die in den 80er Jahren in bestimmte
Rechnersysteme in den USA eindrangen, ein Sicherheitsloch in den
VAX/VMS-Betriebssystemen der Versionen 4.4 und 4.5 benutzten?
</i>

<p>Zu 31.<br>

Nach Kenntnis der Bundesregierung war in Version 4.4 VAX/VMS im Bereich
&quot;Security Service&quot; ein Sicherheitsloch vorhanden, so da&szlig;
auch unberechtigte Benutzer weitere Rechte vergeben konnten.



<hr>


<a name=export>
<h1>Exportkontrolle in den USA</h1>
</a>

Die US-Regierung hat schon h&auml;ufig den Export guter
kryptographischer Technologie verboten, und dieses Verbot kann auch
PGP betreffen. Diese Art von Programmen wird wie Kriegswaffen
behandelt. Die Rechtsgrundlage hierf&uuml;r ist eine einfache
Verordnung des State Departement, des Defense Departement und des
Commerce Departement, kein richtiges Gesetz. Ich selbst werde diese
Art Software nicht aus den USA oder Kanada exportieren, f&uuml;r den
Fall, da&szlig; dies gem&auml;&szlig; den Verordnungen des State
Departement illegal ist, und ich &uuml;bernehme keine Verantwortung
f&uuml;r den m&ouml;glichen Export durch andere.
<p>
Wenn Sie au&szlig;erhalb der USA und Kanadas leben, rate ich Ihnen,
gegen diese Verordnungen des State Departement nicht dadurch zu
versto&szlig;en, da&szlig; Sie sich PGP aus den USA besorgen.
Tausende von US-B&uuml;rgern haben sich PGP nach seiner ersten
Ver&ouml;ffentlichung besorgt, und irgendwie ist es dann aus den USA
herausgekommen und hat sich dann wie Unkraut von selbst
weiterverbreitet. Wenn PGP bereits den Weg in Ihr Land gefunden hat,
dann werden Sie wahrscheinlich keine US-Exportgesetze verletzen, wenn
Sie sich PGP aus einer Quelle au&szlig;erhalb der USA besorgen.
<p>
Die Versionen 2.0 bis 2.3a von PGP entstanden au&szlig;erhalb der USA
und wurden dort ver&ouml;ffentlicht, auf &ouml;ffentlich
zug&auml;nglichen Computern in Europa. Jede dieser
Ver&ouml;ffentlichungen hat ihren Weg in die USA gefunden. Es gibt
einige Beschr&auml;nkungen in den USA, die die Einfuhr von
Kriegswaffen reglementieren, aber diese sind meines Wissens nie auf
Software angewendet worden. Juristische Ma&szlig;nahmen gegen einen
solchen Import d&uuml;rften eine spektakul&auml;re Auseinandersetzung
ergeben.
<p>
Die Versionen 2.4-2.6 entstanden in den USA und d&uuml;rfen nicht von
dort exportiert werden.(*) Die ftp-Site des MIT ergreift
Schutzma&szlig;nahmen gegen den Export dieser Software, wie sie auf
anderen Rechnern bereits seit langem praktiziert werden. Bitte
versuchen Sie nicht, diese Schutzmechanismen zu umgehen, um die
zuk&uuml;nftige Entwicklung von PGP nicht zu gef&auml;hrden.

<hr><i>
 (*)Die Version 2.6 ist selbstverst&auml;ndlich in Europa problemlos und
ohne das Brechen irgendeines Gesetzes zu erhalten. d.&Uuml;.
</i><hr>

Die folgenden Formulierungen wurden der Firma ViaCrypt von der
US-Regierung zur Aufnahme in die Dokumentation von ViaCrypt-PGP
vorgelegt: &quot;PGP unterliegt Exportbeschr&auml;nkungen durch das
Amt f&uuml;r Exportverwaltung beim Wirtschaftsministerium, durch die
&Auml;mter f&uuml;r die Kontrolle des Handels mit
Verteidigungsg&uuml;tern und f&uuml;r die Kontrolle von
Kriegsmaterial beim Verteidigungsministerium. PGP kann weder direkt
noch indirekt exportiert oder reexportiert werden, (a) ohne die
gem&auml;&szlig; den in Frage kommenden Gesetzen erforderlichen
Export- bzw. Reexportgenehmigungen und ohne Zustimmung der Regierung,
oder (b) in Verletzung jeglicher Verbote des Exports bzw. Reexports
von PGP oder Teilen von PGP.&quot;(*) Die US-Regierung ist
m&ouml;glicherweise der Auffassung, da&szlig; die Freeware-Versionen
von PGP ebenfalls unter diese Bestimmungen fallen.

<hr><i>
 (*)Wir haben mit juristischem Englisch nicht viel Erfahrung. Wir wollen
deshalb den Leserinnen, die des Englischen kundig sind, das Original
dieses auf Deutsch doch etwas seltsam anmutenden Textes nicht
vorenthalten:<cite> &quot;documentation: PGP is export restricted by the
Office of Export Administration, United States Departement of
Commerce and the Offices of Defense Trade Controls and Munitions
Control, United States Departement of State. PGP cannot be exported
or reexported, directly or indirectly, (a) without all export or
reexport licenses and governmental approvals required by any
applicable laws, or (b) in violation of any prohibition against the
export or reexport of any part of PGP.&quot;</cite>
</i><hr>

Einige ausl&auml;ndische Regierungen verh&auml;ngen hohe Strafen
allein f&uuml;r verschl&uuml;sselte Kommunikation. In manchen
L&auml;ndern kann man daf&uuml;r sogar erschossen werden. Aber wenn
man in so einem Land lebt, braucht man PGP vielleicht um so mehr.

<blockquote><i>
<strong>Aber!</strong> Falls Sie jemand darum
bittet, unverschl&uuml;sselt zu senden, beachten Sie bitte diese
Aufforderung unbedingt. In Kriegsgebieten kann das Empfangen einer
verschl&uuml;sselten Nachricht f&uuml;r die Empf&auml;ngerin
bedeuten, als Spionin sofort und ohne gerichtliches Verfahren
standrechtlich erschossen zu werden!<p>
Im ZCONNECT-Datenaustauschverfahren der Zerberus GmbH ist deswegen ein
eigener Header definiert worden, der auffordert, beim Antworten auf
gar keinen Fall verschl&uuml;sselte Texte zu senden (was zum Beispiel
von MailBox- oder Pointsoftware ausgewertet werden kann).
&Uuml;brigens: Auch die Briefumschl&auml;ge des Roten Kreuzes werden
in Krisenregionen immer unverschlossen transportiert.
</i></blockquote>

<a name=recht>
<h1>Philip Zimmermanns rechtliche Situation</h1>
</a>

<i>Hier stand die Geschichte eines Mannes, der ein politisch brisantes
Produkt (Privatsph&auml;re) &ouml;ffentlich zug&auml;nglich machte und
daraufhin Ziel einer Untersuchung wegen Versto&szlig; gegen das Exportverbot
f&uuml;r Kriegswaffen geworden ist. Dieses Verfahren ist inzwischen
gl&uuml;cklicherweise eingestellt worden, es wird keine Anzeige erhoben.<p>
Allen Spenderinnen und Spendern einen herzlichen Dank!</i>
<p>

Hinweise auf Pressemeldungen zu diesem Thema finden Sie im
Literaturverzeichnis im Abschnitt <a
href=pgp.2.6.html#Pressemeldungen>Pressemeldungen</a>.



<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a> 1996-03-26</address>
</BODY>
</HTML>
