<HTML>
<head>
<title>PGP = Vorwort zur deutschen &Uuml;bersetzung</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#einsatzgebiete>Einsatzgebiete von PGP</a><br>
<a href=#fachbegriffe>&Uuml;bersetzung und Fachbegriffe</a><br>
<a href=#definitionen>Begriffsdefinitionen</a><br>
<a href=#vorschlag>Lernvorschlag</a><br>
<a href=#dank>Danksagungen</a>

<hr>

<a name="einsatzgebiete">
<h1>Einsatzgebiete von PGP</h1>
</a>

PGP ist ein Programm f&uuml;r die Verschl&uuml;sselung von
Nachrichten. Richtig eingesetzt, schlie&szlig;t es die
M&ouml;glichkeit, per E-Mail oder Diskette versandte Daten ohne
Berechtigung zu entschl&uuml;sseln, weitgehend aus. Es ist aber kaum
dazu geeignet, Daten auf einem Computer in komfortabler und
zuverl&auml;ssiger Weise vor fremdem Zugriff zu sch&uuml;tzen. Dies
sollte bei der Verwendung von PGP beachtet werden. F&uuml;r eine
genauere Diskussion dieses Themas sei auf den zweiten Teil des
Handbuchs verwiesen.
<p>
F&uuml;r MS-DOS gibt es mittlerweile mindestens zwei gute
Freeware-Programme f&uuml;r die Verschl&uuml;sselung von Daten auf
Festplatten und Disketten, SFS und Secure Drive. Secure Drive kommt
aus den USA, unterliegt also den US-Exportrestriktionen.
<p>
F&uuml;r Amiga-DOS gibt es die M&ouml;glichkeit, das xfh-Filesystem
zweckentfremdet zu benutzen und die <kbd>xpkIDEA.library</kbd> als
Packer einzustellen. Diese verwendet denselben Algorithmus wie PGP.
<p>
F&uuml; Unix-Systeme bietetr sich die Verwendung des cfs (cryptographic file
system) an. Auch hier l&auml;&szlig;t sich IDEA verwenden.

<a name="fachbegriffe">
<h1>&Uuml;bersetzung und Fachbegriffe</h1>
</a>

Bei &Uuml;bersetzungen ist es h&auml;ufig schwer zu entscheiden, in
welchem Umfang Fachbegriffe eingedeutscht werden sollten. Werden zu
viele Begriffe &uuml;bersetzt, kann das Leser verwirren, denen die
englischen Begriffe vertraut sind. Umgekehrt kann ein zu wenig
eingedeutschter Text f&uuml;r diejenigen unverst&auml;ndlich bleiben,
die die englischen Begriffe nicht kennen. Wir haben uns f&uuml;r eine
recht weitgehende Eindeutschung entschieden. Um nicht zuviel
Verwirrung zu stiften, folgt eine Liste der Worte, bei denen wir im
Zweifel waren, ob eine &Uuml;bersetzung sinnvoll ist:
<p>
<pre>
englischer Begriff          unsere &Uuml;bersetzung<p>
batch file                  Stapeldatei
directory                   Verzeichnis
environment variable        Umgebungsvariable
exit code                   Beendigungscode
file name extension         Namenserweiterung / Suffix
fingerprint                 Fingerabdruck
grassroot organization      politische Basisorganisation
key compromise /
    revocation cerificate   Schl&uuml;ssel-R&uuml;ckrufurkunde
key ring                    Schl&uuml;sselbund
message digest              Textpr&uuml;fsumme
pass phrase                 Mantra
public key ring             &ouml;ffentlicher Schl&uuml;sselbund
private key ring            geheimer Schl&uuml;sselbund
swapfile                    Auslagerungsdatei
</pre>
<p>
Wir waren uns uneinig &uuml;ber die Verwendung maskuliner und
femininer Formen bei Begriffen wie &quot;Anwender&quot; oder
&quot;Programmiererin&quot;. In dieser Anleitung wird nicht die im 
Deutschen immer h&auml;ufiger anzutreffende Schreibweise 
&quot;AnwenderIn&quot; verwendet, sondern eine Mischung
nach dem Zufallsprinzip. In jedem Fall sind beide Geschlechter
gemeint.

<a name="definitionen">
<h1>Begriffsdefinitionen</h1>
</a>

Die Kryptographie hat wie andere Fachgebiete auch ihren eigenen
Jargon. Als kleine Lesehilfe soll das folgende Glossar dienen:
<dl>
<dt>Algorithmus
<dd> Eine Rechenvorschrift. (Informatikerinnen m&ouml;gen mir die stark
verk&uuml;rzte Erkl&auml;rung verzeihen.)

<dt>Angriff
<dd> Der Versuch, verschl&uuml;sselte oder
anderweitig nicht offen zug&auml;ngliche Daten zu erhalten, d.h. sie
ohne Berechtigung zu lesen oder zu kopieren.

<dt> Klartext
<dd> Mit Klartext ist im Zusammenhang mit
Verschl&uuml;sselung von Computerdaten nicht nur Text im Sinne von
&quot;f&uuml;r den Menschen lesbar&quot; gemeint, sondern alle nicht
verschl&uuml;sselten Daten. PGP verschl&uuml;sselt einzelne Dateien,
so da&szlig; &quot;Klartext&quot; in diesem Handbuch und allgemein
bei der Benutzung von PGP als &quot;unverschl&uuml;sselte Datei&quot;
gelesen werden kann.

<dt>Kryptanalyse
<dd> Methoden und Verfahren, um
chiffrierte Daten ohne vorherige Kenntnis des Schl&uuml;ssels zu
entschl&uuml;sseln.

<dt>Kryptologie
<dd> Die Lehre von der Verschl&uuml;sselung.

<dt>Kryptographie
<dd> Die praktische Anwendung der Kryptologie.

<dt>Nachricht
<dd> Mit &quot;Nachricht&quot; ist im Rahmen
dieses Handbuches eine einzelne - verschl&uuml;sselte oder
unverschl&uuml;sselte - Datei gemeint.
</dl>

Hinweis: Die Begriffe &quot;geheimer Schl&uuml;ssel&quot; und
&quot;privater Schl&uuml;ssel&quot; meinen dasselbe.
<p>
Wir haben uns M&uuml;he gegeben, Begriffe mit wohldefinierter
Bedeutung f&uuml;r PGP eindeutig zu w&auml;hlen. Formulierungen wie
&quot;10 verlorene Bereiche in 8 Bereichen&quot; (dies verlautbarten
&auml;ltere Versionen des MS-DOS-Programms CHKDSK) haben sich
hoffentlich nicht eingeschlichen.
<p>
Philip Zimmermann schreibt an einigen Stellen in der ersten Person.
Wir haben diese Form beibehalten. Bei der &Uuml;berarbeitung zur dritten
Auflage haben wir uns allerdings vom Original gel&ouml;st, so da&szlig;
inzwischen &quot;ich&quot; bzw. &quot;wir&quot; auf alle drei Autoren
bezogen werden sollte, auch wenn diese nicht immer einer Meinung sind. :-)

<a name="vorschlag">
<h1>Lernvorschlag</h1>
</a>

Hat man einmal verstanden, wie PGP arbeitet, ist der allt&auml;gliche
Umgang mit dem Programm verh&auml;ltnism&auml;&szlig;ig einfach.
<p>
Anf&auml;nger stehen bei PGP aber h&auml;ufig vor einem ganzen Berg
von Fragen: Wer kann mit dem &ouml;ffentlichen Schl&uuml;ssel was
anfangen, wozu dient der private Schl&uuml;ssel, weshalb mu&szlig;
ich beim Unterschreiben ein Mantra angeben usw. Viele dieser Fragen
lassen sich durch sorgf&auml;ltiges Lesen des Handbuches und der FAQs
beantworten. Trotzdem k&ouml;nnen Verst&auml;ndnisprobleme bestehen
bleiben. Hier bietet es sich an, ein wenig mit PGP zu
&quot;spielen&quot;. Weil PGP ein Programm f&uuml;r die
Verschl&uuml;sselung von <em>Nachrichten</em> ist, sollten Sie beim
Ausprobieren auch Nachrichtenversand spielen: Richten Sie mehrere
Verzeichnisse auf Ihrer Festplatte ein, die jeweils die Texte und die
PGP-Programmdateien einer fiktiven Nutzerin enthalten. Unter MS-DOS
beispielsweise:

<pre><kbd>
C:\PGPTST\WILLI
C:\PGPTST\SABINE
C:\PGPTST\OSKAR
C:\PGPTST\HELGA
</kbd></pre>

Erzeugen Sie f&uuml;r alle Personen ein PGP-Schl&uuml;sselpaar,
tauschen Sie die Schl&uuml;ssel unter den Personen aus, schreiben Sie
z.B. &quot;als Sabine&quot; einen Brief an Willi, verschl&uuml;sseln
Sie den Brief f&uuml;r Willi, kopieren Sie den verschl&uuml;sselten
Brief mit dem COPY-Befehl o.&auml;. in das Verzeichnis von Willi, und
entschl&uuml;sseln Sie als &quot;Willi&quot; wieder den Brief.
<p>
Probieren Sie auch andere Funktionen von PGP aus: Unterschriften
unter Schl&uuml;ssel, Versand einer Nachricht an mehrere
Empf&auml;nger etc.

<a name="dank">
<h1>Danksagungen</h1>
</a>

Von vielen Leuten bekamen wir Tips und Hilfen f&uuml;r die
&Uuml;bersetzung. In Bielefeld waren das insbesondere Elke, Gerhard
und Ingo. Marc Aurel gab einige wichtige Hinweise auf
&quot;Fehlleistungen&quot;, die uns in der Beta-Version der
&Uuml;bersetzung unterlaufen sind. Radi hat viel Arbeit in das Layout
der gedruckten Version des Handbuches gesteckt.
<p>
Die Arbeit an der &Uuml;bersetzung hat uns Spa&szlig; gemacht, nicht
zuletzt, weil Philip Zimmermanns originaler Text gut lesbar und sehr
informativ ist. Wir hoffen, da&szlig; die deutsche Version nicht zu
hohe Qualit&auml;tsverluste aufweist.
<pre>
<address><a href="mailto:c.creutzig@bionic.zerberus.de">Christopher Creutzig</a>
<kbd>&lt;c.creutzig@bionic.zerberus.de&gt;</kbd>
<a href="mailto:a.deuring@bionic.zerberus.de">Abel Deuring</a>
<kbd>&lt;a.deuring@bionic.zerberus.de&gt;</kbd></address></pre>

<hr>
Dies ist Zugriff <!--#exec cgi=/cgi-bin/belcount.cgi" --> auf diese Seite.


<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1996-03-06</address>
</BODY>
</HTML>
