<HTML>
<head>
<title>PGP = Angriffsm&ouml;glichkeiten</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#mantra>Bekannt gewordenes Mantra und bekannt gewordener geheimer
Schl&uuml;ssel</a><br>
<a href=#schluessel>F&auml;lschung des &ouml;ffentlichen
Schl&uuml;ssels</a><br>
<a href=#zeit>Schutz gegen gef&auml;lschte Zeitangaben</a><br>
<a href=#dateien>Schutz gegen gef&auml;lschte Zeitangaben</a><br>
<a href=#viren>Viren und Trojanische Pferde</a><br>
<a href=#physsich>L&uuml;cken in der physischen Sicherheit</a><br>
<a href=#tempest>&quot;Sturmangriffe&quot; (tempest attacks)</a><br>
<a href=#[Manipulation]>Probleme bei Mehrplatz-Computern</a><br>
<a href=#traffic>Statistik von Nachrichtenverbindungen</a><br>
<a href=#analyse>Kryptoanalyse</a>

<hr>

<a name=[Schwachstellen]>
Kein Datensicherheitssystem ist unangreifbar.</a> Die Sicherheit von PGP
kann auf vielerlei Art ausgehebelt werden. Bei jedem
Datensicherheitssystem m&uuml;ssen die Anwender beurteilen, ob die
Daten, die gesch&uuml;tzt werden sollen, f&uuml;r den Angreifer so
viel Wert haben, da&szlig; sich f&uuml;r ihn der Aufwand eines
Angriffs lohnt. Dies kann durchaus zu der Entscheidung f&uuml;hren,
sich nur vor simplen Angriffen zu sch&uuml;tzen, ohne sich um
aufwendige Angriffe Gedanken zu machen.
<p>
Die folgende Diskussion mag manchmal ma&szlig;los paranoid
erscheinen, aber so eine Einstellung ist f&uuml;r eine fundierte
Auseinandersetzung mit m&ouml;glichen Angriffen durchaus angemessen.

<a name=mantra>
<h1>Bekannt gewordenes Mantra und bekannt gewordener geheimer
Schl&uuml;ssel</h1>
</a>

Die wahrscheinlich einfachste Angriffsm&ouml;glichkeit ergibt sich,
wenn man das Mantra f&uuml;r den geheimen Schl&uuml;ssel irgendwo
aufschreibt. Falls jemand dieses Mantra lesen kann und ihm dann noch
die Datei mit dem geheimen Schl&uuml;ssel in die H&auml;nde
f&auml;llt, kann er alle verschl&uuml;sselten Nachrichten lesen und
mit dem geheimen Schl&uuml;ssel gef&auml;lschte digitale
Unterschriften erzeugen.
<p>
Offensichtliche Passworte, die einfach zu raten sind - wie
beispielsweise die Namen von Kindern oder der Partnerin - sind
ungeeignet. Ein einzelnes Wort als Mantra kann ebenfalls leicht
geraten werden, wenn ein Computer die W&ouml;rter eines Lexikons
solange als Passw&ouml;rter ausprobiert, bis das richtige gefunden
ist. Deshalb ist eine Kombination mehrerer W&ouml;rter, von uns
&quot;Mantra&quot; genannt, wesentlich besser als ein einfaches
Passwort. Ein verfeinerter Angriff k&ouml;nnte darin bestehen, einen
Computer ein Lexikon mit ber&uuml;hmten Zitaten durcharbeiten zu
lassen, um das Mantra zu finden. Eine leicht zu merkendes, aber
schwer erratbares Mantra l&auml;&szlig;t sich bequem aus ein paar
kreativ sinnlosen Spr&uuml;chen oder weithin unbekannten
literarischen Zitaten zusammenstellen.
<p>
Weiteres hierzu steht im Abschnitt <a
href=pgp.1.5.html#[ManiSchutz]>&Ouml;ffentliche
Schl&uuml;ssel vor Manipulation sch&uuml;tzen</a>.

<a name=schluessel>
<h1>F&auml;lschung des &ouml;ffentlichen Schl&uuml;ssels</h1>
</a>

Eine der gef&auml;hrlichsten Angriffsm&ouml;glichkeiten besteht
darin, da&szlig; der &ouml;ffentliche Schl&uuml;ssel gef&auml;lscht
werden kann. Dies ist der wirklich bedeutende und ernsthafte
Ansatzpunkt f&uuml;r das Knacken einer Verschl&uuml;sselung mit
&ouml;ffentlichen Schl&uuml;sseln, unter anderem deswegen, weil die
meisten Neulinge die Gefahr nicht sofort erkennen. Die Bedeutung der
F&auml;lschbarkeit eines Schl&uuml;ssels und geeignete
Gegenma&szlig;nahmen sind detailliert im Abschnitt <a
href=pgp.1.5.html#[ManiSchutz]>&Ouml;ffentliche
Schl&uuml;ssel vor Manipulation sch&uuml;tzen</a> beschrieben.
<p>
Zusammengefa&szlig;t: Wenn man einen &ouml;ffentlichen Schl&uuml;ssel
f&uuml;r die Verschl&uuml;sselung einer Nachricht oder f&uuml;r die
Pr&uuml;fung einer Unterschrift verwenden will, mu&szlig;
sichergestellt sein, das er nicht gef&auml;lscht ist. Der Echtheit
eines neu erhaltenen &ouml;ffentlichen Schl&uuml;ssels sollte man nur
dann vertrauen, wenn man ihn unmittelbar, auf sicherem Weg, von
seinem Besitzer erhalten hat, oder wenn seine Echtheit von jemandem
best&auml;tigt ist, dem man vertraut. Man mu&szlig; auch daf&uuml;r
sorgen, da&szlig; kein Fremder &Auml;nderungen an dem eigenen
&ouml;ffentlichen Schl&uuml;sselbund vornehmen kann. Man braucht
physikalische Kontrolle sowohl &uuml;ber den Bund mit
&ouml;ffentlichen Schl&uuml;sseln wie auch &uuml;ber den Bund mit
geheimen Schl&uuml;sseln. Am besten aufgehoben sind diese beiden
Dateien auf dem eigenen PC, um einiges schlechter auf einem am Ende
auch noch r&auml;umlich weit entfernten Mehrplatz-Rechner. Auf jeden
Fall sollte man Sicherheitskopien der beiden Schl&uuml;sseldateien
haben (siehe auch Abschnitt <a href=pgp.2.2.html#[Bakring]>BAKRING</a>).

<a name=zeit>
<h1>Schutz gegen gef&auml;lschte Zeitangaben</h1>
</a>

Eine nicht ganz leicht verst&auml;ndliche Angreifbarkeit von PGP
betrifft unehrliche Benutzer, die gef&auml;lschte Zeitangaben
f&uuml;r die Best&auml;tigung ihrer &ouml;ffentlichen Schl&uuml;ssel
und ihre Unterschriften verwenden. Leser, die PGP nur gelegentlich
benutzen und mit den T&uuml;cken &ouml;ffentlicher Schl&uuml;ssel
nicht sehr vertraut sind, k&ouml;nnen diesen Abschnitt
&uuml;berspringen.
<p>
Nichts hindert eine unehrliche Benutzerin daran, die Einstellung von
Datum und Zeit auf ihrem Computer zu &auml;ndern und bei dieser
falschen Datumseinstellung ihre Schl&uuml;sselbest&auml;tigungen und
Unterschriften zu erzeugen. So kann diese unehrliche Benutzerin es so
erscheinen lassen, als habe sie eine Unterschrift viel fr&uuml;her
oder sp&auml;ter geleistet, als es tats&auml;chlich der Fall ist,
oder als habe sie ihr Paar von &ouml;ffentlichem und geheimem
Schl&uuml;ssel zu einem anderen Zeitpunkt generiert. Dies kann von
juristischem oder finanziellem Nutzen sein. Beispielsweise kann
dadurch ein Schlupfloch entstehen, um eine Unterschrift nicht
anerkennen zu m&uuml;ssen.
<p>
Abhilfe bieten k&ouml;nnten allgemein vertrauensw&uuml;rdige
Institutionen oder Notare, die notariell beglaubigte Unterschriften
mit einer vertrauensw&uuml;rdigen Zeitangabe machen k&ouml;nnen. Dies
setzt nicht notwendigerweise eine zentrale Institution voraus. Unter
Umst&auml;nden kann jeder vertrauensw&uuml;rdige Vermittler oder eine
unbeteiligte dritte Person diese Aufgabe wahrnehmen, &auml;hnlich
&ouml;ffentlich bestellten Notaren. Die Best&auml;tigung eines
&ouml;ffentlichen Schl&uuml;ssels k&ouml;nnte von dem Notar
unterschrieben werden, und die Zeitmarke bei der Unterschrift des
Notars k&ouml;nnte juristische Bedeutung erlangen. Der Notar
k&ouml;nnte &uuml;ber solche Best&auml;tigungen Protokoll
f&uuml;hren. Das Protokoll w&auml;re &ouml;ffentlich einsehbar.
<p>
Der Notar k&ouml;nnte auch die Unterschrift anderer durch seine
eigene Unterschrift best&auml;tigen. Dies k&ouml;nnte als
urkundliche, beweiskr&auml;ftige Unterschrift gelten, so wie es
&quot;real existierende Notare&quot; mit Unterschriften auf
Papierdokumenten seit langem machen. Auch in diesem Fall w&uuml;rde
der Notar &uuml;ber die Unterschriften Protokoll f&uuml;hren, indem
er die von dem Textdokument abgetrennten Unterschriften archiviert.
Die Unterschrift des Notars h&auml;tte eine vertrauensw&uuml;rdige
Zeitangabe, mit gr&ouml;&szlig;erer Glaubhaftigkeit als die
Zeitangabe der originalen Unterschrift. Eine Unterschrift w&uuml;rde
durch die hinzukommende notarielle Unterschrift und das Protokoll des
Notars &quot;Beweiskraft&quot; erhalten.
<p>
Das Problem notariell beglaubigter Unterschriften und
glaubw&uuml;rdiger Zeitmarken bedarf weiterer Diskussion. Eine gute
Abhandlung hier&uuml;ber ist der Aufsatz von Dorothy Denning in IEEE
Computer 1983 (siehe <a href=pgp.2.6.html#Literatur>Literaturverzeichnis</a>).
Die m&ouml;glichen Verfahren f&uuml;r Best&auml;tigung und Beglaubigung
m&uuml;ssen noch viel
detaillierter ausgearbeitet werden. Dies wird sich durch die
zunehmende Nutzung von PGP ergeben und dadurch, da&szlig; bei anderen
Programmen, die das Prinzip &ouml;ffentlicher Schl&uuml;ssel
verwenden, andere Best&auml;tigungsverfahren entwickelt werden.

<a name=dateien>
<h1>Nicht richtig gel&ouml;schte Dateien</h1>
</a>

Ein weiteres potentielles Sicherheitsproblem entsteht durch die Art
und Weise, wie bei den meisten Betriebssystemen Dateien gel&ouml;scht
werden. Wenn man eine Klartext-Datei verschl&uuml;sselt und danach
l&ouml;scht, l&ouml;scht das Betriebssystem die Daten nicht
physikalisch. Es markiert nur diejenigen Datenbl&ouml;cke der
Festplatte oder Diskette als &quot;gel&ouml;scht&quot;, die den
Inhalt der &quot;gel&ouml;schten&quot; Datei enthalten, so da&szlig;
sie f&uuml;r die Speicherung anderer Daten freigegeben werden. Das
ist das gleiche, als w&uuml;rde man vertrauliche Papiere einfach zum
Altpapier legen, anstatt sie von einem Rei&szlig;wolf
kleinh&auml;ckseln zu lassen.(*) Die Bl&ouml;cke auf der Festplatte
enthalten nach wie vor die originalen vertraulichen Daten und werden
vielleicht unter Umst&auml;nden demn&auml;chst mal irgendwann in
naher oder ferner Zukunft durch neue Daten &uuml;berschrieben. Wenn
ein Angreifer diese &quot;gel&ouml;schten&quot; Datenbl&ouml;cke kurz
nach ihrer Freigabe liest, hat er einige Aussicht, den kompletten
Klartext zu erhalten.

<hr><i>
 (*)Interessanterweise ist das aber alles, was das deutsche
Datenschutzgesetz verlangt. d.&Uuml;.
</i><hr>

Genau dies, die Wiederherstellung einer schon vor langem
gel&ouml;schten Datei, kann sogar ganz unabsichtlich passieren, wenn
aus irgend einem Grund etwas mit der Festplatte schief geht und
wichtige Dateien gel&ouml;scht oder besch&auml;digt sind. Die
&uuml;bliche Rettungsma&szlig;nahme besteht darin, ein
Dateiwiederherstellungsprogramm laufen zu lassen, um die Dateien zu
reparieren. Hierbei werden h&auml;ufig auch alte, schon vor dem
Unfall gel&ouml;schte Dateien wieder ausgegraben. Auf diese Art
k&ouml;nnen auch vertrauliche Daten wieder ans Tageslicht kommen, von
denen man annahm, da&szlig; sie f&uuml;r immer gel&ouml;scht seien.
Folglich k&ouml;nnen diese Daten von jedem gelesen werden
k&ouml;nnen, der ein solches Programm laufen l&auml;&szlig;t.
Dar&uuml;ber hinaus legen die meisten Textverarbeitungsprogramme auch
Backup-Dateien an, und erzeugen h&auml;ufig auch aus technischen
Gr&uuml;nden eine oder mehrere tempor&auml;re Dateien, die den
gesamten Text oder Teile davon enthalten. Diese Dateien werden vom
Textverarbeitungsprogramm automatisch gel&ouml;scht - aber eben nur
in dem Sinne, da&szlig; die Bl&ouml;cke auf der Festplatte oder
Diskette f&uuml;r ein &Uuml;berschreiben freigegeben werden. Der Text
selbst steht nach wie vor noch in diesen Bl&ouml;cken.
<p>
Hierzu eine wahre Horrorgeschichte: Eine Freundin von mir,
verheiratet und Mutter kleiner Kinder, hatte eine kurze und nicht
sehr ernstzunehmende Liebesaff&auml;re. Sie schrieb ihrem Liebhaber
auf dem Computer einen Brief, und nachdem sie den Brief abschickte,
l&ouml;schte sie die Datei. Nachdem die Aff&auml;re schon vorbei war,
ging die Diskette kaputt, auf der der Brief gespeichert war. Weil die
Diskette einige andere wichtige Daten enthielt, bat sie ihren
Ehemann, die Diskette zu reparieren. Der lie&szlig; die Diskette von
einem Datenwiederherstellungsprogramm bearbeiten, wobei neben den von
seiner Frau ben&ouml;tigten Dateien auch der besagte Brief wieder zu
Tage kam, was eine Kette tragischer Ereignisse ausl&ouml;ste. (*)

<hr><i>
 (*)Von weiteren Horrorgeschichten - darunter auch ein mutma&szlig;licher
Mordfall - &uuml;ber nicht richtig gel&ouml;schte Daten berichtet
Peter Gutmann in seinem Handbuch zu SFS.
</i><hr>

Um zu verhindern, da&szlig; der Klartext irgendwann einmal
ausgegraben wird, gibt es nur den einen Weg, die
&quot;gel&ouml;schten&quot; Daten auch wirklich zu
&uuml;berschreiben. Solange man nicht wirklich sicher wei&szlig;,
da&szlig; die freigegebenen Bl&ouml;cke der Festplatte oder Diskette
sehr schnell wieder mit anderen Daten &uuml;berschrieben werden(*),
mu&szlig; man selbst daf&uuml;r sorgen, da&szlig; die Klartext-Datei
und die tempor&auml;ren Dateien, die das Textverarbeitungsprogramm
angelegt hat, wirklich &uuml;berschrieben werden. Die Klartext-Datei
&uuml;berschreibt PGP, wenn die Option <kbd>-w</kbd> bei der
Verschl&uuml;sselung angegeben wird. S&auml;mtliche Textfragmente, ob
aus der &quot;richtigen&quot; Klartext-Datei oder aus tempor&auml;ren
Dateien, lassen sich mit einem geeigneten Hilfsprogramm l&ouml;schen,
das alle freien Bl&ouml;cke einer Festplatte oder Diskette
&uuml;berschreibt. F&uuml;r MS-DOS sind beispielsweise die Norton
Utilities geeignet.

<hr><i>
 (*)dieses Wissen haben bei den meisten Betriebssystemen, wenn
&uuml;berhaupt, nur ausgekochte Betriebssystemspezialisten d.&Uuml;.
</i><hr>
<blockquote><i>
Eine weitere Stelle, an der bei den meisten
Betriebssystemen &quot;Textspuren&quot; verbleiben k&ouml;nnen, sind
die &quot;swap files&quot; (auch Auslagerungsdateien genannt) bzw.
Swap-Partitionen: Wenn ein Programm mehr Hauptspeicher ben&ouml;tigt,
als real im Computer vorhanden ist, wird ein Teil des
Hauptspeicherinhalts in diese Auslagerungsdatei bzw. -partition
geschrieben, so da&szlig; der Hauptspeicher gewisserma&szlig;en auf
die Festplatte &quot;verl&auml;ngert&quot; wird. Auch in dieser
&quot;Auslagerungsdatei&quot; k&ouml;nnen Teile eines Textes stehen.
MS-DOS kennt keine Auslagerungsdateien - endlich mal ein Vorteil
dieses Betriebssystems, wenn auch nur im Hinblick auf
&quot;Spurensicherheit&quot;. Aber schon Microsoft Windows benutzt
eine Auslagerungsdatei, und zwar nicht zu knapp. d.&Uuml;.
</i></blockquote>

Selbst wenn man den Klartext auf der Festplatte oder Diskette
&uuml;berschreibt, kann ein technisch gut ausgestatteter Angreifer
die Daten wiedergewinnen. Geringe magnetische Spuren der
Originaldaten bleiben auch nach einem &Uuml;berschreiben auf der
Festplatte oder Diskette. Diese Spuren k&ouml;nnen unter
Umst&auml;nden mittels spezieller Hardware gelesen werden.

<a name=viren>
<h1>Viren und Trojanische Pferde</h1>
</a>

Eine andere Angriffsm&ouml;glichkeit k&ouml;nnte ein speziell
entwickelter Virus oder Wurm sein, der PGP oder das Betriebssystem
infiziert. Dieser hypothetische Virus k&ouml;nnte so entworfen sein,
da&szlig; er das Mantra, den geheimen Schl&uuml;ssel oder den
entschl&uuml;sselten Klartext &quot;mith&ouml;rt&quot; und unbemerkt
in eine Datei schreibt oder &uuml;ber ein Netzwerk zum Besitzer des
Virus schickt. Er k&ouml;nnte auch das Verhalten von PGP so
&auml;ndern, da&szlig; Unterschriften nicht richtig gepr&uuml;ft
werden. So ein Angriff ist einfacher und billiger als ein
kryptoanalytischer Angriff.
<p>
Ein Schutz hiergegen f&auml;llt unter das allgemeine Thema des
Schutzes gegen Viren. Es gibt einige relativ brauchbare kommerzielle
Anti-Virus-Produkte, und es gibt &quot;Hygienema&szlig;nahmen&quot;,
deren Beachtung das Risiko einer Virusinfektion erheblich reduzieren
kann. Eine umfassende Abhandlung dieses Themas w&uuml;rde den Rahmen
dieses Handbuchs sprengen. PGP selbst hat keinerlei inneren Schutz
gegen Viren, es geht davon aus, da&szlig; der PC, auf dem es benutzt
wird, eine &quot;vertrauensw&uuml;rdige Umgebung&quot; ist. Falls es
einmal so einen Spezialvirus f&uuml;r PGP geben sollte, ist zu
hoffen, da&szlig; eine entsprechende Warnung schnell bekannt wird und
viele Leute erreicht.
<p>
Ein &auml;hnlicher Angriff k&ouml;nnte eine geschickte Imitation von
PGP sein, die sich im Wesentlichen wie PGP verh&auml;lt, aber nicht
so arbeitet, wie anzunehmen w&auml;re. Beispielsweise k&ouml;nnte
diese Imitation absichtlich dahingehend verst&uuml;mmelt sein,
da&szlig; Unterschriften nicht mehr korrekt gepr&uuml;ft werden, so
da&szlig; gef&auml;lschte Schl&uuml;ssel nicht mehr erkannt werden
k&ouml;nnen. Eine solche Version von PGP - &auml;hnlich einem
&quot;Trojanischen Pferd&quot; - ist von einem Angreifer
verh&auml;ltnism&auml;&szlig;ig einfach erstellt, weil der Quellcode
von PGP weit verbreitet ist. Deshalb ist es kein Problem, den
Quellcode dahingehend zu manipulieren, da&szlig; eine Imitation von
PGP entsteht, die zwar echt aussieht, jedoch nur die Anweisungen
ihres teuflischen Meisters ausf&uuml;hrt. Dieses &quot;Trojanische
Pferd&quot; von PGP k&ouml;nnte weit verteilt werden, mit dem
Anschein, es k&auml;me von mir. Wie hinterh&auml;ltig.

<blockquote><i>
Die allgemeine Verf&uuml;gbarkeit des Quellcodes
von PGP hat aber auch einen anderen, vertrauensschaffenden Aspekt:
Die entsprechenden Programmierkenntnisse vorausgesetzt, ist es nur
noch eine Frage des Flei&szlig;es, den Quelltext auf obskure Stellen
durchzusehen. Au&szlig;erdem kann man das Programm neu
&uuml;bersetzen und sich so eine eigene Arbeitsversion erstellen. Der
im n&auml;chsten Absatz erw&auml;hnte Vergleich mehrerer
PGP-Versionen aus unterschiedlichen Bezugsquellen sollte aber
zumindest f&uuml;r die selbst erstellte Version vorsichtig
interpretiert werden: Selbst wenn der gleiche Compiler verwendet
wird, besteht immer noch die M&ouml;glichkeit, da&szlig; die eigene
PGP-Version mit der Compiler-Version 12.34a1 &uuml;bersetzt wird,
w&auml;hrend das Entwicklerteam Version 12.34b3 verwendet hat.
Unterschiede in den PGP-Versionen bedeuten deshalb nicht gleich das
Schlimmste. Auf der anderen Seite hei&szlig;t das aber auch,
da&szlig; ein neu &uuml;bersetztes PGP andere Benutzer verunsichern
kann. Deshalb sollte man normalerweise besser die Originalversion
weitergeben. d.&Uuml;.
</i></blockquote>

Man sollte sich die M&uuml;he machen, PGP von einer
zuverl&auml;ssigen Bezugsquelle zu erhalten, was auch immer das
hei&szlig;en mag. Oder man besorgt sich PGP von mehreren
unabh&auml;ngigen Quellen und vergleicht die einzelnen Versionen mit
einem geeigneten Programm.
<p>
Mit Hilfe digitaler Unterschriften ergeben sich weitere
M&ouml;glichkeiten festzustellen, ob an PGP herumgepfuscht wurde.
Wenn eine Person, der man vertraut, eine digitale Unterschrift
f&uuml;r die Datei mit dem ausf&uuml;hrbaren PGP-Programm(*) leistet
und damit garantiert, da&szlig; die Datei zum Zeitpunkt der
Unterschrift nicht infiziert oder anderweitig verf&auml;lscht ist,
kann man einigerma&szlig;en sicher sein, eine brauchbare Kopie zu
haben. Mit Hilfe einer &auml;lteren, vertrauensw&uuml;rdigen Version
von PGP kann die Unterschrift f&uuml;r die neue, zun&auml;chst
zweifelhafte Version kontrolliert werden. Dieser Test setzt
nat&uuml;rlich voraus, da&szlig; der f&uuml;r die Kontrolle der
Unterschrift verwendete &ouml;ffentliche Schl&uuml;ssel einen hohen
Grad an Vertrauen hat.

<hr><i>
 (*)F&uuml;r MS-DOS hei&szlig;t dies ganz schlicht: PGP.EXE d.&Uuml;.
</i><hr>

<a name=physsich>
<h1>L&uuml;cken in der physischen Sicherheit</h1>
</a>

Die meisten bisher besprochenen Sicherheitsprobleme ergeben sich,
auch ohne da&szlig; ein Angreifer unmittelbaren Zugang zu dem
Computer hat, auf dem die geheimzuhaltenden Daten gespeichert sind.
Ein direkter Zugriff auf den Computer oder ausgedruckte Texte ist
auch denkbar durch Einbruch, Durchsuchen des M&uuml;lls, eine
unerwartete oder unbegr&uuml;ndete Hausdurchsuchung, Bestechung,
Erpressung oder Bespitzelung. Von einigen dieser Angriffe
d&uuml;rften insbesondere politische Basisorganisationen betroffen
sein, die weitgehend auf freiwillige Mitarbeit angewiesen sind. Die
Presse hat einiges dar&uuml;ber berichtet, da&szlig; das FBI im
Rahmen seines COINTELPRO-Programms mit Einbruch, Infiltration und
illegalen Wanzen gegen Antikriegs- und B&uuml;rgerrechtsgruppen
gearbeitet hat. Nicht zu vergessen: Die Watergate-Aff&auml;re.(*)

<hr><i>
 (*)F&uuml;r die Bundesrepublik gilt &auml;hnliches - Spitzel von
Verfassungsschutz und Polizei hat es schon h&auml;ufig gegeben.
Mittlerweile geht die Diskussion ihres legalen Einsatzes bis zu der
Frage, ob in Zukunft verdeckt arbeitende Polizeibeamte mit
Gesetzessegen auch Straftaten begehen d&uuml;rfen. d.&Uuml;.
</i><hr>

Die Verwendung eines Verschl&uuml;sselungsprogramms kann ein
tr&uuml;gerisches, einschl&auml;ferndes Gef&uuml;hl der Sicherheit
entstehen lassen. Kryptographische Techniken sch&uuml;tzen Daten aber
nur solange, wie sie verschl&uuml;sselt sind. L&ouml;cher in der
unmittelbaren physischen Sicherheit k&ouml;nnen nach wie vor
Klartextdaten und geschriebene oder gesprochene Information
offenlegen.
<p>
Diese Art von Angriffen ist einfacher und billiger als ein
kryptoanalytischer Angriff auf PGP.

<a name=tempest>
<h1>&quot;Sturmangriffe&quot; (tempest attacks)</h1>
</a>

Eine andere Angriffsm&ouml;glichkeit f&uuml;r einen gut
ausger&uuml;steten Gegner ist die Auswertung der elektromagnetischen
Strahlung, die ein Computer aussendet. Ein solcher Angriff ist zwar
teuer und arbeitsintensiv, aber wahrscheinlich immer noch billiger
als eine richtige Kryptoanalyse. Ein entsprechend ausger&uuml;steter
Kleinbus k&ouml;nnte in der N&auml;he des abzuh&ouml;renden Computers
geparkt sein und jeden Tastendruck und jeden Bildschirminhalt
aufzeichnen. Das w&uuml;rde alle Passworte, Nachrichten usw.
offenlegen. Abwehren l&auml;&szlig;t sich dieser Angriff durch eine
geeignete Abschirmung des Computers, des Zubeh&ouml;rs (Drucker usw.)
und gegebenenfalls der Netzwerk-Verkabelung. Eine solche Abschirmung
ist unter dem Begriff &quot;sturmsicher&quot; bekannt, und wird von
einigen Regierungsbeh&ouml;rden und R&uuml;stungsfirmen eingesetzt.
Es gibt Firmen, die diese Abschirmungen anbieten, allerdings ist der
Kauf m&ouml;glicherweise genehmigungspflichtig. Woher das wohl kommt?
<p>
Wer allerdings der Meinung ist, derartig ausfeilten Angriffen
ausgesetzt zu sein, sollte sich ohnehin mit einem Sicherheitsberater
in Verbindung setzen.

<h1><a name=[Manipulation]>Probleme bei Mehrplatz-Computern</a></h1>

PGP wurde urspr&uuml;nglich f&uuml;r (Einplatz-)MS-DOS-Computer
entworfen, zu denen man unmittelbaren Zugang hat. Ich benutze PGP zu
Hause auf meinem privaten PC, und solange niemand einbricht oder die
elektromagnetischen Signale des PCs auswertet, sind die
Klartext-Dateien und die geheimen Schl&uuml;ssel wahrscheinlich
sicher.
<p>
Aber mittlerweile gibt es PGP auch f&uuml;r Unix und VAX/VMS, also
Mehrplatz-Betriebssysteme. Bei diesen Betriebssystemen besteht ein
wesentlich h&ouml;heres Risiko, da&szlig; Klartext-Dateien,
Schl&uuml;ssel oder Passworte offengelegt werden. Der Systemverwalter
oder ein versierter Eindringling kann die Klartext-Dateien lesen und
unter Umst&auml;nden auch mittels spezieller Software heimlich die
Tastatureingaben und die Bildschirmausgaben mitlesen. Unter Unix kann
jede Benutzerin mit dem Kommando <kbd>ps</kbd> einiges an
Informationen &uuml;ber die anderen Benutzer erhalten, beispielsweise
alle Umgebungsvariablen.(*) &Auml;hnliche Probleme gibt es f&uuml;r
MS-DOS-Rechner, die in einem Netzwerk arbeiten. Das aktuelle
Sicherheitsrisiko h&auml;ngt von der jeweiligen Situation ab. Ein
Mehrplatz-Rechner kann sicher sein, wenn man allen Benutzern traut
oder wenn die Sicherheitsmechanismen ausreichen, um den Angriffen von
Eindringlingen standzuhalten, oder auch, wenn es ganz einfach keine
hinreichend interessierten potentiellen Eindringlinge gibt. Manche
Unix-Systeme sind schon dadurch sicher, da&szlig; sie von nur einer
Person benutzt werden - es gibt bereits Notebooks, die mit Unix
arbeiten. PGP vollkommen von der Benutzung unter Unix
auszuschlie&szlig;en, w&auml;re unsinnig.

<hr><i>
 (*)Wenn jemand dann auf einer Unix-Mehrplatz-Maschine noch aus Faulheit
<kbd>pgppass</kbd> - nicht zu verwechseln mit <kbd>pgppath</kbd>! -
setzt, legt er sein Mantra allen anderen Benutzern offen. d.&Uuml;.
</i><hr>

PGP ist nicht daf&uuml;r gedacht, Daten zu sch&uuml;tzen, die als
Klartext auf einem schlecht gesch&uuml;tzten oder
&quot;aufgeflogenen&quot; Rechner vorhanden sind. Ebensowenig kann es
einen Eindringling davon abhalten, einen geheimen Schl&uuml;ssel
w&auml;hrend seiner Benutzung mitzulesen. Diese Risiken mu&szlig; man
sich gerade f&uuml;r Mehrplatz-Rechner klarmachen und die Erwartungen
an PGP und das eigene Verhalten darauf abstimmen. Aber vielleicht hat
die Leserin doch die M&ouml;glichkeit, PGP auf einem
&quot;isolierten&quot;, also nicht an ein Netzwerk angeschlossenen
Ein-Platz-PC zu verwenden, der unter ihrer unmittelbaren physischen
Kontrolle ist. Auf diese Weise setze ich PGP ein, und dazu rate ich
auch.

<a name=traffic>
<h1>Statistik von Nachrichtenverbindungen</h1>
</a>

Selbst wenn ein Angreifer nicht in der Lage ist, den Inhalt der
verschl&uuml;sselten Nachrichten zu lesen, hat er immer noch die
M&ouml;glichkeit, brauchbare Informationen daraus zu gewinnen, woher
Nachrichten kommen, an wen sie gehen, wie lang sie sind oder wann sie
geschrieben wurden. Dies entspricht der Auswertung von
Telefonverbindungen, ohne da&szlig; die einzelnen Gespr&auml;che
abgeh&ouml;rt werden. Das ist mit &quot;Statistik von
Nachrichtenverbindungen&quot; gemeint. PGP sch&uuml;tzt hiervor
nicht. Um dieses Problem zu l&ouml;sen, w&auml;ren speziell
hierf&uuml;r entworfene &Uuml;bertragungsprotokolle n&ouml;tig, die
m&ouml;glicherweise kryptographische Elemente enthalten.(*)

<hr><i>
 (*)Diese Art der &Uuml;berwachung, die eigentlich auch noch das durch
PGP verhinderte Durchsuchen der ganzen Post nach Schl&uuml;sselworten
einschlie&szlig;t, ist wohl die am besten genutzte
Informationsquelle, die Nachrichtendiensten zur Verf&uuml;gung steht.
Grunds&auml;tzlich l&auml;&szlig;t sich PGP aber auch zum
Verschleiern dieser Information verwenden, doch das w&uuml;rde hier
zu weit f&uuml;hren. d.&Uuml;.
</i><hr>

<a name=analyse>
<h1>Kryptoanalyse</h1>
</a>

Ein teurer und schwieriger kryptoanalytischer Angriff k&ouml;nnte von
einem Geheimdienst durchgef&uuml;hrt werden, der &uuml;ber ein
ausreichendes Arsenal von Supercomputertechnologie verf&uuml;gt.
Dieser Geheimdienst k&ouml;nnte einen RSA-Schl&uuml;ssel unter
Verwendung eines bahnbrechenden neuen, geheimgehaltenen Algorithmus
f&uuml;r die Primfaktorzerlegung knacken. Das ist denkbar, aber man
sollte nicht vergessen, da&szlig; die US-Regierung dem
RSA-Algorithmus soweit vertraut, da&szlig; mit ihm nach Aussage von
Ron Rivest Kernwaffen gesichert werden. Und im zivilen Bereich gibt
es seit 1978 intensive, aber erfolglose Versuche, RSA zu knacken.
<p>
M&ouml;glicherweise hat eine Regierung auch geheimgehaltene Methoden,
mit denen IDEA(TM), der bei PGP verwendete konventionelle
Verschl&uuml;sselungsalgorithmus, geknackt werden kann. Das w&auml;re
der schlimmste Alptraum eines jeden Kryptographen. In der praktischen
Kryptographie gibt es keine Garantie f&uuml;r absolute Sicherheit.
<p>
Doch nach wie vor ist etwas Optimismus gerechtfertigt. Die Entwickler
von IDEA geh&ouml;ren zu den besten Kryptographen Europas. Die besten
Kryptoanalytiker der nicht geheimen Welt haben IDEA einer
ausgedehnten Analyse und eingehenden &Uuml;berpr&uuml;fung
unterzogen. Einer differentiellen Kryptoanalyse, bei der DES fast
geknackt worden w&auml;re, scheint IDEA besser standzuhalten.
<p>
Aber selbst wenn IDEA die eine oder andere subtile Schwachstelle
haben sollte, komprimiert PGP den Klartext vor der
Verschl&uuml;sselung, was die von einer solchen Schwachstelle
ausgehende Gef&auml;hrdung um einiges reduzieren d&uuml;rfte. Der
f&uuml;r das Knacken erforderliche Rechenaufwand d&uuml;rfte in den
meisten F&auml;llen um einiges h&ouml;her sein als der Wert der
entschl&uuml;sselten Nachricht.
<p>
Wenn man in einer Situation ist, in der die Furcht vor so einem
Angriff gr&ouml;&szlig;ten Kalibers berechtigt ist, w&auml;re es an
der Zeit, die Dienste einer Sicherheitsberaterin in Anspruch zu
nehmen, die auf die jeweilige Situation zugeschnittene L&ouml;sungen
anbieten kann. Boulder Software Engineering bietet diese Leistungen
an. Adresse und Telefonnummer stehen im Anhang.
<p>
Kurz gesagt, ein Gegner kann m&uuml;helos, sogar
routinem&auml;&szlig;ig Datenkommunikation abh&ouml;ren,
insbesondere, wenn ein Modem oder E-Mail benutzt wird, es sei denn,
die Daten sind gut kryptographisch gesch&uuml;tzt. Wenn man PGP
verwendet und die erforderlichen Vorsichtsma&szlig;nahmen beachtet,
mu&szlig; ein Angreifer erheblich mehr Arbeit und Kosten aufbringen,
um in die Privatsph&auml;re einzubrechen.
<p>
Wenn man sich vor einfachen Angriffen sch&uuml;tzt und annehmen kann,
da&szlig; man nicht einem entschlossenen und sehr gut ausgestatteten
Angreifer gegen&uuml;bersteht, dann d&uuml;rfte die Verwendung von
PGP sicher sein. PGP sorgt f&uuml;r eine prima gesch&uuml;tzte
Privatsph&auml;re.




<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
