<HTML>
<head>
<title>PGP = Ein Blick aufs Detail</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#zufall>Zufallszahlen</a><br>
<a href=#idea>Der konventionelle Verschl&uuml;sselungsalgorithmus bei
PGP</a><br>
<a href=#kompr>Datenkomprimierung</a><br>
<a href=#unterschr>Textpr&uuml;fsummen und digitale Unterschriften</a><br>

<hr>

<a name=zufall>
<h1>Zufallszahlen</h1>
</a>

PGP verwendet einen kryptographisch zuverl&auml;ssigen
Pseudozufallszahlengenerator, um wechselnde Schl&uuml;ssel f&uuml;r
die konventionelle Verschl&uuml;sselung einzelner Dateien zu
erzeugen. Die Datei, die den Startwert f&uuml;r den
Zufallszahlengenerator enth&auml;lt, hei&szlig;t
<kbd>randseed.bin</kbd>. Sie sollte ebenso wie die anderen von PGP
ben&ouml;tigten Dateien in dem Verzeichnis stehen, das durch die
Umgebungsvariable <kbd>PGPPATH</kbd> angegeben wird. Falls die Datei
nicht vorhanden ist, wird sie automatisch erzeugt. Sie erh&auml;lt
einen Startwert aus echten Zufallszahlen, die aus dem zeitlichen
Abstand von Tastatureingaben abgeleitet werden.
<p>
In die Datei <kbd>randseed.bin</kbd> werden bei jedem Aufruf des
Zufallszahlengenerators neue Daten geschrieben, unter Einbeziehung
der aktuellen Uhrzeit und anderer echter Zufallsdaten. Im
Zufallszahlengenerator wird der konventionelle
Verschl&uuml;sselungsalgorithmus IDEA verwendet.
<p>
Die Datei <kbd>randseed.bin</kbd> sollte wenigstens ein kleines
bi&szlig;chen vor Mitlesen gesch&uuml;tzt sein, um das Risiko klein
zu halten, da&szlig; ein Angreifer die n&auml;chsten Schl&uuml;ssel,
die PGP generieren wird, oder die letzten Schl&uuml;ssel, die PGP
generiert hat, berechnet. Dieser Angreifer h&auml;tte Schwerstarbeit
zu erledigen, weil PGP die Datei <kbd>randseed.bin</kbd> vor und nach
jeder Benutzung kryptographisch &quot;in die Mangel nimmt&quot;.
Trotzdem ist es keine unangebrachte Vorsicht, darauf zu achten,
da&szlig; die Datei nicht in die falschen H&auml;nde ger&auml;t.
<p>
Leser, denen diese algorithmisch abgeleiteten Zufallszahlen
unheimlich sind, sollten nicht vergessen, da&szlig; sie der
Sicherheit desselben konventionellen Verschl&uuml;sselungsalgorithmus
vertrauen, um eine Nachricht zu verschl&uuml;sseln. Wenn der
Algorithmus f&uuml;r die Verschl&uuml;sselung sicher genug ist,
sollte er hinreichend zuverl&auml;ssig sein, um Zufallszahlen zu
erzeugen, die den konventionellen Schl&uuml;ssel bilden. Zu beachten
ist noch, da&szlig; PGP zur Erzeugung eines Paares von
&ouml;ffentlichem und geheimem Schl&uuml;ssel, die &uuml;ber
l&auml;ngere Zeit sicher sein sollen, echte Zufallszahlen verwendet,
die im Wesentlichen aus den Zeitabst&auml;nden von Tastatureingaben
abgeleitet werden.
<p>
<blockquote><i>
<p>
Die Erzeugung von Pseudozufallszahlen, also von
Zahlen, die zwar &quot;zuf&auml;llig aussehen&quot;, die aber aus
einem Algorithmus abgeleitet werden, ist eine schwierige Aufgabe.
Wegen der &quot;guten Zufallsqualit&auml;t&quot; wird auch bei
Anwendungen, die nichts mit Verschl&uuml;sselung zu tun haben, wie
Statistik oder numerische Mathematik, gerne ein
Verschl&uuml;sselungsalgorithmus verwendet, um Zufallszahlen zu
erzeugen. Die Probleme bei Verschl&uuml;sselung und bei der Erzeugung
von Zufallszahlen sind &auml;hnlich: In beiden F&auml;llen geht es
darum, Bitfolgen zu erzeugen, die m&ouml;glichst wenig Systematik
zeigen. Bei der Verschl&uuml;sselung sind diese Bitfolgen der
verschl&uuml;sselte Text, bei der Erzeugung von Zufallszahlen sind
die Bitfolgen eben die Zufallszahlen. Leser, denen die Verwendung der
Datei <kbd>randseed.bin</kbd> trotz dieser Argumente unheimlich
bleibt, k&ouml;nnen sie immer noch vor jedem Start von PGP einfach
l&ouml;schen. Allerdings m&uuml;ssen sie dann f&uuml;r die
Verschl&uuml;sselung eines Klartextes jedesmal ungef&auml;hr 90
Tastendr&uuml;cke f&uuml;r die Erzeugung einer echten Zufallszahl
ausf&uuml;hren.
</i></blockquote>

<a name=idea>
<h1>Der konventionelle Verschl&uuml;sselungsalgorithmus bei PGP</h1>
</a>

Wie weiter oben bereits erw&auml;hnt, verwendet PGP f&uuml;r die
Verschl&uuml;sselung des Klartextes einen schnellen konventionellen
Verschl&uuml;sselungsalgorithmus. Der mit &ouml;ffentlichen
Schl&uuml;sseln arbeitende Algorithmus wird nur dazu verwendet, den
aktuell f&uuml;r eine Nachricht verwendeten konventionellen
Schl&uuml;ssel zu chiffrieren, so da&szlig; er zusammen mit der
verschl&uuml;sselten Nachricht verschickt werden kann. Im folgenden
werden wir &uuml;ber diesen Algorithmus sprechen.
<p>
Der &quot;Federal Data Encryption Standard&quot; (DES) ist ein guter
Algorithmus f&uuml;r die meisten kommerziellen Anwendungen.
Allerdings vertraut die US-Regierung nicht auf DES, um ihre eigenen
geheimen Daten zu sch&uuml;tzen. Vielleicht liegt der Grund darin,
da&szlig; der Schl&uuml;ssel bei DES nur 56 Bit lang ist, kurz genug
f&uuml;r einen Angriff &quot;mit brutaler Gewalt&quot;, bei dem eine
spezielle Maschine verwendet wird, die aus einer Vielzahl von
DES-Verschl&uuml;sselungschips besteht, die einfach alle 256
m&ouml;glichen Schl&uuml;ssel &quot;ausprobiert&quot;. Auch hatten
Biham und Shamir k&uuml;rzlich einigen Erfolg beim Angriff auf eine
volle 16-Runden-DES-Verschl&uuml;sselung.(*) Auf der &quot;Crypto '93
conference&quot; legte Michael Wiener eine Studie vor, wie DES mit
einer speziell entwickelten Maschine zu knacken sei. Er hat einen
speziellen Chip entwickelt, der pro Sekunde 50 Millionen
Schl&uuml;ssel durchprobiert, bis er den richtigen findet. Diese
Chips k&ouml;nnten f&uuml;r knapp elf Dollar das St&uuml;ck gebaut
werden, eine Maschine zum Preis von einer Million Dollar k&ouml;nnte
s&auml;mtliche m&ouml;glichen DES-Schl&uuml;ssel innerhalb von sieben
Stunden durchprobieren. Das erg&auml;be eine durchschnittliche
Suchdauer von 3,5 Stunden.

<hr><i>
 (*)&quot;16 Runden&quot; bedeutet, da&szlig; der DES-Algorithmus
sechzehnmal hintereinander f&uuml;r die Verschl&uuml;sselung
desselben Datenblocks verwendet wird, also gewisserma&szlig;en eine
16-fache Verschl&uuml;sselung. Diese 16 Runden sind Standard bei DES;
die im folgenden beschriebene IDEA-Verschl&uuml;sselung benutzt 8
Runden. d.&Uuml;.
</i><hr>

PGP verwendet nicht DES f&uuml;r die konventionelle
Verschl&uuml;sselung. Stattdessen wird ein anderer, ebenfalls
blockorientierter Ein-Schl&uuml;ssel-Algorithmus namens IDEA(TM)
verwendet. Eine k&uuml;nftige Version von PGP k&ouml;nnte DES
optional unterst&uuml;tzen, falls genug Benutzer danach fragen. Aber
ich nehme an, da&szlig; IDEA besser als DES ist.
<p>
F&uuml;r die kryptographisch Interessierten: IDEA verwendet 64 Bit
lange Bl&ouml;cke f&uuml;r Klartext und verschl&uuml;sselten Text mit
128 Bit langen Schl&uuml;sseln. Der Algorithmus basiert auf dem
Konzept der Mischung von Operationen verschiedener algebraischer
Gruppen. Eine Software-Implementierung von IDEA ist wesentlich
schneller als eine DES-Software-Implementierung. &Auml;hnlich wie DES
kann IDEA f&uuml;r Cipher Feedback (CFB, R&uuml;ckf&uuml;hrung der
verschl&uuml;sselten Textes) und f&uuml;r Cipher Block Chaining (CBC,
Verkettung von Bl&ouml;cken verschl&uuml;sselten Textes) verwendet
werden. PGP verwendet IDEA mit 64-Bit CFB. Hierzu siehe auch den
Abschnitt <a href=pgp.2.6.html#[Idea]>IDEA</a> sowie die Informationen der
Firma Ascom Systec AG, die die Rechte an IDEA innehat <a
href=http://www.ascom.ch/systec/security/page1.htm>hier</a>.
<p>
Die IPES/IDEA-Verschl&uuml;sselung wurde an der ETH Z&uuml;rich von
James L. Massey und Xuejia Lai entwickelt und 1990
ver&ouml;ffentlicht. IDEA ist keine Entwicklung aus dem Bastelkeller.
Seine Entwickler haben unter Kryptologen einen hervorragenden Ruf. In
ihren ersten Ver&ouml;ffentlichungen nannten sie den Algorithmus IPES
(Improved Proposed Encryption Standard, Vorschlag f&uuml;r einen
verbesserten Verschl&uuml;sselungsstandard), sp&auml;ter
&auml;nderten sie den Namen in IDEA (International Data Encryption
Algorithm, Internationaler Standard f&uuml;r
Datenverschl&uuml;sselung). Bis heute hat IDEA kryptoanalytischen
Angriffen wesentlich besser standgehalten als andere Verfahren wie
FEAL, REDOC-II, LOKI, Snefru und Khafre. Es gibt erste Anhaltspunkte
daf&uuml;r, da&szlig; IDEA dem sehr erfolgreichen differentiellen
kryptoanalytischen Angriff von Biham und Shamir wesentlich besser
standh&auml;lt als DES.(*) Biham und Shamir untersuchten IDEA
erfolglos auf Schwachstellen. Akademische Arbeitsgruppen von
Kryptoanalytikern aus Belgien, England und Deutschland suchen
Angriffsm&ouml;glichkeiten bei IDEA, ebenso milit&auml;rische
Geheimdienste mehrerer europ&auml;ischer L&auml;nder. Je mehr und je
l&auml;nger dieser neue Algorithmus Angriffsversuche aus den
gef&uuml;rchtetsten Arbeitsgruppen der kryptoanalytischen Welt auf
sich zieht, desto mehr steigt das Vertrauen in ihn.

<hr><i>
 (*)Da IDEA nach der Ver&ouml;ffentlichung der differentiellen
Kryptoanalyse ge&auml;ndert wurde, um gegen sie resistent zu sein,
ist das nicht so besonders &uuml;berraschend. d.&Uuml;.
</i><hr>

Ein ber&uuml;hmter Eishockeyspieler sagte einmal: &quot;Ich versuche,
an die Stelle zu laufen, von der ich meine, da&szlig; der Puck dort
sein m&uuml;&szlig;te.&quot; Viele Leute beginnen zu glauben,
da&szlig; die Tage von DES gez&auml;hlt sind. Ich bin dabei, in
Richtung IDEA zu laufen.
<p>
Die ausschlie&szlig;liche Verwendung von RSA mit langen
Schl&uuml;sseln ist wegen der langen Rechenzeit f&uuml;r die Ver- und
Entschl&uuml;sselung gro&szlig;er Datenmengen nicht wirklich
brauchbar. Das macht absolut niemand im wirklichen Leben. Trotzdem
liegt die Frage nahe, ob die Kombination einer Verschl&uuml;sselung
mit &ouml;ffentlichen Schl&uuml;sseln und einer zweiten,
konventionell arbeitenden Verschl&uuml;sselung die Gesamtsicherheit
herabsetzt, und das nur, um das Programm schneller zu machen.
Schlie&szlig;lich ist eine Kette nur so stark wie ihr
schw&auml;chstes Glied. Viele Leute, die wenig Erfahrung mit
Kryptographie haben, sind der Meinung, da&szlig; RSA vom Prinzip her
sicherer sei als eine konventionelle Verschl&uuml;sselung. Das stimmt
nicht. RSA kann durch leicht zu knackende, &quot;weiche&quot;
Schl&uuml;ssel leicht angreifbar werden, andererseits k&ouml;nnen
konventionelle Verschl&uuml;sselungen bei Wahl eines guten
Algorithmus sehr sicher sein. In den meisten F&auml;llen ist es
schwierig, genau zu sagen, wie gut eine konventionelle
Verschl&uuml;sselung ist, ohne sie wirklich zu knacken. Ein guter
konventioneller Algorithmus k&ouml;nnte durchaus schwerer zu knacken
sein als ein RSA-Schl&uuml;ssel nach milit&auml;rischem Standard. Der
Reiz einer Verschl&uuml;sselung mit &ouml;ffentlichen Schl&uuml;sseln
besteht nicht darin, da&szlig; sie aus sich heraus sicherer als eine
konventionelle Verschl&uuml;sselung ist - ihr Reiz besteht in der
wesentlich bequemeren und vielseitigeren Handhabung der
Schl&uuml;ssel.
<p>
Leute, die beruflich mit der Erforschung von
Faktorisierungsalgorithmen zu tun haben, sagen, da&szlig; ein
Durchprobieren der 2128 m&ouml;glichen Schl&uuml;ssel f&uuml;r IDEA
vom Rechenaufwand her der Faktorisierung eines RSA-Schl&uuml;ssels
mit 3100 Bit entspreche. Das ist deutlich mehr als die 1024 Bit, die
die in PGP 2.6 verwendeten RSAREF-Routinen zulassen. Wenn wir
annehmen, da&szlig; IDEA keine besonderen Schwachstellen
enth&auml;lt, ist der Schwachpunkt, an dem ein kryptoanalytischer
Angriff ansetzen w&uuml;rde, RSA und nicht IDEA.
<p>
Au&szlig;erdem kann es bei der Verwendung eines reinen
RSA-Algorithmus zus&auml;tzliche Konstellationen geben, die
Ansatzpunkte f&uuml;r einen Angriff ergeben.

<a name=kompr>
<h1>Datenkomprimierung</h1>
</a>

Normalerweise komprimiert PGP den Klartext, bevor er
verschl&uuml;sselt wird. Verschl&uuml;sselte Daten lassen sich nicht
mehr komprimieren.(*) Die Kompression spart &Uuml;bertragungszeit und
Festplattenkapazit&auml;t, und, viel wichtiger, sie erh&ouml;ht die
Sicherheit der Verschl&uuml;sselung. Die meisten kryptoanalytischen
Techniken gehen von der Redundanz des Klartextes aus, um die
Verschl&uuml;sselung zu knacken. Die Datenkompression reduziert die
Redundanz des Klartextes, und erh&ouml;ht dadurch wesentlich die
Sicherheit vor kryptoanalytischen Angriffen. Die Datenkompression
kostet zwar etwas Rechenzeit, aber vom Standpunkt der Sicherheit aus
ist das gerechtfertigt, wenigstens nach meiner bescheidenen Meinung.

<hr><i>
 (*)Das liegt daran, da&szlig; gut verschl&uuml;sselte Daten sehr
&quot;zuf&auml;llig aussehen&quot;, Kompressionsalgorithmen aber
darauf basieren, eine bestimmte Systematik in den Daten zu erkennen
und auf Grundlage dieser Systematik eine k&uuml;rzere Darstellung der
Daten zu suchen. d.&Uuml;.
</i><hr>

Dateien, die f&uuml;r eine Kompression zu klein sind, oder die sich
nicht gut komprimieren lassen, werden von PGP nicht komprimiert.
<p>
Bei Bedarf l&auml;&szlig;t sich auch PKZIP oder ein anderes
Datenkomprimierungsprogramm verwenden, um den Klartext vor der
Verschl&uuml;sselung zu komprimieren. PKZIP ist ein weit verbreitetes
und effizient arbeitendes Kompressionsprogramm von PKWare Inc.
f&uuml;r MS-DOS, das als Shareware vertrieben wird. Oder man kann ZIP
benutzen, ein PKZIP-kompatibles Freeware-Programm f&uuml;r Unix und
andere Betriebssysteme, zu erhalten bei Jean-Loup Gailly. Die
Verwendung von PKZIP oder ZIP hat unter bestimmten Umst&auml;nden
Vorteile, weil diese Programme im Gegensatz zu PGP in der Lage sind,
mehrere Dateien in einer einzigen komprimierten Datei
zusammenzufassen. Bei der Dekompression werden nat&uuml;rlich wieder
die einzelnen Originaldateien erzeugt.
<p>
PGP versucht nicht, eine bereits komprimiert vorliegende
Klartext-Datei erneut zu komprimieren. Die Empf&auml;ngerin einer so
komprimierten Datei mu&szlig; sie nach der Entschl&uuml;sselung mit
PKUNZIP dekomprimieren. Wenn der entschl&uuml;sselte Klartext eine
PKZIP-komprimierte Datei ist, erkennt PGP dies automatisch, und weist
den Empf&auml;nger darauf hin, da&szlig; es sich wahrscheinlich um
eine PKZIP-Datei handelt.(*)

<hr><i>
 (*)Auch andere Packer wie z.B. arc, zoo und lharc werden automatisch
erkannt. GIF8-Bilder werden ebenfalls nicht weiter gepackt etc.
d.&Uuml;.
</i><hr>

F&uuml;r die technisch interessierten Leserinnen sei noch
erw&auml;hnt, da&szlig; die aktuelle Version von PGP die
Freeware-Kompressions-Routinen enth&auml;lt, die Jean-Loup Gailly,
Mark Adler und Richard B. Wales geschrieben haben. Diese ZIP-Routinen
verwenden Algorithmen, die funktions&auml;quivalent zu denjenigen von
PKZIP 2.0 von PKWare sind. Sie wurden im Wesentlichen deshalb in PGP
eingebaut, weil sie als gut portierbarer C-Quellcode zu
Verf&uuml;gung stehen, weil sie wirklich gut komprimieren und weil
sie schnell sind.
<p>
Peter Gutmann hat ein sch&ouml;nes Kompressions- und
Archivierungsprogramm namens HPACK geschrieben, das von vielen
ftp-Servern im Internet zu beziehen ist. HPACK verschl&uuml;sselt
komprimierte Dateien unter Verwendung des PGP-Dateiformats und der
PGP-Schl&uuml;sseldateien. Er bat mich, an dieser Stelle auf HPACK
aufmerksam zu machen.

<a name=unterschr>
<h1>Textpr&uuml;fsummen und digitale Unterschriften</h1>
</a>

Um eine digitale Unterschrift zu erzeugen, verwendet PGP den geheimen
Schl&uuml;ssel, jedoch nicht f&uuml;r die &quot;Codierung&quot; des
gesamten Textes, das w&uuml;rde zuviel Rechenzeit kosten. Statt
dessen codiert PGP eine &quot;Textpr&uuml;fsumme&quot; mit dem
geheimen Schl&uuml;ssel.
<p>
Diese Textpr&uuml;fsumme ist ein kleines, 128 Bit langes
&quot;Destillat&quot; einer Nachricht, von der Idee her &auml;hnlich
einer Quersumme oder einer CRC-Summe. Man kann sich die
Textpr&uuml;fsumme auch als eine Art Fingerabdruck der Nachricht
vorstellen. Die Textpr&uuml;fsumme &quot;repr&auml;sentiert&quot; die
Nachricht in dem Sinne, da&szlig; sich bei jeder &Auml;nderung an der
Nachricht eine andere Textpr&uuml;fsumme f&uuml;r die Nachricht
ergibt. An der Textpr&uuml;fsumme l&auml;&szlig;t sich also erkennen,
ob sich ein F&auml;lscher an der Nachricht zu schaffen gemacht hat.
Die Textpr&uuml;fsumme wird durch eine kryptographisch
zuverl&auml;ssige Einweg-Hash-Funktion berechnet.(*) Ein
F&auml;lscher kann wegen des immensen erforderlichen Rechenaufwands
keine zweite Nachricht produzieren, die dieselbe Textpr&uuml;fsumme
wie die Originalnachricht hat. In dieser Hinsicht ist das bei PGP
verwendete Verfahren zur Berechnung der Textpr&uuml;fsumme wesentlich
besser als die &uuml;blichen Quersummen oder CRC-Summen, bei denen es
einfach ist, zu einer gegebenen Nachricht eine zweite Nachricht zu
finden, die die identische Quer- oder CRC-Summe hat. Andererseits
kann aus der Textpr&uuml;fsumme ebensowenig wie aus einer Quer- oder
CRC-Summe die Originalnachricht berechnet werden.

<hr><i>
 (*)Eine Einwegfunktion ist eine Funktion, bei der es keine
M&ouml;glichkeit gibt oder keine M&ouml;glichkeit bekannt ist, aus
dem Funktionswert auf das Funktionsargument
r&uuml;ckzuschlie&szlig;en. Eine Hashfunktion ist eine Funktion, die
eine gro&szlig;e Menge von Funktionsargumenten m&ouml;glichst
gleichm&auml;&szlig;ig auf eine vergleichsweise kleine Menge von
Funktionswerten abbildet. d.&Uuml;.
</i><hr>

Die Textpr&uuml;fsumme alleine reicht nicht aus, um die Echtheit
einer Nachricht zu kontrollieren. Der Algorithmus f&uuml;r ihre
Berechnung ist allgemein bekannt, und er verwendet keinen geheimen
Schl&uuml;ssel. Wenn man die Textpr&uuml;fsumme einfach so zur
Nachricht hinzuf&uuml;gte, k&ouml;nnte ein F&auml;lscher die
Nachricht &auml;ndern und die Pr&uuml;fsumme f&uuml;r die
ge&auml;nderte Nachricht neu berechnen. F&uuml;r eine
zuverl&auml;ssige Kontrolle der Echtheit einer Nachricht mu&szlig;
die Absenderin die Pr&uuml;fsumme mit ihrem geheimen Schl&uuml;ssel
codieren. Erst hierdurch entsteht eine authentische Unterschrift.
<p>
Die Textpr&uuml;fsumme wird von dem PGP-Programm der Absenderin einer
Nachricht berechnet. Die digitale Unterschrift entsteht dadurch,
da&szlig; die Absenderin die Textpr&uuml;fsumme und die Zeitmarke mit
ihrem geheimen Schl&uuml;ssel codiert. Die Absenderin verschickt
Nachricht und digitale Unterschrift an den Empf&auml;nger. Dessen
PGP-Programm ermittelt die Textpr&uuml;fsumme, indem es die digitale
Unterschrift mit dem &ouml;ffentlichen Schl&uuml;ssel der Absenderin
decodiert. Zur Kontrolle wird die Textpr&uuml;fsumme aus der
erhaltenen Nachricht berechnet. Wenn die aus der Nachricht berechnete
Textpr&uuml;fsumme und die in der Unterschrift enthaltene
Pr&uuml;fsumme &uuml;bereinstimmen, ist gew&auml;hrleistet, da&szlig;
die Nachricht nicht ge&auml;ndert wurde und da&szlig; sie von
derjenigen Person stammt, deren &ouml;ffentlicher Schl&uuml;ssel
f&uuml;r die Kontrolle der Unterschrift verwendet wurde.
<p>
Ein F&auml;lscher m&uuml;&szlig;te die Nachricht entweder so
&auml;ndern, da&szlig; die Textpr&uuml;fsumme gleich bleibt, was
praktisch unm&ouml;glich ist, oder er m&uuml;&szlig;te mit der
ge&auml;nderten Textpr&uuml;fsumme eine neue digitale Unterschrift
erzeugen, was ohne den geheimen Schl&uuml;ssel der Absenderin auch
nicht m&ouml;glich ist.
<p>
Eine digitale Unterschrift beweist, wer eine Nachricht abgeschickt
hat, und ob die Nachricht ge&auml;ndert wurde, sei es aufgrund eines
technischen Fehlers oder absichtlich . Ebenso verhindert sie,
da&szlig; ein Absender die Unterschrift unter einer Nachricht
ableugnen kann.
<p>
Die Verwendung der Textpr&uuml;fsumme f&uuml;r die digitale
Unterschrift hat neben der Geschwindigkeit noch weitere Vorteile im
Vergleich zur Codierung der gesamten Nachricht mit dem geheimen
Schl&uuml;ssel. Die Unterschriften haben alle die gleiche geringe
L&auml;nge, unabh&auml;ngig von der Gr&ouml;&szlig;e der jeweiligen
Nachricht. Sie erm&ouml;glichen der Software eine automatische
Kontrolle der Korrektheit einer Nachricht, &auml;hnlich wie Quer-
oder CRC-Summen. Die Unterschrift kann getrennt von der Nachricht
gespeichert werden, bei Bedarf sogar in einem &ouml;ffentlich
zug&auml;nglichen Archiv, ohne da&szlig; vertrauliche Informationen
aus der Nachricht offengelegt werden, weil es unm&ouml;glich ist, aus
der Kenntnis der Textpr&uuml;fsumme irgend etwas &uuml;ber den Inhalt
der Nachricht zu ermitteln.
<p>
Der bei PGP verwendete Algorithmus f&uuml;r die Berechnung der
Textpr&uuml;fsumme ist MD5 (Message Digest 5), von der RSA Data
Security Inc. f&uuml;r Public Domain Verwendung freigegeben. Ronald
Rivest, der Entwickler von MD5, schreibt dar&uuml;ber im RFC 1321 im
April 1992:
<p>
&quot;Es ist zu vermuten, da&szlig; der Rechenaufwand, zwei
Nachrichten mit derselben Textpr&uuml;fsumme zu erhalten, in der
Gr&ouml;&szlig;enordnung von 264 Rechenoperationen liegt, und
da&szlig; der Rechenaufwand, eine Nachricht mit einer vorgegebenen
Pr&uuml;fsumme zu erzeugen, in der Gr&ouml;&szlig;enordnung von 2128
Operationen liegt. Der MD5-Algorithmus ist sorgf&auml;ltig auf
Schwachstellen hin untersucht worden. Andererseits ist er
verh&auml;ltnism&auml;&szlig;ig neu, so da&szlig; eine weitere
Analyse seiner Sicherheit nat&uuml;rlich gerechtfertigt ist - wie bei
jedem neuen Vorhaben dieser Art. Der Grad von Sicherheit, den MD5
bietet, d&uuml;rfte ausreichen, um zusammen mit RSA hochgradig
sichere Systeme f&uuml;r digitale Unterschriften zu
implementieren.&quot;


<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
