<HTML>
<head>
<title>PGP = Anhang</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#kompatibel>Kompatibilit&auml;t mit alten Versionen von PGP</a><br>
<a href=#[Versionskapitel]>Die vielen PGP-Versionen</a><br>
<a href=#[Idea]>IDEA</a><br>
<a href=#rsa>RSA</a><br>
<a href=#rsa-angriff>Angriffsm&ouml;glichkeiten (RSA)</a><br>
<a href=#verein>Computerorientierte politische Vereinigungen in den
USA</a><br>
<a href=#verein_nl_de>Computerorientierte politische Vereinigungen in
Deutschland und den Niederlanden</a><br>
<a href=#Literatur>Literaturverzeichnis</a><br>
<a href=#Pressemeldungen>Pressemeldungen</a><br>
<a href=#dank>Dank</a><br>
<a href=#ueberprz>&Uuml;ber den Autoren</a><br>
<a href=#adrprz>Die Adresse des Autoren</a><br>
<a href=#quellen>Bezugsquellen f&uuml;r PGP</a>

<hr>

<a name=kompatibel>
<h1>Kompatibilit&auml;t mit alten Versionen von PGP</h1>
</a>

Es tut mir leid, aber Version 2.x von PGP ist nicht kompatibel zu
Version 1.0. F&uuml;r Version 1.0 generierte Schl&uuml;ssel
m&uuml;ssen durch neue ersetzt werden. Ab Version 2.0 verwendet PGP
andere Algorithmen f&uuml;r die konventionelle Verschl&uuml;sselung,
f&uuml;r die Datenkompression und f&uuml;r die Berechnung der
Textpr&uuml;fsummen. Au&szlig;erdem gibt es ab Version 2.0 ein
wesentlich besseres Konzept f&uuml;r die Verwaltung der
Schl&uuml;ssel. Die &Auml;nderungen sind zu umfangreich, um eine
Kompatibilit&auml;t mit Version 1.0 aufrechtzuerhalten.
<p>
Version 2.0 ist weitgehend kompatibel mit neueren Versionen. Weil
neue Versionen von PGP auch neue M&ouml;glichkeiten bieten,
k&ouml;nnen die &auml;lteren Versionen manche Dateien, die mit
neueren Versionen erzeugt wurden, nicht in jedem Fall bearbeiten. Wir
haben uns M&uuml;he gegeben, die internen Datenstrukturen dieser
Version von PGP so zu entwerfen, da&szlig; sie an k&uuml;nftige
&Auml;nderungen angepa&szlig;t werden k&ouml;nnen, so da&szlig;
hoffentlich niemand noch einmal bei einer kommenden Version von PGP
die alten Schl&uuml;ssel wegwerfen und neue generieren mu&szlig;.
<p>
Versionen ab 2.6 erzeugen teilweise Daten, die von fr&uuml;heren PGP-Versionen
nicht gelesen werden k&ouml;nnen. Grund hierf&uuml;r ist zum Einen die M&ouml;glichkeit,
Schl&uuml;ssel mit mehr als 1024 bit L&auml;nge zu verwenden, zum anderen die
Tatsache, da&szlig; ich mich mit dem MIT geeinigt habe, die neueren Versionen so
zu gestalten, damit mehr Anwendrinnen auf die patentrechtlich unbedenklichen
Versionen umsteigen. Weitere Informationen hierzu finden Sie im n&auml;chsten
Abschnitt: &quot;Die vielen PGP-Versionen&quot;.

<h1><a name=[Versionskapitel]>Die vielen PGP-Versionen</a></h1>

Was soll eigentlich das ganze Chaos mit den Versionen 2.3a, 2.3a.5,
2.6, 2.6MIT, 2.6.1, 2.6ui, 2.7 usw.?
<p>
Bis zur Version 2.3 (2.3a ist ein kleiner Bugfix, d.h. es ist ein
Programmierfehler entfernt worden, der Klartext-Unterschriften
betraf) war PGP &quot;Guerilla-Freeware&quot;, die au&szlig;erhalb
der USA unter Philip Zimmermanns Federf&uuml;hrung entstand. Das
hatte zur Folge, da&szlig; die Verwendung von PGP innerhalb der USA
eine Verletzung von Patentrechten darstellte. Das n&auml;chste PGP,
das entwickelt wurde (2.4), umging diese Probleme dadurch, da&szlig;
es sich um eine kommerzielle Version handelte, die von ViaCrypt,
Phoenix, Arizona vertrieben wurde. Mit dem Kauf dieser Version
erhielt man das Recht, PGP kommerziell einzusetzen, die n&ouml;tigen
Abgaben an PKP und Ascom Tech waren im Preis eingeschlossen.
<p>
Um eine in den USA legale Version von PGP zu erstellen, schlo&szlig;
Philip Zimmermann ein Abkommen mit PKP und dem MIT, ein PGP zu
entwickeln, das die frei verwendbaren RSAREF-Routinen benutzt. Teil
dieser Abmachung war eine &Auml;nderung der
Urheberrechtsbestimmungen. PGP wird ab der Version 2.5 (die erste
MIT-Version) nicht mehr unter den Bestimmungen der General Public
License der Free Software Foundation (Stichwort GNU-Projekt)
vertrieben, sondern diese Bestimmungen haben Einschr&auml;nkungen
erfahren, die sich zum Teil in den RSAREF-Bedingungen begr&uuml;nden,
zum Teil in der Abmachung von Philip Zimmermann mit PKP.

<p>Kurze Zeit nach der Freigabe der Version 2.5 entstand die Version 2.6.
Diese Version hatte - wiederum aufgrund eines Abkommens - eine
&quot;Zeitbombe&quot; eingebaut, die zur Folge hatte, da&szlig; sie ab dem
1. September 1994 Nachrichten, Schl&uuml;ssel und Unterschriften erzeugt,
die mit fr&uuml;heren Versionen nicht gelesen werden k&ouml;nnen. Das dient
dazu, die Verwendung der (in den USA immer noch illegalen) Version 2.3(a)
einzud&auml;mmen. Um internationale PGP-Kommunikation zu erm&ouml;glichen,
ohne US-Exportverbote zu verletzen, haben einige Leute sehr bald die
n&ouml;tigen &Auml;nderungen am Quelltext ver&ouml;ffentlicht. Diese hat
Peter Simons in seine Amiga-Version 2.3a.2 eingebaut, wobei die Version
2.3a.3 enstand (die aktuellen Versionen von PGP lassen sich direkt f&uuml;r den
Amiga kompilieren) und ein Engl&auml;nder mit dem Pseudonym Mathew hat sie
in eine MS-DOS-Version 2.3a eingebaut und das Produkt 2.6ui genannt, wobei
&quot;ui&quot; f&uuml;r &quot;unofficial international&quot; steht.
Unofficial deshalb, weil die Version von keinem Programmierer des PGP-Teams
abgesegnet ist, international deshalb, weil die Version au&szlig;erhalb der
USA entstanden ist und ohne Probleme in allen L&auml;ndern, die
Verschl&uuml;sselung gestatten, verwendet werden kann - au&szlig;er in den
USA.

<p>Um ihren kommerziellen Kunden eine Kommunikation mit 2.6-Anwendern zu
erm&ouml;glichen, brachte ViaCrypt die Version 2.7 auf den Markt.

<p>Die neueste Version ist die 2.6.2, ein Bugfix zur 2.6 vom MIT. Diese
Version sollte nur innerhalb der USA verwendet werden, da eine
Verbreitung der USA-Version nach Europa das Abkommen zwischen Philip
Zimmermann und PKP gef&auml;hrdet. Au&szlig;erhalb der USA ist die aktuelle
Version die 2.6.3i. Diese verh&auml;lt sich leider in einigen Punkten nicht ganz
kompatibel zu den offiziellen, d.h. vom MIT und Philip Zimmermann
ver&ouml;ffentlichten, Versionen. Wen das st&ouml;rt, dem sei die 2.6.2i empfohlen.


<h1>Kurz vorgestellt: Die Verschl&uuml;sselungsalgorithmen</h1>

<h2><a name=[Idea]>IDEA</a></h2>

Dieser symmetrische, auch single-key oder konventionell genannte
Verschl&uuml;sselungsalgorithmus basiert auf der Kombination
einfacher Rechenoperationen. Verwendet werden:

<ol>
<li>Bitweise Addition zweier Zahlen ohne &Uuml;bertrag (XOR)
<li>Addition zweier Zahlen ohne Ber&uuml;cksichtigung des
&Uuml;bertrags &uuml;ber 216 hinaus
<li>Multiplikation zweier Zahlen und Bildung des Restes nach
Division durch 216+1. Hierbei werden 0 und 216 besonders behandelt:
Vor Beginn der Multiplikation wird eine 0 durch 216 ersetzt, das
Ergebnis 216 wiederum wird als 0 interpretiert. Daraus folgt: 0
&quot;mal&quot; 0 = 1.
</ol>

Aus dem 128-Bit-Schl&uuml;ssel werden Teilschl&uuml;ssel berechnet,
und zwar S1,1 bis S8,6 und S9,1 bis S9,4. Hierf&uuml;r wird der
Schl&uuml;ssel in acht 16 Bit gro&szlig;e Teile geteilt, diese
ergeben S1,1 bis S1,6, S2,1 und S2,2. Anschlie&szlig;end wird der
gesamte 128-Bit-Schl&uuml;ssel um 25 Bit nach links rotiert und
wieder in acht Bl&ouml;cke zu je 16 Bit unterteilt, die dann S2,3 bis
S2,6 und S3,1 bis S3,4 werden. Dann wird wieder rotiert und so weiter.
<p>
Die eigentliche Verschl&uuml;sselung l&auml;uft so ab, da&szlig; ein
Klartextblock von 64 Bit L&auml;nge in vier Bl&ouml;cke zu je 16 Bit
eingeteilt wird, die anschlie&szlig;end dem Verfahren in Abb. 4
unterworfen werden. Dargestellt ist nur der erste Durchlauf, das
Verfahren wird achtmal angewendet.
<p>
Zum Entschl&uuml;sseln kann dasselbe Verfahren verwendet werden.
Damit dabei der urspr&uuml;ngliche Klartext erhalten bleibt,
m&uuml;ssen die Teilschl&uuml;ssel wie in Abb. 5 gew&auml;hlt werden.

<a name=rsa>
<h2>RSA</h2>
</a>

RSA, das wohl ber&uuml;hmteste asymmetrische
Verschl&uuml;sselungsverfahren, ist benannt worden nach Rivest,
Shamir und Adleman, seinen Entwicklern. Als sie es 1977
ver&ouml;ffentlichten, war es das einzige &ouml;ffentlich bekannte
Verfahren, da&szlig; die 1967 von Diffie und Hellman publizierte Idee
&ouml;ffentlicher Schl&uuml;ssel tats&auml;chlich einsetzen konnte.
<p>
Das System basiert auf Rechnungen im K&ouml;rper der ganzen Zahlen
modulo <var>pq</var>, wobei <var>p</var> und <var>q</var> zwei Primzahlen sind.
In diesem System zu rechnen, geht ebenso vor sich wie gewohnt, nur,
da&szlig; vom Ergebnis nur der Rest bei Division durch <var>pq</var>
behalten wird. Wenn wir als Beispiel <var>pq = 15</var> setzen, dann sind
folgende Rechnungen korrekt:<p>
<pre><var>
2 + 5 = 7
2 * 5 = 10
4 * 5 = 5
4 * 4 = 1
1 / 4 = 4
</var></pre><p>
Von besonderem Interesse sind hier die Exponentialfunktionen:<p>

<pre><var>
5 ^ 2 = 10
4 ^ 7 = 4
</var></pre>
<p>
Denn es ist kein effizientes Verfahren bekannt, diese Rechnung
umzukehren, d.h. es ist keine M&ouml;glichkeit bekannt, in
annehmbarer Zeit Probleme wie <var>x ^ 5 = 12</var> zu l&ouml;sen. (Auf
der Schwierigkeit des diskreten Logarithmus, also der L&ouml;sung von
<var>6 ^ x = 8</var> etc., beruhen andere Verfahren.) Weiterhin
interessant ist eine Beziehung, die schon Euler bekannt war:<p>

<var>a ^ {phi (x)} ~= 1 (</var>mod<var> x)</var>
<p>
Wobei <var>~=</var> das Zeichen daf&uuml;r ist, da&szlig; wir
das oben erw&auml;hnte Modulo-Rechnen durchf&uuml;hren, und zwar
mod <var>x</var>. <var>phi (x)</var> ist die Eulersche Phi-Funktion.
F&uuml;r uns wichtig ist nur, da&szlig; 
<var>phi (pq) = (p - 1)(q - 1)</var> gilt, wiederum f&uuml;r die Primzahlen
<var>p</var> und <var>q</var>. Eine kurze Rechnung ergibt:
<pre><var>
a ^ {phi (pq)} ~= 1 (</var>mod <var>pq)
a ^ {(k * phi (pq))} ~= 1 (</var>mod <var>pq)
a ^ {(k * phi (pq) + 1)} ~= a (</var>mod <var>pq)
</var></pre><p>
Wenn wir nun zwei Zahlen <var>d</var> und <var>e</var> einf&uuml;hren, von
denen wir verlangen, da&szlig; <var>de = k * phi (pq) + 1</var> gelten soll
(<var>k</var> sei eine beliebige ganze Zahl ungleich null), dann erhalten
wir (ab sofort alle Rechnungen modulo <var>pq</var>):
<pre><var>
a ^ de = a
a ^ d = b
b ^ e = a
</var></pre><p>
Wobei die Kenntnis von <var>b</var> und <var>d</var> nicht ausreicht, um
<var>a</var> zu berechnen. RSA funktioniert nun so, da&szlig; als
&ouml;ffentlicher Schl&uuml;ssel <var>d</var> und das Produkt <var>pq</var>
ver&ouml;ffentlicht werden und die Nachrichten <var>a</var> damit wie
eben beschrieben verschl&uuml;sselt werden. Die verschl&uuml;sselten
Nachrichten (<var>b</var>) k&ouml;nnen dann bedenkenlos versandt werden,
da sie ohne <var>e</var> nicht entschl&uuml;sselt werden k&ouml;nnen.

<a name=rsa-angriff>
<h3>Angriffsm&ouml;glichkeiten auf RSA:</h3>
</a>

<ul>
<li>Aus <var>a</var> und <var>b</var> <var>e</var> berechnen:
&quot;diskreter Logarithmus&quot;, gilt als derzeit unl&ouml;sbar.
<li>Aus <var>pq</var> und <var>d</var> das geheime <var>e</var> berechnen:
Hierzu mu&szlig; nach derzeitigem Wissensstand <var>pq</var> in seine
Faktoren zerlegt werden, was ebenfalls f&uuml;r nicht in sinnvoller Zeit
l&ouml;sbar gehalten wird.
<li>Eine an verschiedene Empf&auml;nger verschl&uuml;sselte
Nachricht entschl&uuml;sseln: Wenn dasselbe <var>a</var> an mehrere
Empf&auml;nger verschl&uuml;sselt wird, wobei dasselbe <var>d</var>
verwendet wird (das ist nicht unwahrscheinlich), ist es mit einem
kleinen mathematischen Kunstgriff m&ouml;glich, die Nachricht zu
entschl&uuml;sseln. Dies betrifft PGP nicht, da hier beim
Verschl&uuml;sseln an mehrere Empf&auml;nger der IDEA-Schl&uuml;ssel
stets mit Zufallszahlen aufgef&uuml;llt wird, die f&uuml;r jeden
Empf&auml;nger verschieden sind.
</ul>

<a name=verein_nl_de>
<h1>Computerorientierte politische Vereinigungen in Deutschland und
den Niederlanden</h1>
</a>

<ul>
<li><address>
<a href=/org/cl/index.html>
Computernetzwerk Linksysteme (/CL-Netz)</a><br>
Kommunikation und Neue Medien e.V.<br>
Postfach 19 05 20<br>
D-80605 M&uuml;nchen<br>
Tel: +49-89-1675106<br>
Fax: +49-89-131406<br>
eMail: <kbd>&lt;cl-service@link-m.muc.de&gt;</kbd>
</address>
<li><address>
<a href=http://www.artcom.de/CCC/>Chaos Computer Club e.V. (CCC)</a><br>
Schwenckestra&szlig;e 85<br>
D-20257 Hamburg<br>
Tel: +49-40-4903757<br>
Fax: +49-40-4917689<br>
</address>
<li><address>
Forum InformatikerInnen f&uuml;r Frieden und gesellschaftliche
Verantwortung e.V. (FIFF)<br>
Reuterstra&szlig;e 44<br>
D-53113 Bonn<br>
Tel: +49-228-219548 (di+do 12-17.30 Uhr)<br>
Fax: +49-228-214924<br>
eMail: <kbd>&lt;fiff@fiff.gun.de&gt;</kbd>
</address>
<li><address>
<a href="/index.html">FoeBuD e.V.</a><br>
Marktstra&szlig;e 18<br>
D-33602 Bielefeld<br>
Tel: +49-521-175254 (mo-fr 17-19 Uhr)<br>
Fax: +49-521-61172<br>
Box: +49-521-68000<br>
eMail: <a
href=mailto:foebud@bionic.zerberus.de><kbd>&lt;foebud@bionic.zerberus.de&gt;</kbd></a>
</address>
<li><address>
Arbeitsgemeinschaft freier MailBoxen e.V. (AGFMB)<br>
Goethestra&szlig;e 66<br>
D-44147 Dortmund<br>
</address>
</ul>

<h1><a name=Literatur>Literaturverzeichnis</a></h1>

<h2>F&uuml;r den Einstieg in die Kryptographie</h2>
<ul>
<li>Bruce Schneier, &quot;Applied Cryptography: Protocols,
Algorithms, and Source Code in C&quot;, zweite Auflage, John Wiley &amp;
Sons, 1995
(Dieses Buch ist wirklich gut.)
<li>Dorothy Denning, &quot;Cryptography and Data Security&quot;,
Addison-Wesley, Reading, MA 1982
<li>Dorothy Denning, &quot;Protecting Public Keys and Signature
Keys&quot;, IEEE Computer, Feb 1983
<li>Martin E. Hellman, &quot;The Mathematics of Public-Key
Cryptography&quot;, Scientific American, Aug 1979
<li>Steven Levy, &quot;Crypto Rebels&quot;, WIRED, May/Jun 1993,
page 54. (Ein &quot;Mu&szlig;&quot; zu PGP und verwandten Themen)
</ul>

<h2>Weitere Literatur</h2>
<ul>
<li>Ronald Rivest, &quot;The MD5 Message Digest Algorithm&quot;,
RFC 1321, MIT Laboratory for Computer Science, April 1992
<li>Xuejia Lai, &quot;On the Design and Security of Block
Ciphers&quot;, Institute for Signal and Information Processing,
ETH-Zentrum, Zurich, Switzerland, 1992
<li>Xuejia Lai, James L. Massey, Seanm Murphy, &quot;Markov
Ciphers and Differential Cryptoanalysis&quot;, Advances in Cryptology
- EUROCRYPT'91
<li>Philip Zimmermann, &quot;A Proposed Standard Format for RSA
Cryptosystems&quot;, Advances in Computer Security, Vol. III, edited
by Rein Turn, Artech House, 1988
<li>Paul Wallich, &quot;Electronic Envelopes&quot;, Scientific
American, Feb 1993, page 30. (Handelt von PGP.)
<li>William Bulkeley, &quot;Cipher Probe&quot; Wall Street
Journal, 28 April 1994, front page. (Handelt von PGP und Zimmermann.)
<li>James Bamford, &quot;The Puzzle Palace: A Report on
America's Most Secret Agency&quot;, 656 p., 09/1983 (ISBN
0-14-006748-5, Penguin Books), Viking Penguin.
<li>James Bamford, &quot;The Puzzle Palace: Inside the National
Security Agency, America's Most Secret Intelligence
Organization&quot;, rev. &amp; updated ed., 656 p., 12/1993 (ISBN
0-14-023116-1, Penguin Books), Viking Penguin.
</ul>

<a name=dank>
<h1>Danksagungen</h1>
</a>

Ich danke den im folgenden genannten Leuten f&uuml;r ihre Mitarbeit
an der Entwicklung von PGP. Wenn ich auch der alleinige Autor von PGP
Version 1.0 bin, so sind gro&szlig;e Teile der neueren Versionen in
internationaler Zusammenarbeit entstanden, an der viele Menschen
unter meiner Leitung beteiligt waren.
<p>
Branko Lankester, Hal Finney und Peter Gutmann haben sehr viel Zeit
damit verbracht, neue Eigenschaften in PGP 2.0 einzubauen und es auf
verschiedene Unix-Varianten zu portieren. Hal und Branko leisteten
Schwerstarbeit bei der Implementierung meiner Protokolle f&uuml;r die
Schl&uuml;sselverwaltung. Branko hat damit mehr Zeit verbracht als
alle anderen, die sich an der Entwicklung von PGP beteiligt haben.
<p>
Hugh Kennedy portierte PGP auf VAX/VMS, Lutz Frank auf den Atari ST,
Cor Bosman und Colin Plumb portierten PGP auf den Commodore Amiga.(*)

<hr><i>
 (*)Sp&auml;tere Versionen portierte Peter Simons. d.&Uuml;.
</i><hr>

&Uuml;bersetzungen von PGP stammen von Jean-Loup Gailly in
Franz&ouml;sisch, von Felipe Rodriguez Svensson und Branko Lankester
in Holl&auml;ndisch, von Miguel Angel Gallardo in Spanisch, von Hugh
Kennedy und Lutz Frank in Deutsch(*), David Vincenzetti in
Italienisch, Harry Bush und Maris Gabalins in Lettisch, von
Zygimantas Cepaitis in Litauisch, von Peter Suchkow und Andrew
Chernov in Russisch und von Alexander Smishlajev in Esperanto. Peter
Gutmann bot eine &Uuml;bersetzung in neuseel&auml;ndisches Englisch
an, aber wir waren dann doch der Meinung, da&szlig; US-Englisch
ausreichend ist.

<hr><i>
 (*)Diese &uuml;bersetzten <kbd>language.txt</kbd>. Diese
&Uuml;bersetzung ist schwer aufzutreiben. Mittlerweile existiert auch
eine &Uuml;bersetzung dieser Datei von Marc Aurel, die inzwschen von Frank
Pr&uuml;fer gepflegt wird. d.&Uuml;.
</i><hr>

Jean-Loup Gailly, Mark Adler und Richard B. Wales
ver&ouml;ffentlichten die ZIP-Kompressionsroutinen und erlaubten ihre
Verwendung f&uuml;r PGP. Die MD5 Routinen entwickelte Ron Rivest, der
sie auch f&uuml;r Public Domain Verwendung freigab. Xuejia Lai und
James L. Massey entwickelten an der ETH Z&uuml;rich die
IDEA-Verschl&uuml;sselung. Die Verwendung von IDEA durch PGP erfolgt
mit Genehmigung der AscomTech AG.
<p>
Charlie Merritt lehrte mich, wie man professionell Arithmetik
f&uuml;r gro&szlig;e Zahlen programmiert, wie sie bei Public Key
Verschl&uuml;sselungen &uuml;blich sind. Jimmy Upton schrieb eine
schnelle Implementierung des Algorithmus zum Multiplizieren mit
anschlie&szlig;ender Modulo-Bildung. Von Thad Smith stammt ein noch
schnellerer Algorithmus hierf&uuml;r. Zhahai Stewart hatte viele gute
Ideen zu den Dateiformaten von PGP und &auml;hnlichem. Er machte den
Vorschlag, mehr als eine Benutzerinnen-ID f&uuml;r einen
Schl&uuml;ssel zuzulassen. Vom Konzept beglaubigter Schl&uuml;ssel
erz&auml;hlte mir Whit Diffie. Kelly Goen hatte die meiste Arbeit bei
der elektronischen Erstver&ouml;ffentlichung von PGP 1.0.
<p>
Viele Beitr&auml;ge zur Verbesserung des Programmcodes stammen von
Colin Plumb, Derek Atkins und Castor Fu. Weitere Beitr&auml;ge, nicht
nur zur Programmierung, kommen von Hugh Miller, Eric Hughes, Tim May,
Stephan Neuhaus und vielen anderen; zu viele, um ihre Namen jetzt im
Ged&auml;chtnis zu haben. Die Portierung auf den Macintosh ist in
zwei Projekten bei Zbigniew Fiedorwicz und Blair Weiss in Arbeit.(*)
Seit der Ver&ouml;ffentlichung von PGP 2.0 haben mir viele andere
Programmiererinnen Patches, Bugfixes und Anpassungen f&uuml;r die
Portierung auf andere Computer zugesandt. Es sind zu viele, um ihnen
hier einzeln zu danken.

<hr><i>
 (*)PGP ist mittlerweile auch f&uuml;r den Macintosh verf&uuml;gbar.
d.&Uuml;.
</i><hr>

Die Entwicklung von PGP ist zu einem bemerkenswerten sozialen
Ph&auml;nomen geworden. Der besondere politische Reiz, der von PGP
ausgeht, hat eine auch heute noch wachsende Zahl freiwilliger
Programmiererinnen zur gemeinsamen Arbeit angeregt. Wie in dem
Kinderbuch &quot;Stone Soup&quot; beschrieben, wird es f&uuml;r mich
immer schwieriger, durch die dicke Suppe hindurch den Stein auf dem
Boden des Topfes zu erkennen, den ich selbst zu Anfang hineingeworfen
habe.

<a name=ueberprz>
<h1>&Uuml;ber den Autor</h1>
</a>

Philip Zimmermann ist Softwareentwickler mit &uuml;ber zwanzig Jahren
Erfahrung. Er ist spezialisiert auf integrierte Echtzeitsysteme,
Kryptographie und Fragen der Authentisierung von Nachrichten und
Datenkommunikation. Er hat Erfahrungen unter anderem mit dem Entwurf und der
Implementierung von Authentizit&auml;tspr&uuml;fungssystemen bei
Finanz-Informationsnetzwerken, in der Datensicherheit in Netzwerken,
Protokollen zur Schl&uuml;sselverwaltung, Echtzeit-Multitasking-Systemen,
Betriebssystemen und lokalen Netzwerken.
<p>
Zimmermann bietet anwenderspezifische Implementierungen von
Kryptographie, von Authentizit&auml;tspr&uuml;fungen und von
asymmetrischen Systemen an, au&szlig;erdem allgemeine
anwenderspezifische Entwicklungen. Seine Firmenadresse:

<a name=adrprz>
<h2>Die Adresse des Autors</h2>
</a>

<address>
Philip Zimmermann<br>
Boulder Software Engineering<br>
3021 Eleventh Street<br>
Boulder, Colorado 80304 USA<br>
Telefon/Fax 303-541-0140 (10:00am-7:00pm Mountain Time)<br>
Internet: <kbd>&lt;prz@acm.org&gt;</kbd></address>

<!-- An WWW anpassen: Links einbauen, insgesamt neu schreiben -->
<a name=quellen>
<h1>Bezugsquellen f&uuml;r PGP</h1>
</a>

<blockquote><i>
Eine st&auml;ndige Aktualisierung einer solchen Liste w&uuml;rde sehr
viel Arbeit kosten. F&uuml;r aktuelle Listen sei an dieser Stelle auf
die englischen FAQs, die regelm&auml;&szlig;ig in
<kbd>alt.security.pgp</kbd> ver&ouml;ffentlicht werden, sowie auf die
deutschen FAQs, die in <kbd>/Z-NETZ/ALT/PGP/ALLGEMEIN</kbd> und in
<kbd>de.comp.security</kbd> ver&ouml;ffentlicht werden, verwiesen.
d.&Uuml;.
</i></blockquote>

PGP verwendet das Verschl&uuml;sselungsverfahren RSA, das durch ein
Patent im Besitz der Firma Public Key Partners gesch&uuml;tzt ist.
F&uuml;r PGP-Anwenderinnen au&szlig;erhalb der USA sei angemerkt,
da&szlig; es nur in den USA ein Patent auf RSA gibt. Zu beachten ist,
da&szlig; es allen Personen, die in den USA und Kanada leben,
aufgrund der Exportgesetze dieser Staaten verboten ist,
kryptographische Software dieser Art zu exportieren. Wenn Sie jedoch
au&szlig;erhalb der USA leben, begehen Sie wahrscheinlich keinen
Versto&szlig; gegen das US-Exportgesetz, wenn Sie sich PGP von einer
Quelle au&szlig;erhalb der USA besorgen. Beachten Sie, da&szlig; sich
der Name &quot;PGP&quot; aufgrund der Verhandlungen mit den
RSA-Patentinhabern bei zuk&uuml;nftigen Versionen m&ouml;glicherweise
&auml;ndern wird.
<p>
Im Folgenden finden Sie eine kleine Auswahl von Stellen, an denen Sie
angeblich PGP bekommen k&ouml;nnen (Stand: M&auml;rz 1996). F&uuml;r die
Richtigkeit dieser Informationen gibt es keine Garantie.
<p>
Das Standardpaket von PGP besteht aus zwei komprimierten Dateien,
wobei die Dateinamen die Versionsnummer enthalten. Die Version 2.6.2i
steht in der Datei <kbd>pgp263ix.zip</kbd>. Diese Datei enth&auml;lt
das ausf&uuml;hrbare Programm f&uuml;r MS-DOS und dieses Handbuch (im
englischen Original). Au&szlig;erdem gibt es die Datei
<kbd>pgp263is.zip</kbd>, die den Quellcode enth&auml;lt. Diese Dateien
k&ouml;nnen mit PKUNZIP Version 1.10 oder neuer dekomprimiert werden.
Unix-Anwender, die keine UNZIP-Implementierung haben, k&ouml;nnen an
denselben Stellen auch die Quelltexte als komprimierte tar-Datei
<kbd>pgp.2.6.3.is.tar.gz</kbd> finden.
<p>
Zur Erinnerung: W&auml;hlen Sie Bin&auml;r&uuml;bertragung, wenn Sie
sich die Dateien per ftp holen. Unter Kermit mu&szlig; auf beiden
Seiten die Betriebsart &quot;8 Bit bin&auml;r&quot; gew&auml;hlt
werden. Und nun eine kleine Liste anonymer ftp-Server, die PGP
anbieten:
<!-- dl? -->
<p>
<kbd>
<strong>Deutschland:</strong><a
href=ftp://ftp.cert.dfn.de/pub/crypt/pgp/>ftp.cert.dfn.de</a>
<p>
<strong>Finnland:</strong><a
href=ftp://nic.funet.fi/pub/unix/security/crypt/>nic.funet.fi</a>

<p>
<strong>Italien:</strong>
<a href=ftp://ghost.dsi.unimi.it/pub/security/>ghost.dsi.unimi.it</a>

<p>
<strong>Gro&szlig;britannien:</strong><a
href=ftp://src.doc.ic.ac.uk/computing/security/software/PGP/>src.doc.ic.ac.uk</a>
</kbd>

<p>
Falls Sie ftp nicht einsetzen k&ouml;nnen: <kbd>nic.funet.fi</kbd>
bietet auch &quot;ftp-Mail-Service&quot; an. Um PGP zu bekommen,
senden Sie die folgende Nachricht an
<kbd>&lt;mailserv@nic.funet.fi&gt;</kbd>:
<p>
<pre><kbd>
ENCODER uuencode
SEND pub/unix/security/crypt/pgp26is.zip
SEND pub/unix/security/crypt/pgp26i.zip(*)
</kbd></pre>

<hr><i>
 (*)Der Name der Quellcodedatei variiert nach meiner Erfahrung etwas.
d.&Uuml;.
</i><hr>

Nach sp&auml;testens 24 Stunden haben Sie in Ihrem Postfach etwa 15
UUcodierte Nachrichten, aus denen Sie mit UUdecode die beiden
<kbd>.zip</kbd>-Dateien erhalten.
<p>
Zu Informationen zu PGP-Implementierungen f&uuml;r den Apple
Macintosh, den <a
href=ftp://gigaserv.uni-paderborn.de/pub/aminet/util/crypt/>Amiga</a>
und den Atari ST oder andere Rechner
k&ouml;nnen Sie Hugh Miller
<kbd>&lt;hmiller@lucpul.it.luc.edu&gt;</kbd> fragen.
<p>
Hier die E-Mail-Adressen oder Telefonnummern einiger Personen, die
Sie fragen k&ouml;nnen, wo es PGP in einem bestimmten Land gibt:

<ul>
<li><strong>Deutschland</strong><br>
FoeBuD e.V. <kbd>&lt;foebud@bionic.zerberus.de&gt;</kbd>
+49 521 175254<br>
Christopher Creutzig
<kbd>&lt;c.creutzig@bionic.zerberus.de&gt;</kbd><br>
Abel Deuring
<kbd>&lt;a.deuring@bionic.zerberus.de&gt;</kbd>

<li><strong>Neuseeland</strong><br>
Peter Gutmann
<kbd>&lt;pgut1@cs.aukuni.ac.nz&gt;</kbd><br>
Hugh Kennedy
<kbd>&lt;70042.710@compuserve.com&gt;</kbd>

<li><strong>Holland, Spanien</strong><br>
Branko Lankester
<kbd>&lt;lankeste@fwi.uva.nl&gt;</kbd><br>
Miguel Angel Gallardo
<kbd>&lt;gallardo@batman.fi.upm.es&gt;</kbd><br>
+31 2159 42242 (341)<br>
474 38 09

<li><strong>Toronto, Ontario, Canada, USA</strong><br>
Hugh
Miller <kbd>&lt;hmiller@lucpul.it.luc.edu&gt;</kbd><br>
Colin Plumb
<kbd>&lt;colin@nyx.cs.du.edu&gt;</kbd><br>
+1 (312) 508-2727

<li><strong>Frankreich</strong><br>
Jean-loup Gailly
<kbd>&lt;jloup@chorus.fr&gt;</kbd>

</ul>
<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
