<HTML>
<head>
<title>PGP = &Uuml;berblick</title>
</head>
<body>
<address>
FoeBuD e.V. Bielefeld
</address>
<hr>

<a href=#allgemeines>Allgemeines</a><br>
<a href=#warumpgp>Warum eigentlich PGP benutzen?</a><br>
<a href=#funktion>Die Funktionsweise PGPs</a>

<hr>

<a name=allgemeines>
<h1>Allgemeines</h1>
</a>

PGP steht f&uuml;r &quot;Pretty Good(TM) Privacy&quot;, zu deutsch
etwa &quot;recht gute Privatsph&auml;re&quot;, wobei &quot;Pretty
Good&quot; auch als Kurzform von &quot;Phil's Pretty Good
Software&quot; anzusehen ist, von wo das Programm stammt. Es handelt
sich um ein hochsicheres Ver- und Entschl&uuml;sselungsprogramm, das
f&uuml;r sehr viele verschiedene Rechner und Betriebssysteme
existiert, so z.B. auf Amiga, Atari, Macintosh, MS-DOS, Unix, VAX/VMS
etc. PGP gestattet den Austausch von Nachrichten ohne Verzicht auf
Privatsph&auml;re, Authentifikation und Komfort. Hierbei verstehen
wir unter Privatsph&auml;re, da&szlig; eine Nachricht nur von den
gew&uuml;nschten Adressaten gelesen werden kann, unter
Authentifikation, da&szlig; eine Nachricht
&uuml;berpr&uuml;fbarerweise von der Person stammt, von der sie zu
stammen scheint (elektronische Unterschrift), und unter Komfort,
da&szlig; der Anwender sich keine unn&ouml;tigen Gedanken
dar&uuml;ber machen mu&szlig;, wo er welche Schl&uuml;ssel aufbewahrt
und welchen Schl&uuml;ssel er zum Datenaustausch mit wem benutzt, wie
dies bei herk&ouml;mmlicher Verschl&uuml;sselungssoftware allzuoft
der Fall ist.
<p>
Ebenfalls im Gegensatz zu herk&ouml;mmlicher
Verschl&uuml;sselungstechnik werden keine abh&ouml;rsicheren
Kan&auml;le gebraucht, durch die Schl&uuml;ssel ausgetauscht werden,
da PGP ein System mit &ouml;ffentlichen Schl&uuml;sseln nutzt. PGP
verbindet die Bedienungsfreundlichkeit von RSA(*) mit der
Geschwindigkeit konventioneller Kryptographie(**) und verwendet ein
Verfahren zur Generierung von Textpr&uuml;fsummen(***), um
elektronische Unterschriften zu erzeugen. Es komprimiert die Daten
vor der Verschl&uuml;sselung, ist benutzerfreundlich, hat eine
komfortable Schl&uuml;sselverwaltung und ist portabel. Die
Implementierung des RSA-Algorithmus bei PGP arbeitet schneller als
die meisten RSA-Implementierungen in anderen Programmen. Sie
k&ouml;nnen von Ihrem PC, der beispielsweise unter MS-DOS l&auml;uft,
einen Text verschl&uuml;sselt an einen Bekannten senden, der diesen
auf seinem Amiga entschl&uuml;sseln kann. Oder Sie senden einen Text
an die Uni, den Sie f&uuml;r wichtig halten und deshalb
unterschreiben m&ouml;chten - kein Problem, wenn die Uni PGP
installiert hat, kann die Empf&auml;ngerin Ihre Unterschrift auch auf
einer Unix-Maschine pr&uuml;fen. Und PGP ist schnell. PGP ist das
Kryptographiesystem f&uuml;r jedermann und jedefrau.
<p>
<hr><i>
 (*)ein Algorithmus f&uuml;r Systeme mit &ouml;ffentlichen
Schl&uuml;sseln, der von <strong>R</strong>ivest,
<strong>S</strong>hamir und <strong>A</strong>dleman entwickelt wurde
und als sehr sicher gilt
<p>
 (**)d.h. ohne &ouml;ffentliche Schl&uuml;ssel arbeitende Kryptographie
<p>
 (***)Bei PGP wird das Verfahren &quot;Message Digest 5&quot; verwendet
</i><hr>

PGP versendet seine Dateien nicht selbst, sondern besch&auml;ftigt
sich ausschlie&szlig;lich mit dem Ver- und Entschl&uuml;sseln. Zum
Versenden brauchen Sie weitere Programme. (Dieselben wie f&uuml;r
nicht verschl&uuml;sselte Texte.) (*)
<p>
<hr><i>
 (*)In sehr viele E-Mail-Programme kann PGP mittlerweile recht
komfortabel eingebunden werden. F&uuml;r Unix finden Sie hierzu
n&auml;heres im Verzeichnis <kbd>contrib</kbd> des PGP-
Programmpaketes. Das Datenaustauschformat ZCONNECT(r) ist
mittlerweile dahingehend erweitert worden, da&szlig;
Verschl&uuml;sselungsprogramme und insbesondere PGP in kommende
Versionen von Pointprogrammen noch besser eingebunden werden
k&ouml;nnen.
</i><hr>

Dieses Buch ist in zwei Teile unterteilt: Teil I behandelt allgemeine
Fragen zu PGP und dessen Bedienung und sollte von allen Anwendern
gelesen werden. Teil II beinhaltet fortgeschrittene Techniken beim
Umgang mit PGP und einige Spezialthemen, die f&uuml;r den normalen
Anwender eher uninteressant sein d&uuml;rften.

<a name="warumpgp">
<h1>Warum eigentlich PGP benutzen?</h1>
</a>

PGP sch&uuml;tzt die Privatsph&auml;re. Ob Sie nun eine politische
Kampagne planen, &uuml;ber Ihr Einkommen reden oder eine Aff&auml;re
geheimhalten wollen, ob Sie &uuml;ber etwas reden wollen, das Ihrer
Meinung nach zu Unrecht illegal ist oder ob Sie Daten speichern,
transportieren und versenden m&uuml;ssen, die unter das
Datenschutzgesetz fallen (Systembetreuer, die ihre Userdaten
&uuml;ber eine Telefonleitung transportieren), ob Sie manchmal
Nachrichten schreiben wollen, von denen andere genau wissen sollen,
da&szlig; sie von Ihnen stammen oder ob Sie eben dies bei Nachrichten
von anderen pr&uuml;fen wollen - die meisten Menschen, die E-Mail
nutzen, werden PGP fr&uuml;her oder sp&auml;ter verwenden k&ouml;nnen.
<p>
Und wenn Sie sich davor str&auml;uben, Ihre privaten Mails zu
verschl&uuml;sseln: Warum verwenden Sie eigentlich
Briefumschl&auml;ge? Nehmen wir einmal an, es sei die g&auml;ngige
Ansicht, brave B&uuml;rger br&auml;uchten keine Briefumschl&auml;ge
zu verwenden. Wenn nun irgend jemand aus irgendeinem Grund einen
Briefumschlag verwenden w&uuml;rde (mehrere Bl&auml;tter, ein
Liebesbrief, den die Mutter des Adressaten nicht lesen soll etc.),
dann w&auml;re dies h&ouml;chst verd&auml;chtig.
Gl&uuml;cklicherweise verwenden die meisten Menschen
Briefumschl&auml;ge, doch bei elektronischen Briefen ist dies bislang
noch nicht der Fall. Dabei sind die elektronischen Datenwege sehr
viel leichter zu &uuml;berwachen (rein technisch) als konventionelle
Briefpost, und elektronische Nachrichten k&ouml;nnen auch sehr
schnell auf bestimmte Schl&uuml;sselw&ouml;rter durchsucht werden.
Und: Gehen Sie eigentlich regelm&auml;&szlig;ig zum AIDS-Test?
M&ouml;chten Sie sich auf illegalen Drogenkonsum untersuchen lassen?
Verlangen Sie nicht einen richterlichen Durchsuchungsbefehl, wenn die
Polizei bei Ihnen eine Hausdurchsuchung machen will? Haben Sie am
Ende etwas zu verbergen? Wahrscheinlich sind Sie ein Drogendealer,
ein Falschparker oder ein Subversiver, wenn Sie Briefumschl&auml;ge
benutzen.
<p>
Was w&auml;re, wenn es der allgemeinen Auffassung entspr&auml;che,
rechtschaffene B&uuml;rger sollten all ihre Post auf Postkarten
schreiben? Wenn ein braver Mensch auf die Idee k&auml;me, sein
Briefgeheimnis durch einen Umschlag zu sch&uuml;tzen, w&auml;re das
h&ouml;chst verd&auml;chtig. Sicherheitsbeh&ouml;rden w&uuml;rden
vielleicht jeden Briefumschlag &ouml;ffnen, um zu kontrollieren, was
er verbirgt. Gl&uuml;cklicherweise leben wir nicht in so einer Welt -
die meisten Menschen verwenden Briefumschl&auml;ge, so da&szlig; ein
Briefumschlag auch nichts Verd&auml;chtiges ist. Es w&auml;re
sch&ouml;n, wenn alle E-Mail verschl&uuml;sselt w&uuml;rde, ob sie
nun verbotene Nachrichten enth&auml;lt oder nicht, so da&szlig; die
Verschl&uuml;sselung von E-Mail genauso wenig verd&auml;chtig wird
wie das Verwenden Briefumschl&auml;gen.
<p>
Wenn Sicherheitsbeh&ouml;rden das Brief- oder Telefongeheimnis
brechen wollen, m&uuml;ssen sie einigen Aufwand treiben. Sie
m&uuml;ssen den Umschlag unter Wasserdampf &ouml;ffnen, den Brief
lesen und den Umschlag wieder zukleben. Das Abh&ouml;ren von
Telefongespr&auml;chen ist sehr zeitintensiv, und auch eine
Transskription kostet Zeit. Eine so arbeitsintensive &Uuml;berwachung
kann nicht im gro&szlig;en Stil betrieben werden. Nur in wichtigen
F&auml;llen ist sie durchf&uuml;hrbar.
<p>
Ein immer gr&ouml;&szlig;erer Teil unserer Privatkommunikation
l&auml;uft &uuml;ber E-Mail. E-Mail aber l&auml;&szlig;t sich sehr
leicht &uuml;berwachen. Die Suche nach verd&auml;chtigen
Schl&uuml;sselworten ist kein Problem. Das kann ganz einfach
routinem&auml;&szlig;ig und vollautomatisch in gro&szlig;em
Ma&szlig;stab durchgef&uuml;hrt werden, ohne da&szlig; es irgendwie
auff&auml;llt. Internationale Kommunikationswege werden so von der
National Security Agency (NSA) abgeh&ouml;rt.
<p>
Wir werden bald den &quot;Information Superhighway&quot; haben, der
Amerika kreuz und quer mit Glasfaserkabeln &uuml;berzieht und die
allgegenw&auml;rtigen PCs verbindet. E-Mail wird allgemeiner Standard
werden. Regierungsbeh&ouml;rden werden f&uuml;r die
Verschl&uuml;sselung unserer Nachrichten ihre eigene Technologie
empfehlen. Viele Leute m&ouml;gen dieser Technologie vertrauen. Aber
andere werden es vorziehen, ihre eigene Wahl zu treffen.
<p>
Die Gesetzesvorlage 266, die 1991 im US-Senat vorgelegt wurde,
enth&auml;lt ein paar beunruhigende Regelungen. W&auml;re der Entwurf
verabschiedet worden, w&auml;ren die Hersteller von
abh&ouml;rsicherer Kommunikationstechnik verpflichtet gewesen, in
ihre Produkte &quot;Fallt&uuml;ren&quot; einzubauen, mit deren Hilfe
die Regierung s&auml;mtliche Verschl&uuml;sselungen h&auml;tte
knacken k&ouml;nnen. Im Wortlaut: &quot;Der Senat ist der Ansicht,
da&szlig; die Anbieter elektronischer Kommunikation und die
Hersteller elektronischer Kommunikationsger&auml;te sicherstellen
m&uuml;ssen, da&szlig; die Regierung Zugriff auf die
entschl&uuml;sselte Sprach&uuml;bertragung, Daten- und andere
Kommunikation hat, sofern hierf&uuml;r eine Gesetzesgrundlage
vorhanden ist.&quot; Diese Vorlage wurde nach heftigen Protesten von
B&uuml;rgerrechtsgruppen und Industrieverb&auml;nden
zur&uuml;ckgezogen.
<p>
1992 legte das FBI dem Kongre&szlig; einen Gesetzentwurf zum
Abh&ouml;ren von Telefonen vor. Dieses Gesetz sollte alle Hersteller
von Kommunikationsger&auml;ten verpflichten, Vorrichtungen in die
Ger&auml;te einzubauen, die es jeder FBI-Dienststelle
erm&ouml;glichen, elektronische Kommunikation abzuh&ouml;ren. Obwohl
auch diese Vorlage im Kongre&szlig; kaum auf Resonanz stie&szlig;,
wurde sie 1993 erneut vorgelegt.
<p>
Besonders besorgniserregend ist ein neuer Vorsto&szlig; des
Wei&szlig;en Hauses, der von der National Security Agency (NSA)
jahrelang vorbereitet und am 16. April 1993 ver&ouml;ffentlicht
wurde. Kernst&uuml;ck ist eine von staatlicher Seite entworfene
Verschl&uuml;sselungstechnologie namens Clipper, die nach einem
geheimgehaltenen Verfahren arbeitet. Die Regierung fordert die
Komunikationsindustrie auf, diesen Chip in alle Ger&auml;te
einzubauen, die &quot;sichere&quot; Kommunikation erm&ouml;glichen
sollen, wie Telefone, Faxger&auml;te usw. AT&amp;T baut diesen Chip
schon jetzt in &quot;abh&ouml;rsichere&quot; Telefone ein.
<p>
<blockquote><i>
AT&amp;T hatte zuvor ein wahrscheinlich sichereres
Verfahren entwickelt, das auf &quot;sanften&quot; Druck von
staatlicher Seite fallengelassen wurde. d.&Uuml;.
</i></blockquote>

<p>
Der Haken bei Clipper: Bei der Herstellung bekommt jeder Chip seinen
individuellen Schl&uuml;ssel, und die Regierung erh&auml;lt Kopien
dieser Schl&uuml;ssel, um abh&ouml;ren zu k&ouml;nnen. Aber keine
Sorge - die Regierung verspricht, da&szlig; diese
&quot;Zweitschl&uuml;ssel&quot; nur ordnungsgem&auml;&szlig;
entsprechend den rechtlichen Bestimmungen eingesetzt werden. Damit
Clipper f&uuml;r die Beh&ouml;rden den vollen Nutzen entfalten kann,
w&auml;re der n&auml;chste logische Schritt ein Verbot anderer Formen
von Kryptographie. Nach offiziellen Statements ist das allerdings
nicht geplant.
<p>
Wenn Privatsph&auml;re zum Gesetzesbruch wird, werden nur
Gesetzesbrecher Privatsph&auml;re genie&szlig;en k&ouml;nnen.
Geheimdienste, Milit&auml;r, Drogenkartelle, gro&szlig;e
Wirtschaftsunternehmen, sie alle haben gute Kryptographiesysteme. Nur
normale Menschen und politische Basisorganisationen sind davon
ausgenommen - waren davon ausgenommen, denn nun gibt es PGP.
<p>
Das ist der Grund, warum PGP geschrieben wurde, und das ist auch der
Grund, warum Sie PGP nutzen sollten.

<a name=funktion>
<h1>Die Funktionsweise von PGP</h1>
</a>

Das Ganze ist nat&uuml;rlich leichter zu verstehen, wenn Sie bereits
etwas von Verschl&uuml;sselungssystemen im allgemeinen und
asymmetrischen Verfahren (&quot;public-key-Systemen&quot;) im
besonderen verstehen. Da dies nicht vorausgesetzt werden kann, nun
eine kleine Einf&uuml;hrung:
<p>
Zun&auml;chst sollten einige Begriffe gekl&auml;rt werden. Nehmen wir
einmal an, ich m&ouml;chte Ihnen eine Nachricht schreiben, die sonst
niemand lesen k&ouml;nnen soll. Hierzu kann ich die Nachricht
&quot;verschl&uuml;sseln&quot; oder &quot;codieren&quot;(*),
das hei&szlig;t, ich ver&auml;ndere sie nach
einem hoffnungslos komplizierten System, so da&szlig; niemand etwas
damit anfangen kann, ausgenommen Sie, der beabsichtigte
Empf&auml;nger der Nachricht. Ich verwende einen Schl&uuml;ssel, und
Sie m&uuml;ssen diesen Schl&uuml;ssel ebenfalls benutzen, um die
Nachricht zu entschl&uuml;sseln. Zumindest bei herk&ouml;mmlichen
symmetrischen, mit einem einzigen Schl&uuml;ssel arbeitenden Systemen.
<p>
<hr><i>
 (*)Das Wort &quot;codieren&quot; hat eine Doppelbedeutung: Es beudeutet
einerseits &quot;in einer bestimmten Form darstellen&quot; und
andererseits &quot;verschl&uuml;sseln&quot;. In diesem Handbuch wird
es meist im Sinne von &quot;verschl&uuml;sseln&quot; verwendet.
</i><hr>

Da&szlig; herk&ouml;mmliche Systeme einen gemeinsamen Schl&uuml;ssel
zum Ver- und Entschl&uuml;sseln benutzen, bedeutet, da&szlig; dieser
Schl&uuml;ssel auf einem sicheren Weg zwischen Absenderin und
Empf&auml;nger ausgetauscht werden mu&szlig;. Das kann
umst&auml;ndlich sein, und wenn ein sicherer Weg existiert, um den
Schl&uuml;ssel auszutauschen, warum wollen Sie dann
verschl&uuml;sseln? Sie k&ouml;nnten den sicheren Kanal doch auch
f&uuml;r die Kommunikation nutzen.
<p>
In Systemen mit &ouml;ffentlichen Schl&uuml;sseln (asymmetrische
Systeme) gibt es f&uuml;r jeden Teilnehmer ein Schl&uuml;sselpaar,
bestehend aus einem &ouml;ffentlichen und einem geheimen
Schl&uuml;ssel. Was mit dem einen Schl&uuml;ssel verschl&uuml;sselt
wurde, kann nur mit dem dazugeh&ouml;rigen anderen Schl&uuml;ssel
entschl&uuml;sselt werden. Den &ouml;ffentlichen Schl&uuml;ssel zu
kennen reicht nicht aus, um die damit verschl&uuml;sselten
Nachrichten lesen zu k&ouml;nnen. Der geheime Schl&uuml;ssel
l&auml;&szlig;t sich idealerweise nicht aus dem &ouml;ffentlichen
Schl&uuml;ssel berechnen. Moderne Verfahren wie die in PGP
verwendeten kommen, richtig angewendet, diesem Ideal sehr nahe.
Deshalb kann der &ouml;ffentliche Schl&uuml;ssel ohne Bedenken
verbreitet werden (darum hei&szlig;t er &ouml;ffentlich), womit ein
sehr viel geringerer Bedarf an sicheren Transportwegen besteht als
bei herk&ouml;mmlichen Systemen.
<p>
Weiterhin gibt es die M&ouml;glichkeit, eine Nachricht zu
&quot;unterschreiben&quot;. Hierzu kann der Absender einer Nachricht
diese mit seinem privaten Schl&uuml;ssel codieren, und jeder
Empf&auml;nger kann die Echtheit des Absenders dadurch pr&uuml;fen,
da&szlig; er versucht, die Nachricht mit dessen &ouml;ffentlichen
Schl&uuml;ssel zu decodieren. Wenn dies gelingt, ist die Nachricht
mit dem privaten Schl&uuml;ssel codiert, also unterschrieben worden.
Der Absender ist echt.
<p>
Diese beiden Schritte k&ouml;nnen nat&uuml;rlich miteinander
kombiniert werden, um Briefgeheimnis und Authentizit&auml;t des
Absenders zu gew&auml;hrleisten: Die Nachricht wird zun&auml;chst mit
dem eigenen privaten Schl&uuml;ssel codiert und diese unterschriebene
Nachricht anschlie&szlig;end mit dem &ouml;ffentlichen Schl&uuml;ssel
der Empf&auml;ngerin codiert. Diese decodiert die Nachricht
zun&auml;chst mit ihrem privaten Schl&uuml;ssel und
anschlie&szlig;end mit dem &ouml;ffentlichen Schl&uuml;ssel des
Absenders. PGP erledigt dies automatisch.
<p>
Da alle bisher bekannten asymmetrischen Algorithmen deutlich
langsamer arbeiten als herk&ouml;mmliche
Verschl&uuml;sselungsalgorithmen, bietet es sich an, die eigentliche
Verschl&uuml;sselung mit einem guten und schnellen herk&ouml;mmlichen
System vorzunehmen. PGP generiert f&uuml;r jede Verschl&uuml;sselung
hierzu einen zuf&auml;llig ausgew&auml;hlten Schl&uuml;ssel, der nur
ein einziges Mal verwendet wird, und verschl&uuml;sselt hiermit die
Nachricht. Anschlie&szlig;end wird dieser Wegwerf-Schl&uuml;ssel mit
dem &ouml;ffentlichen Schl&uuml;ssel des Empf&auml;ngers codiert und
in die verschl&uuml;sselte Nachricht hineingeschrieben. Der
Empf&auml;nger kann nun mit Hilfe seines privaten Schl&uuml;ssels den
Einmal-Schl&uuml;ssel wieder herstellen und die gesamte Nachricht
entziffern. Dieser ganze Vorgang ist f&uuml;r den Benutzer nicht
sichtbar.
<p>
Viele Leute haben sich Gedanken gemacht und mich gefragt, ob die
Verwendung eines asymmetrischen Verfahrens die Sicherheit von PGP
nicht beeintr&auml;chtigt.Wenn der schnellste Weg, um IDEA zu
brechen, der ist, alle m&ouml;glichen Schl&uuml;ssel zu testen - und
danach sieht es aus -, dann ist der Aufwand, um eine
IDEA-Verschl&uuml;sselung zu brechen, in etwa damit vergleichbar,
einen RSA-Schl&uuml;ssel von 3100 Bit zu faktorisieren. IDEA ist
damit nicht als Schwachstelle in PGP anzusehen. Der gro&szlig;e
Vorteil von asymmetrischen Verfahren wie RSA liegt nicht in der
Sicherheit, die sie bieten, sondern in der enormen Vereinfachung der
Schl&uuml;ssel&uuml;bergabe. Die Verwendung von IDEA f&uuml;r die
eigentliche Verschl&uuml;sselung schw&auml;cht PGP keinesfalls ab.(*)
<p>
<hr><i>
 (*)Das Verfahren, ein symmetrisches und ein asymmetrisches Verfahren so
zu koppeln (Hybridverfahren), ist durchaus  &uuml;blich. Eine reine
RSA-Kodierung w&uuml;rde sogar Sicherheitsprobleme mit sich bringen.
Au&szlig;erdem w&auml;re die Verschl&uuml;sselung einer Nachricht an
mehrere Empf&auml;nger nicht mehr ohne weiteres m&ouml;glich.
d.&Uuml;.
</i><hr>

Die Schl&uuml;ssel werden in sogenannten &quot;key certificates&quot;
aufbewahrt, die au&szlig;er dem Schl&uuml;ssel selbst noch einen
kurzen Text mit Namen und Netzadresse der &quot;Inhaberin&quot; und
den Vermerk, wann der Schl&uuml;ssel erzeugt wurde, enthalten. Der
Text mit Namen und Netzadresse wird im folgenden
&quot;Benutzer-ID&quot; genannt. &quot;Public key certificates&quot;
enthalten die &ouml;ffentlichen Schl&uuml;ssel, w&auml;hrend
&quot;secret key certificates&quot; die privaten Schl&uuml;ssel
beinhalten. Private Schl&uuml;ssel sind mit einem Mantra
gesch&uuml;tzt, da sie gestohlen werden k&ouml;nnten. PGP benutzt
zwei Dateien, in denen die Schl&uuml;ssel aufbewahrt werden, eine
f&uuml;r die &ouml;ffentlichen und eine f&uuml;r die privaten. Diese
Dateien k&ouml;nnen Sie mit einem Schl&uuml;sselbund vergleichen.
<p>
Weiterhin hat jeder Schl&uuml;ssel eine Kennung, die aus den letzten
64 Bit des Schl&uuml;ssels besteht, von denen nur
die letzten 32 Bit angezeigt wurden, z.B. <kbd>6ce93239</kbd>. Diese
Kennung verwendet PGP intern, um die Schl&uuml;ssel voneinander zu
unterscheiden. Zwei verschiedene Schl&uuml;ssel k&ouml;nnen dieselbe
Benutzer-ID haben, die Kennung aber ist aller Wahrscheinlichkeit nach
stets verschieden.
<p>
Um Nachrichten zu unterschreiben, nutzt PGP einen &quot;message
digest&quot;, eine Methode, um aus einer Nachricht eine 128-Bit-Zahl
zu erzeugen, die die Nachricht eindeutig genug bestimmt, damit eine
Ver&auml;nderung oder ein Neuschreiben mit dem Ergebnis eines
gleichen Wertes praktisch unm&ouml;glich ist. Diese Zahl wird -
&auml;hnlich einer CRC-Pr&uuml;fsumme - dazu verwendet,
Ver&auml;nderungen der Nachricht zu diagnostizieren.
Anschlie&szlig;end wird diese 128-Bit-Zahl mit dem privaten
Schl&uuml;ssel codiert. Die verschl&uuml;sselte Zahl wird nun
zusammen mit der Schl&uuml;sselidentifikation und einem Vermerk, wann
die Unterschrift gemacht wurde, an die Nachricht angeh&auml;ngt. Die
Software des Empf&auml;ngers sucht im &ouml;ffentlichen
Schl&uuml;sselbund nach dem Schl&uuml;ssel des Absenders und
&uuml;berpr&uuml;ft damit die Unterschrift. Der in PGP verwendete
Algorithmus hei&szlig;t &quot;Message Digest 5&quot; (MD5).
<p>
Ebenso entschl&uuml;sselt die Software der Empf&auml;ngerin
ankommende Nachrichten automatisch. Bei diesen wird an den Anfang der
Nachricht ebenfalls die Schl&uuml;sselkennung gesetzt. PGP sucht in
der Datei mit privaten Schl&uuml;sseln nach dem passenden
Schl&uuml;ssel und entschl&uuml;sselt automatisch die Nachricht.



<hr>
Dies ist Zugriff <!--#exec cgi="/cgi-bin/belcount.cgi" --> auf diese Seite.

<hr>
<A HREF="/index.html"><IMG SRC="/icons/homepage.gif" ALT="[<<]"></A>
<A HREF="index.html"><IMG SRC="/icons/pageback.gif" ALT="[<]"></A>
<hr>
<address><a href="../index.html">Christopher Creutzig</a>1994-07-05</address>
</BODY>
</HTML>
