<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0//EN">
<HTML>
<HEAD>
<TITLE>Allgemeine Informationen zu den PGP Keyservern</TITLE>
<LINK REV="made" HREF="mailto:kelm@pca.dfn.de">
</HEAD>

<BODY>
<EM>Key server software written by Michael Graff &lt;explorer@iastate.edu&gt;</EM>
<DL COMPACT>
<DT><EM>English</EM>:
<DD>For an English version of this text please send a mail with a subject line
of &quot;HELP&quot; to
<A HREF="mailto:pgp-public-keys@keys.pgp.net">pgp-public-keys@keys.pgp.net</A>,
or access the URL
<A HREF="http://www.pgp.net/pgpnet/email-help-en.html">http://www.pgp.net/pgpnet/email-help-en.html</A>
<DT><EM>Norwegian:</EM>
<DD>For aa faa dette dokumentet  paa norsk, send &quot;HELP NO&quot; til
<A HREF="mailto:pgp-public-keys@keys.no.pgp.net">pgp-public-keys@keys.no.pgp.net</A>
<DT><EM>Spanish:</EM>
<DD>Para obtener una version en castellano de este texto, envie un mail a pgp
<A HREF="mailto:pgp-public-keys@keys.es.pgp.net">pgp-public-keys@keys.es.pgp.net</A>
con el Subject &quot;HELP ES&quot;
<DT><EM>Finnish:</EM>
<DD>Saadaksesi taman tekstin suomeksi, laheta osoitteeseen
<A HREF="mailto:pgp-public-keys@keys.fi.pgp.net">pgp-public-keys@keys.fi.pgp.net</A>
tyhja viesti, jonka Subject-kentta on &quot;HELP FI&quot;
<DT><EM>Croatian:</EM>
<DD>Za hrvatsku verziju ovoga teksta posaljite poruku
koja ce u Subject imati &quot;HELP HR&quot; na adresu
<A HREF="mailto:pgp-public-keys@keys.hr.pgp.net">pgp-public-keys@keys.hr.pgp.net</A>
</DL>
<P>
<HR>
<P>
<H1>PGP Public Email Key Server</H1>
Es gibt eine Reihe dieser PGP Public Email Key Server, die den Austausch
der &ouml;ffentlichen Schl&uuml;ssel mittels der Email-Systeme des Internets
erlauben.
<P>
Diejenigen, die WWW einsetzen, k&ouml;nnen mittels eines WWW-Interfaces auch
auf die Schl&uuml;ssel zugreifen:
<A HREF="http://www.pgp.net/pgpnet/www-key.html">http://www.pgp.net/pgpnet/www-key.html</A>
<P>
F&uuml;r h&auml;ufigere Zugriffe kann auf den kompletten Key-Ring per AnonFtp zugegriffen werden:
<A HREF="ftp://ftp.pgp.net/pub/pgp/keys/">ftp://ftp.pgp.net/pub/pgp/keys/</A>.
<P>
Diese Server  dienen allein dem Austausch  von &ouml;ffentlichen Schl&uuml;sseln
zwischen PGP Anwendern. Sie stellen  <STRONG>keine Garantie</STRONG> f&uuml;r die Authentizit&auml;t
oder  Validit&auml;t eines Schl&uuml;ssels  dar! Um diese  zu &uuml;berpr&uuml;fen,
m&uuml;ssen die Signaturen der Schl&uuml;ssel gepr&uuml;ft, bzw. mit anderen Mitteln
die Authentizit&auml;t festgestellt werden.
<P>
Die Email Key  Server bearbeiten Anfragen in  Form von Mail-Nachrichten.
Befehle  an  den Key  Server  m&uuml;ssen  in der  &quot;Subject:&quot; - Zeile  stehen;
Befehle im Text-Teil der Mail-Nachrichten werden ignoriert.
<PRE>
        To: <A HREF="mailto:pgp-public-keys@keys.de.pgp.net">pgp-public-keys@keys.de.pgp.net</A>
        From: johndoe@some.site.de
        Subject: HELP DE
</PRE>
<P>
Es ist ausreichend, Anfragen lediglich  an <STRONG>einen einzelnen</STRONG> Key Server zu
schicken. Nach der Bearbeitung neuer Schl&uuml;ssel werden diese automatisch
an die anderen Server verteilt.
<P>
Ein Beispiel:  Um einen neuen Schl&uuml;ssel  an den Key Server  zu schicken,
oder um einen  Schl&uuml;ssel zu aktualisieren (nachdem  neue Signaturen
erzeugt worden sind), wird die folgende Mail-Nachricht geschickt:
<PRE>
        To: <A HREF="mailto:pgp-public-keys@keys.de.pgp.net">pgp-public-keys@keys.de.pgp.net</A>
        From: johndoe@some.site.de
        Subject: ADD

        -----BEGIN PGP PUBLIC KEY BLOCK-----
        Version: 2.6.2i

        &lt;blah blah blah&gt;
        -----END PGP PUBLIC KEY BLOCK-----
</PRE>
<P>
<H3>Kompromittierte Schl&uuml;ssel:</H3>
Wie  in  den
<A HREF="http://www.zerberus.de/~christopher/pgp/inhalt.html">PGP-Anleitungen</A>
beschrieben, sollte  jeder PGP  Benutzer ein  sogenanntes <EM>KEY REVOCATION CERTIFICATE</EM>
erzeugen   und   dieses   sicher  verwahren.   Sollte   ein   Schl&uuml;ssel
kompromittiert werden, mu&szlig; dieses <EM>CERTIFICATE</EM>  an den Key Server mit dem
&quot;ADD&quot; Befehl geschickt werden.
<P>
G&uuml;ltige Befehle sind:<BR>
<PRE>
Befehl                  Ergebnis
<HR>
HELP                    Sendet diesen Text (in englischer Sprache)
HELP land               Sendet Text f&uuml;r: (DE, EN, ES, FI, FR, HR, NO)
ADD                     Wenn die Nachricht einen PGP Public Key oder ein
                        Key Revocation Certificate enth&auml;lt, wird dieses
                        in den Key-Ring aufgenommen.
INDEX [1]               Ergibt eine Liste s&auml;mtlicher PGP Keys, die von
                        dem Server verwaltet werden (-kv)
INDEX keyid             Ergibt eine Liste aller PGP Keys, welche die
                        &lt;keyid&gt; enthalten (-kv)
VERBOSE INDEX [1]       Ergibt ebenfalls eine Liste s&auml;mtlicher PGP Keys;
                        allerdings in einem erweiterten Format (-kvv)
VERBOSE INDEX keyid     Ergibt eine erweiterte Liste aller PGP Keys,
                        welche die &lt;keyid&gt; enthalten (-kvv)
GET [1]                 Fordert den kompletten Key-Ring (in mehreren
                        Teilen) ab.
GET keyid               Fordert den Schl&uuml;ssel der angegebenen &lt;keyid&gt;
                        ab.
MGET regexp [2,3]       Fordert alle Schl&uuml;ssel, die mit  dem angegebenen
                        regul&auml;ren Ausdruck &uuml;bereinstimmen, ab. Der
                        Ausdruck mu&szlig; dabei l&auml;nger als ein Zeichen sein.
LAST days [3]           Fordert die Schl&uuml;ssel ab, die w&auml;hrend der
                        letzten &lt;days&gt; Tage aktualisiert/erg&auml;nzt wurden, ab.
<HR>
</PRE>
<P>
<H3>Bemerkungen:</H3>
<DL COMPACT>
<DT><EM>[1]</EM> <DD> <STRONG>Diese Befehle f&uuml;hren zu sehr gro&szlig;en Mails!</STRONG>
<P>
Sollten Sie diese Befehle an  einen der Key Server schicken, m&uuml;ssen
    Sie  aufgrund  der  gro&szlig;en  Menge  an  Informationen  mit  riesigen
    Emails  rechnen.  Viele  der &uuml;blichen  Emailsysteme  k&ouml;nnen  Mails
    dieser  Gr&ouml;&szlig;e nicht  korrekt  verarbeiten  und f&uuml;hren  wom&ouml;glich
    dazu, da&szlig;  solche Mails an  die Key Server  zur&uuml;ckgesendet werden.
    Dar&uuml;ber  hinaus ist  es nicht  wahrscheinlich, da&szlig;  Sie s&auml;mtliche
    Informationen  jemals  ben&ouml;tigen.  Zur   Zeit  (M&auml;rz  1997)  haben
    Antworten der Key Server folgende  - allerdings rapide anwachsende -
    Gr&ouml;&szlig;en:
<P>
<PRE>
    - INDEX                Ergibt eine einzelne Mail (ca. 4MB)
    - VERBOSE INDEX        Ergibt eine einzelne Mail (ca. 8MB)
    - GET                  Ergibt den kompletten Key Ring (ca. 18MB)
                           aufgeteilt in 99 Mails der Gr&ouml;&szlig;e 200KB.
                           Diese Dateien sp&auml;ter wieder f&uuml;r PGP in
                           die korrekte Reihenfolge zu bringen, ist
                           unn&ouml;tig kompliziert.
</PRE>
<P>
    Bitte verwenden Sie die o.g genannten Befehle ausschlie&szlig;lich in der
    Kombination mit einer &lt;keyid&gt;, um  die Mailgr&ouml;&szlig;e zu reduzieren und
    die Key Server nicht unn&ouml;tig zu belasten.
<P>
    Bitte beachten  Sie au&szlig;erdem, da&szlig; die  aktuelle PGP-Version extrem
    langsam bei  der Bearbeitung sehr  gro&szlig;er Key Rings ist.  So dauert
    das Addieren des kompletten Key Rings <STRONG>mehrere Tage</STRONG>.
<P>
    Falls Sie wirklich den <STRONG>kompletten</STRONG>  Key Ring ben&ouml;tigen, kopieren Sie
    diesen bitte per AnonFtp von
<A HREF="ftp://ftp.de.pgp.net/pub/pgp/keys/">ftp://ftp.de.pgp.net/pub/pgp/keys/</A>
oder einem der anderen nationalen FTP Server.
<P>
<DT><EM>[2]</EM> <DD> <STRONG>Regul&auml;re Ausdr&uuml;cke in &quot;MGET&quot;</STRONG>
<P>
Beispiele f&uuml;r den MGET Befehl:
<PRE>
        MGET peter              Fordert alle Keys ab, deren keyid die
                                Zeichenkette &quot;peter&quot; enth&auml;lt.
        MGET hamburg            Alle Schl&uuml;ssel mit &quot;hamburg&quot;.
        MGET E8F605A5|5F3E38F5  Nur diese beiden KeyIDs.
</PRE>
<P>
    Die  regul&auml;ren Ausdr&uuml;cke,  die MGET  verwendet, sollten  nicht mit
    Wildcards der  UNIX Shells  oder von  MSDOS verwechselt  werden. Ein
    Stern (&quot;*&quot;) bedeutet  daher nicht &quot;alles&quot;, sondern  es bedeutet &quot;ein
    Muster,  das  dem  vorherigen  Zeichen  keinmal  oder  beliebig  oft
    entspricht&quot;.
<P>
Zum Beispiel:
<PRE>
        a.*     entspricht allem, was mit einem &quot;a&quot; beginnt
        ab*c    entspricht ac, abc, abbc, etc.
</PRE>
<P>
Anstelle von &quot;MGET .*&quot; sollte immer &quot;GET&quot; verwendet werden.
<P>
<DT><EM>[3]</EM> <DD> <STRONG>Begrenzung der Schl&uuml;sselanzahl</STRONG>
<P>
    Einige Key Server beschr&auml;nken die maximale Anzahl der Keys, die bei
    den  Anfragen  &quot;MGET&quot; bzw.  &quot;LAST&quot;  zur&uuml;ckgesendet  werden, um  die
    Maillast zu reduzieren.
</DL>
<P>
<H3>Adressen der Key Server:</H3>
<P>
Benutzer sollten als
Adresse <A HREF="mailto:pgp-public-keys@keys.pgp.net">pgp-public-keys@keys.pgp.net</A> benutzen.
Alternativ kann auch ein nationaler Server abgefragt werden:
<P>
<DL>
<DD><A HREF="mailto:pgp-public-keys@keys.ch.pgp.net">pgp-public-keys@keys.ch.pgp.net</A>
<DD><A HREF="mailto:pgp-public-keys@keys.de.pgp.net">pgp-public-keys@keys.de.pgp.net</A>
<DD><A HREF="mailto:pgp-public-keys@keys.es.pgp.net">pgp-public-keys@keys.es.pgp.net</A>
<DD><A HREF="mailto:pgp-public-keys@keys.fi.pgp.net">pgp-public-keys@keys.fi.pgp.net</A>
<DD><A HREF="mailto:pgp-public-keys@keys.nl.pgp.net">pgp-public-keys@keys.nl.pgp.net</A>
<DD><A HREF="mailto:pgp-public-keys@keys.no.pgp.net">pgp-public-keys@keys.no.pgp.net</A>
<DD><A HREF="mailto:pgp-public-keys@keys.uk.pgp.net">pgp-public-keys@keys.uk.pgp.net</A>
<DD><A HREF="mailto:pgp-public-keys@keys.us.pgp.net">pgp-public-keys@keys.us.pgp.net</A>
</DL>
<P>
Ferner sind Zugriffe auch per AnonFtp und WWW m&ouml;glich:
<P>
<DL>
<DD><A HREF="ftp://ftp.pgp.net/pub/pgp/">ftp://ftp.pgp.net/pub/pgp/</A>
<DD><A HREF="http://www.pgp.net/pgpnet/">http://www.pgp.net/pgpnet/</A>
</DL>
<P>
Diese Adressen sind stabil und erprobt.
<P>
Zahlreiche  weitere  Informationen  zu  PGP  finden  Sie  auf  folgender
deutschsprachiger WWW-Seite:
<P>
<DL>
<DD><A HREF="http://www.thur.de/home/ulf/krypto/pgp.html">http://www.thur.de/home/ulf/krypto/pgp.html</A>
</DL>

</BODY>
</HTML>
